[
  {
    "text": "My adventure with the tree began with projects from Woodprix.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Buy the K40. At least with that you know you are getting at least 30 watts from the laser. Too much for a minimum powered laser diode. Way too expensive. Maybe with a price of around $200 USD would be a great buy. Just sayin'.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Is it possible to engrave an item that is larger than the footprint of the Ortur , by setting the Ortur on top of the piece to be engraved?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "My biggest need is dpi. Most CO2 consumer lasers hit 1000. How does this laser compare? Thanks.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Backlighting tends to erode the edges of an object as the bright light from behind it actually wraps around those edges. Totally makes sense.",
    "likes": 0,
    "video": "Turn Real Things into 3D Models with Photogrammetr"
  },
  {
    "text": "Just wondering what your thoughts were on the tooli G3 and is it possible to get attachments and tools to carry out all the tasks the G3 can do on any of the engravers you have reviewed?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "you would have a good video if you either turned the music way down or even better off. Back ground music should used to fill NON commentary sections. Sorry i cannot finish this video.",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "What was the metallic-looking thing into which you engraved the Star Wars logo?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Great! I finally bought the Ortur 2 and they upgrade it a month later! Figures....",
    "likes": 3,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Also, love your videos, but please pronounce Ortur correctly. Sorry. I'm pedantic AF.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "U don't need the glasses on. That's what the point of the acrylic shroud is on the laser. I have the non pro version and love it. I only use it now for portable work so it mostly sits around but it's a great, affordable solution.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "you dont need glasses when the shield is on the laser!",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I made an enclosure for mine and made a false floor in it. The pump for the air assist and a bathroom exhaust fan reside under the floor along with all the wires and switches that are on the outside of the box. A plex window is there so I don't worry about having glasses on all the time.",
    "likes": 7,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Think i'm blind but that file link, i cant find it (test file for power in lightburn)  great video.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I think some of the items you said that would only be important to people doing manufacturing isnt the case.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Find out how to do it yourself with all the details. Just look for Woodprix :)",
    "likes": 0,
    "video": "How to Make a Simple Tool Wall for a Garage Worksh"
  },
  {
    "text": "So helpful! Starting up a STEM class at my school and I had no idea where to even start with ;aser engravers. I really apprechiate how you broke all this down and then went into more detail in the full review! My future students thank you!",
    "likes": 4,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Just watched another video and it's definitely not a closed platform. He imported g-code from free software he uploaded.. I definitely saved the video as I'm getting one Tuesday.. great review btw.. thank you..",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "i don't see the layers side bar at the left, how can i get it?  Thanks",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Thanks for the helpful insights! Wood smoke is also very toxic, FYI, not merely “no fun”.",
    "likes": 4,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I like how you  make the thumbnail show a ball, but your camera footage shows a flat stationary Earth.",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Hey,  I was trying to align the laser but when I tried to do it the laser tube doesn’t shoot the laser. What should I do?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Nice for beginners. I was trying to understand how to setup and add specific data from Lars videos. He explained everything very detailed but there was too many things. In your video it looks nicer and easier :)\r\nI'm trying to switch from Vectric Aspire so everything I have to learn from the beginning. Thanks so much!",
    "likes": 1,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "If you were only going to do engraving on wood like cutting boards would the Chinese 40W be ok?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "So what program does your computer need and what other capabilities",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Hey I’m new to lazers would this work on stainless steel?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What is the best machine to engrave larger and more rounded objects like wine bottles?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "That is not baby yoda .. yoda died this is set after thoes events",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "thanks for your sharing! we supply extreme lightweight 20w fiber laser marker. Which has a 10KG weight and an industrial laser source.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "excellent tutorial you explain things so people can understand, one suggestion though answer some of your questions, don't take my comment as hate because this really was a great video, i learned a few new things.",
    "likes": 2,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Honestly speaking, getting the Core version (without the camera), is a big deal or not at all?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "will you like to test WAINLUX K6 laser engraving machine? thanks!",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Had to watch before I decided on the Makeblock xTool, I would rather buy American but it just seems to have better functionality, software OS and more for less. Trying to figure out how to etch mugs on the rotator though. I know you have a Makeblock because you did a review on it, can you give some advice.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "I wasn't sure which came first, the Longer LK4 Pro or the Alfawise U30 Pro but as soon as you said 'Gearbest own brand' it made sense haha. Great video!",
    "likes": 0,
    "video": "Is a Budget $250 3D Printer worth it? Alfawise U30"
  },
  {
    "text": "but if it is for complete begginers  you need like NO1 set z up in settings ,,normal way is y up that way it will carve side of it not z  :)",
    "likes": 1,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Not waste but certainly paid over the odds. Could have bought a 40w for $300 and upgraded it for much less.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Nice work. Same as you, I'm just beginning my woodworking hobby and wouldn't you know it? My wife also asked me for a window box.",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box"
  },
  {
    "text": "Hi how do I add a blue or red line on yeti cups when engraving ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Brother can you tell me this would be a better option for beginner level i am also interested in this but can't decide on anything yet also i wanted to do something in gifting so this will be a better choise?",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Amazing tutorial! Using parameters make the proccess much better and easier. Thanks a lot!",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Not the best review, should have had a better understanding how the machine operates before offering up a review",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "You could put a modern day laser cutter on its side.. With a computer controlled rotating plate in front of it.. And a protective plate behind that.. And then you could cut in 3d...\n\n3d plastic print your object\n3d laser cut your object..\n\nOr combine them into a single device",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "You could probably turn that device into a 3d laser cutter.. If you stood it upright and put a 3d object on a turning plate and put a plate behind it.. You could cut in 3d..by adjusting the rotation of the plate the object is on...",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Cooperation request:\r\nHi dear sir,could you tell me how to contact you?we want to cooperate with you,look forward to your reply,thank you",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Been using Fusion for a while, and still learned some things! Thank you! \n\nQuestion: Why not use 0,0,0 as your center and mirror off that instead of making construction planes? I feel like you can skip a bunch of a extra steps that way.",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "2:12:04 theres this simi glitch slightly above the container",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Looking at the sun is healthy for eyes actually. If u wanna correct you vision and keep your vision healthy you should consider looking at the sun directly for 5 minutes daily. Off course dont pick the time of the day when the sun is the brightest where its blinding you.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Thank you for the tutorial! I can't wait for the dollhouse videos! I I just bought a laser cutter and I want to make all the furniture for my dollhouse.",
    "likes": 2,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dol"
  },
  {
    "text": "Who would actually build something like that?\n\n* sad pong krell noises *",
    "likes": 1,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "I like the idea of the 50w but being over Tripple the price of the 40w takes it out of the running",
    "likes": 32,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "What is the best to engrave leather.  Nobody  gives a comparison with leather",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi , I need buy a machine for dog personal tag making , stainless steel material , any advise? Thank you",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi! Thanks again for a great tutor. Im stuck tho, and hope to get some help. I get \"Warning: Empty toolpath.\" when trying to do adaptive toolpath as you are doing. Why could this be? thanks",
    "likes": 1,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "The comb thing is for your fish tank - the pump is a fish tank aerator pump and that is the outlet for lots of bubbles. You don't need it.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Dude.. I used to hate sanding and watching this video reminded me of the hours I spent sanding with a random orbit sander. Last summer I had to do a big project and bought a rotex 90/ct 15... now I love sanding. Treat yourself brother.",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "Wow, a laser with FDA approval! I can finally cut buffalo wings right!",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Can I upgrade it with 80watt laser head.... Like i buy 80watt  head, controller, high torque motor... Mounting plates... Can I upgrade your higher watt head for MDF cutting",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Autodesk can't be more evil to its users. Imagine removing functionality for all users, just because a handful few have misused it commercially. This is unjustifiable. I am thankful to the high skies that I currently hold a student license, so my projects are still 'alive' and can be worked on. Certainly gonna be migrating though. Can't trust someone who keeps making drastic painful changes without asking out community opinions.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Wholly crap almost 5k for this thing? You can get a much better and waaaaay more powerful fiber laser for under 3k.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "So I need a laptop or computer to run the thing or can I use an addon control panel with a preloaded svg?",
    "likes": 1,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Can you do a video of this unit on something like a yeti cup?",
    "likes": 5,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I've seen countless people dismiss gloforge due to the software being online only.  What is gloforge's angle on this terrible choice?  Sure, have an online version of the software available, that's nice, but why not give users the option to use it offline?  Why are they so resistant to this very basic request?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "what sensor does it use for the autofocus? Would be great to mod it on other diode lasers",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I tried to use your coupon code when buying one of these but it said it was invalid :(",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Do you think there's a big difference in the different wattages of the Otur 2? And should I wait if I'm not rushing in buying a laser engraver and wait a month or two in hopes of this releasing and it being double the price?",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Free is a good price for those who will only use the software occasionally. There are Sooo many companies using the subscription model and for most people it is not good value to pay a monthly fee for something they will rarely use. If we subscribed to them all they would seriously dent our bank accounts",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Please no more stupid Baby-Yoda engraving...we are interested about CUTTING and nothing else. Sure for cutting a Co2 better but also cost a lot-lot more, and also a lot more complicated\n\nIf it is dual laser and 10W it should be able to cut 5mm plywood MDF and many other thing which is just enough....  Please test cutting!!!!",
    "likes": 4,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "That autofocus is super cool. I mostly use a JTech on my CNC, but this is cool too. Better than the Ortur for sure. Being American-made too vs the Chinese Ortur brand is a huge plus. Price upgrade isn't that bad either.",
    "likes": 9,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "It should be mentioned that the Protective/Colored enclosure they offer as an addon also has some updates, an extraction fan/vent.  Also all updates based on Backer suggestions.",
    "likes": 6,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Thanks a bunch, I can use this for laying out tails while having a fully laid out plan for cutting grooves, dados, rabbets, cutting tops off, etc.... all without corrupting the reveal and or symmetry due to kerf lose, spacing being off optically from different angles/internal & external views where drawers and other joints are in same line of sight.",
    "likes": 0,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "Did they send it to you to review and return or to review and keep?  If it is to review and keep...you are 100% sponsored  my friend.  If not...more power to you.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "The Ortur sucks, I had one and in the course of one year I had one laser head go bad and two motherboards....run away...don't waste your money. You'll be better off getting a K40",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "these would be great i guess if you can get one. ordered one from gearbest and the did not ship for over 3 months when contacted they said they don't know when they would be able to ship.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Would love a review of different laser cutting machines for tool shadow boards",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi, can this machine cut 1/2 inch or 1 inch XPS foam?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Thank you for the vids...I've been using AcadLT and V-carve Pro but I am in need of other aspects for design, like a new shop. I am going for Fusion 360.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Hi Mate,\ni am trying to start selling some customized souvenirs (fridge magnets, pens, bookmarks, snowglobes etc) can you pls help me which will be the best products for me? regards",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What would be best laser set up for myself, looking to make metal business cards and more projects for work related :)",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "My laser just like that won’t cut through anything at barely 20 hours of operation.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Did you get those scrap pieces of wood from Tinkertopia?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I am looking for a laser engraver for jewelry. Would this printer not work for that?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Hey there im looking into buying a laser cutter and engraver, i have zero experience with laser machines but i want one ti start making acrylic stamps and things like that to sell on my website since i dont have  any experience and im not super tech savy which machine would you recommend for me to buy im also hoping to stay under 3k also dont want an itti bitty cutting space.... helpppp",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi. Thanks for these great wood working videos. I mistakenly used Polyacrylic instead of water based polyurethane (Lowe's had it sitting right next to their oil based polyurethane). Now, months later, the paper from boxes, like cereal or popcorn, sticks to the polyacrylic. I then have to scrape the paper free. How can I fix this? \n.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "A crappy little robot arm? Who cares? We want to see you build some shit. Something inspirational. You've got mad skills dude, crush on",
    "likes": 1,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "Great information.\nSo are you saying the budget Atomstack, Ortur, Fox Alien lasers won't effectively cut wood?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What's the link of the unit you review or recommend?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "So what laser do you recommend for people who are doing car audio",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello everyone,\n\nI have the same machine and have been engraving tumblers for about 5 months now. Just recently, the machine that has the rotary attachment started engraving the tumblers very badly. Like I tried everything to fix it, I put max resolution, lowered the speed all the way to 10, tried double engraving (it didn't work, the tumbler slips the second pass), I tried using the magic eraser to clean the leftover residue, and none of them worked. Does anyone know what to do in that situation? I am a seller on Amazon and Etsy and this problem is killing me.",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "If your lucky enough to have a thickness planer and jointer. Run the stock thru the planer first to establish parallel surfaces, then joint the edges. That way you’ll have better squareness and less chance of any gaps between the glued up table top boards. Just my opinion.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Content is great but really hard to follow because too many zooms in and out and mouse mouvements. Then you talk really fast. Just remind youtube can be watched all over the world… I don't speak english but french, so please try to be a bit more calm, this would make things way more easier to understand for everyone. Thanks anyway.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "A question.. after a power outage during operation, when power is restored does the laser restart automatically",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Man fusion360 is so damn difficult to learn. Stressing me out. Appreciate this video.",
    "likes": 2,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I was looking at OMTech  130watt with chiller and passthrough on all 4 sides @ $5000.00",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Are you going to ever do a review/comparison to the Sparkmaker LaserPro?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "i have found varathane brand to be very cheap.. i am forever a minwax guy now. the difference is night and day in quality.",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "can it cut foam?  Foam so i can store miniature in a box type of foam .",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "dude..\"maybe\"? \"super, super, super tin wood\"? with my Atomstack i heve no Problems with cutting 3mm wood. for me it is enough.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I like the advantages vs the Glowforge but the Glowforge can 3D print, can the Muse??",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "hello sir , can you tell me how long will the laser source last if you use the machine 1 hour daily...how much extra if we were to buy an extra laser source.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What is the best machine if I want atleast 40w, 3d laser printing, cnc, and engraving but also has a large work space? Glowforge pro has an opening for large items but not a large work space and I'm getting mixed reviews on the Snapmaker 2.0. And is less that $6k, if anyone can point me in the best direction I'll be grateful 🙏🏾",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "at 10min in you go to geometry. When i get there i have a different panel than you got. Is that because you used face mill and i used the only tool i have (1,2mm flat head)?",
    "likes": 1,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Seeing a lot on AP Laser, know anything about them? Thanx",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Will this thing cut 1/8\" plywood, or not powerful enough?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Anyone with experience can tell me if these 5w lasers can cut 5 mm polyethylene?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi, there! Do you know if I can engrave metal with this one. For example, to make PCBs?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi, did you try it on some sort of metal? Is it capable to do it? Thanks",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I am enjoying my k40 so far! I am having trouble with some of the design stuff though...\n\nTo create a file that works for vector cutting, I am using dxf files, but the size is shrinking when I save it as a dxf file in inkscape.\nFor example, my design in inkscape is 100x100mm. If I save it as a svg, it goes into Whisperer just fine. If I save it as a dxf, it come out to about half that size. \n\nAny advice on this?\n\nThank you!",
    "likes": 8,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "_I was assigned to draw this bed 2 years ago, and to this day, I still don't understand how to draw the bed. Even after viewing the free course. It's very confusing._",
    "likes": 1,
    "video": "This is Why I Use Fusion 360 to Make a Bed."
  },
  {
    "text": "Ok, I'm just looking for something like this (I hope)! Planing to use just for hobby (dioramas) coz I guess I will speed up my progress like brick texture,  cobblestone, cut windows frames parts, and all what I need for models.... but with my 0 knowledge on this field, I want to ask first is this one good or is to much for me? I would like and appreciate some opinions",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "This video was the reason I bought a Muse 3D when I upgraded and it's now the centrepiece of my own Maker channel.  Thanks for this!",
    "likes": 9,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Is there a good cnc of this price with just the lazer?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Hello . Thanks for your videos. I am a newbie but i am an airbrush artist and i would like to know if i can make high detailed stencils from mylar sheets with this Ortur laser machine? Thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Glowforge is horrible! Lemon company. I went thru 4 of those plastic crap!  How could you even pick it as a runner up?  Slow speeds , high pricing, small bed.  The air assist is a laptop computer fan.    I honestly lost faith in your videos.   🤦🏻‍♂️",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Which one would you prefer to print personalised name on makeup brushes ? Please",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I am trying to set my laser up and find the instruction manual to be very unhelpful. If you could please share an resources or make another video doing a step by step sep up, that would be amazing! Thank you",
    "likes": 4,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Good luck with customer service if your little Chinese laser breaks",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Out of all your lazers which would be best/affordable for a small workshop for some logo's and sayings on wood?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "What can I use to do stuff like on nerd-loot.com, can you recommend some good all rounders. Budget cap $4000. Explore different price points please.\nRotary, glass, wood, etc and long term",
    "likes": 0,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "Regarding the contour outline, have you tried creating a base feature on the model and then converting mesh to brep? usually this is a good way to do it, but doesn't always work well for high complexity models.",
    "likes": 2,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I think im the only person here that this laser dont work :(    when i try test laser it only make one \r\nstraight line. I am getting  lots of error 9",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Do you think this is suitable for decent engraving on metal business cards?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I need some guidance. I love the information given. But I now reside in the Caribbean and would like to order a laser engraver for hobby, but one that is sure to work as it will be challenging to return. Which machine would you recommend at a budget at $500?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What about pricing?  I've been using Sketchup 2017 for free.  And if I decide to go Pro, it will be $300/year.  Fushion has a free basic version for a year.  But then it's $500/year after that.  Is it really worth an extra $200/year?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "I am really wondering why people in science still use the Imperial System in the USA!",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Did you add the purple and green lights inside & if so can you make a video explaining the installation please",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "would you recommend this for round surfaces and etching off powder coating.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Does it work well for a circular cup? For example, a wooden cup?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I have 34 years in the laser Business... I have seen them come and go... the likes of Epilog and Universal.... In 1991 I laser engraved the Weatherby Lazermark for them in Santa Ana CA on a 75-watt LMI ( 145K investment) then Epilog comes along and pitches the summit a 45K Boat Anchor if it was a racehorse it would still be out there trying to finish a mile race! You have to understand what Lasers can do and do not do. I hope I can purchase something again soon now that even a 100-watt cutter and engraver are less than 25K!   Our Laser Shop also did acrylic we had a local shop that had at the time a 600-watt flatbed Mitsubishi and it would cut 1/2 inch acrylic like butter! Miss those days!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "video quality is awesome but i think the video title should have 40k review not \"omtech k40 review\"  there some features missed that other k40s dont have.  love the vid tho watched it three times.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Thanks for that!  gave me several things to remember NOT to do!  LOL!  Much rather learn from someone else's mistakes!!  Nice video ! Very Helpful!",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "I was wondering if the ortur can engrave rocks and stones like say marble and granite?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "can the ortur engrave stainless steel? like jewelry. and would you recommend it business-wise on a budget?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Can the CO2 ones engrave rocks like agate? How deep? and if you go over the same thing again does it engrave deeper?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "what would you recommend for cutting 3mm perplex acrylic?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "this is great, I'm finishing my workshop this coming week and this tool wall is just the kind of thing I'm going to build, thanks for the tips. I like the top shelf, though I think it would be good left open on the front so that it can be used to store different grades of sanding paper in each section. I like the idea of the light too, gonna do that for sure.",
    "likes": 0,
    "video": "How to Make a Simple Tool Wall for a Garage Worksh"
  },
  {
    "text": "Its free after all. Maybe the changes came as a result of people using it for commercial use. Pay for it. Its very cheap.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "I'm biased but I did look at Muse, GF, China import, but CO2 machines IMO Boss gives more bang for your buck.  Their engineering an impressive laser now -albeit its BIG.  Support is great.  Great vid!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Dudeee, reversed the spindle....?\nThe V bit can cut in either direction...?\nWhat are you even talking about?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "I am stuck at 25:08. I have mirrored the top from the bottom and now I am getting holes I just made for legs on top too! How did you overcome this? I thought you have mirrored that component too, but seems you actually haven't?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "This is hilarious... I love all the b*%ching & moaning from the \"something for nothing\" crowd... Fusion is amazing software and even in it's throttled back form, it is a priviledge for the freeloaders to be a ble to use it. I have paid over $40,000 (Australian)  for Solidworks over the years and that is cheap compared to ProEngineer (Creo) and UniGraphics that preceeded it, but Fusion is way superior, especially if you need to use CNC etc, the Delcam / FeatureCam / HSMWorks tech rolled into Fusion is outrageously good for the price. So take your free subscription and go to FreeCAD, or other halfway house for amatuers, and there will be far less wingeing..",
    "likes": 3,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "What is the way to go for a small hobby gunsmith that wants to engrave say names or designs on firearms? Id rather NOT support China..like made in USA products.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "How does the ortur laser master 2 compare to the Atomstack a5?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Thank you for all. This is a great video. Can't I wait for it arrive. Do you know how to install air asistence?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "This was so amazing, it can move around to see woww",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "is there any laser engraver that works on cylindrical metal objects covered by acrylic or epoxy resin?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hey bro im thinking about getting one of these care to help me out on finding the cheapest one I can for polymer?! Please and thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Would this work if I punch holes in an art canvas? Thanks! :-)",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  /"
  },
  {
    "text": "can Photogrammetry produce a 3d model for a cnc router..?",
    "likes": 1,
    "video": "Turn Real Things into 3D Models with Photogrammetr"
  },
  {
    "text": "What would you recommend for engraving silicone wristbands what machine let's say a budget machine",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Do you also prefer fusion for cnc router work? Im currently learning fusion for cnc and furniture modeling.",
    "likes": 0,
    "video": "This is Why I Use Fusion 360 to Make a Bed."
  },
  {
    "text": "At 17:50 in the video, is that paper that you are marking? and if so, did it lase through the paper? And what thickness is that paper?",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "How does this work if I need to engrave something bigger than 400x300?\nI am really in love with Ortur laser engraver, but I would like to buy 900x600mm, would you recommend any other laser brand? Was thinking about Neje...to be in the same budget diode laser",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Use a long board that also wide then easy on the mitre saw.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "Which would be best for cutting out sacred geometrical shapes?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "HOW MUCH WOULD YOU CHARGE ME IF I HAD YOU CUT ME ONE  ?  I JUST DID THE GIRL TO MEDUSA CHANGING PIC THAT I COULD TRADE YOU ?????",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's H"
  },
  {
    "text": "Really enjoy the videos. Do you feel this laser would work well for engraving Lamacoid warning labels? Or do you have any sub $500 suggestions for a laser that would?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Thank you for confirming I don’t want a glowforge, I’m gonna get the blue Chinese laser!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Very informative. How long did it take to do the large portrait?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I'm a little hesitant on buying a random one on ebay that could be coming from anywhere so I'm going to buy directly from your link that goes to the company page.  I can't wait to get it!",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "even today the personal use license is free for 1 year only, the fear that they might take it away in the future is always there \nwhat do you think?",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Right now it says 1 year free .... to me that means the risk of loosing what you spent so much time learning before you can afford it...",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Hi,could you recomend a laser cutting machine for jewelry, laser star is awsone but very expensive. \nLooking to invest 8k to 10k ,thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Thank you so much for this video. I’ve jus t bit the bullet and bought a K40. Total novice. This helped me so much. be back soon. ;-)",
    "likes": 2,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "i tried on my VR and i’m afraid i’m starting to be convinced the earth is flat",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "So what’s a good one for engraving zippo lighters ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Will the glowforge stipple glock frames, pmags, etc?? My wife wants to make crafts,  and i agreed to it so long as it will do the work i wanna do occasionally also. Any suggestions for what would be best for this situation? Thanks everyone.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I bought the paint organization system recently and the files are in pdf format.You have no contacts on the website and no information so i had to contact you here.How do i import the file in lightburn?I tought the files are in DXF but PDF, why?I need them in dxf format for laser cutting.Need help.",
    "likes": 2,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "Hey so i got a question what kind of Machine would i need if i want to cut fabrics like felt insert with adhesive, fusible web and satin? it needs to be precise and not burn the material.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Nice review. Have you tried laser engraving a wooden or acrylic pen. If yes, what were the results? Thanks for sharing.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "How tall is the table that you have ur 50W on top of?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "You didn't answer the question: Is it the best budget laser engraver?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Please correct me, but aside from specialized spray, I'm almost positive anodized aluminum is engrave-able in CO2 lasers..",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Definitely one of the better videos, i appreciate you comparing more than only kickstarter\\novelty machines - I didnt catch this in the video, but any experience with Thunder Laser?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great video!  I own a Glowforge, but I've had a few pet peeves.  The biggest is that I can't use AutoCAD files with it.  Is this unit different?",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "I want a laser to add logo to cutting boards— will the ortur 2 do the job?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I missed this video around Halloween time but got to see it now.  It came out great.  I wanted to have this done as large as the original if I could have found someone with a CNC but no dice here in NYC.  Glad you liked my photoscan of the Plaque.  It came out better than I originally thought it would but too bad Autodesk decided to discontinue its photoscan program.  It was the only one that I've used that worked great.",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's H"
  },
  {
    "text": "Does it come with any bits? And does standard bits fit into it?  I have their laser and love it. Am totally new to cnc routers though so this would be my first time using one. Is it the best for this price point?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I was going to buy your fusion 360 course, but after watching this I don’t know...you were kind of all over the place and really fast.",
    "likes": 13,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "please stop leaning in to the camera, it doesn't make for great viewing, great vid others wise.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Thanks for the review. I am interested in seeing if it will work on a round object and also the minimum distance from the material to the laser. I'm a wood turner so Id like to use it to embellish the rims of bowls and sign the bottom of my work.",
    "likes": 4,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Thank you for your help. do you think the simply DIY can work for a small personalized iphone case covers where you put customers names ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "is this exposed laser safe for the eyes? i know they come with a pair of goggles but i dont know if they are adequate or if other people in the room are safe. Should i build an enclosure?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "have you heard about this lazer? this guy swears by it\n\nhttps://www.youtube.com/watch?v=7P661CYrgh4",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "I wish you would have done this indoors, controlled lighting",
    "likes": 0,
    "video": "Turn Real Things into 3D Models with Photogrammetr"
  },
  {
    "text": "If you made that chart yourself based on your own experimentation, I'm subscribing. That was a great read whilst high.",
    "likes": 11,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Would you say this is better than the glowforge? I was thinking of using it to make large stamps",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "would you say this is better or comparable to a glowforge? it seems like the price is unbeatable",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Your videos are horribly presented.  Maybe if you spoke more slowly, you wouldn't be making so many mistakes requiring so many jarring cuts.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello can this engrave on cylinders? Like tumblers and cups?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I am still really lost. I want a laser cutter to make dollhouse miniatures in 1:12 scale at the largest and 1:144 scale at the smallest. I have a Cricut Maker cutting machine and it doesn't cut precisely and small enough which is why I'm looking for a laser cutter instead. The most common materials I would cut would be around 2mm or less, matboard to thin wood.\n\nI'm 33 but I find technology to be a little annoying. It's not my favorite thing to figure out software and do upgrades. I don't think I'm even capable. So I need something user friendly that I can use with SVG files.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I have heard about engraving metal objects and cutting 3D puzzle pieces but i read that reflective surfaces are bad for this type of work. Can you test if those are true?",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Why use fish eye lens? Not what your your real eyes would see 🤦🏾‍♂️",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "This is by far the best laser cutter video I’ve seen.. I’ve been researching for weeks and was really overwhelmed. Thank you for the comprehensive reviews and including so many options for us to further review. I especially appreciate that you included a variety of price ranges as well as ease of usage - or lack there of.\nThis is exactly what I was looking for, thank you for taking the time to put this together!",
    "likes": 21,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I bought this in a 20w however, it did work the motherboard on machine was faulty.  Got to looking at reviews and alot of people that have bought it also had same problem. Would not recommend this laser.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I see flerflers in the comments \nI just wanna say one thing. If this is flat earth proof , why can i only se america \nWhy cant i see europe asia australia and antartica \nAre you flerflers saying america is the whole earth",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "This is a great video! Thank you so much for the input! Curious, what's a good engraver that would work with a curved surface? For ex. Bracelets?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi there, I've checked the comments but I can't see an answer, is the OMtech k40 compatible with Mac? Thanks",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi, I am new to CNC .. which machine do you advise me to use?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I'm looking to create acrylic stamps to use for my bakery and want to know what's best but also small to cut detailed designs into acrylic. Any suggestions??",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "will this laser engrave letters and numbers on a plastic cattle ear tag.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "thanks for a great video.. I've been thinking of purchasing a laser cutter for my hobby crafting..",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "slow it down buddy.  we are absolute beginners right",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Which laser engraver would you recommend for larger pieces kn a budget. Not necessarily big pieces just taller pieces, around 30cm max height.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Why are there no go pro videos from flat earthers proving the earth is flat?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I want to engrave my desk ... So i guess this would work?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Does the wispherer software left you use this with a Mac? And would it cut 1/4 thick plywood ?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I regret that I bought the Ortur. It’s seriously horrible.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Do you think the first engraver from ortur would be able to cut this 3M adhesive into shapes for my mouse feet pad replacements?\nIf so how would you place the 3M adhesive flat on the table?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I don't recommend Voiern laser machine, I bought one in December, a 20W fiber laser, it works well one month and suddenly died. The supplier, Voiern (Jennifer Zhao) doesn't offer any help but to tell me to install the drivers again and again. Bad services and very poor quality product!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I am just getting into laser woodworking, any suggestions on what machine I should purchase to make 3D chess pieces and able to laser cut up to 1/2 in wood, if that is even possible.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Nice review this one looks interesting 🧐. How would you compare this to the glowforge and muse full spectrum ? I’m looking for something that can do it all. I’d have a easier time saying yes but if the more expensive one will save me a headache I can save up to invest in those too. Thanks for the video 🙏🏼",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "Any chance is there a cnc laser engraver and cnc router combos that you can do a list on?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Don't cut plastic if you don't research what gases or fumes will be given off!!  for instance vinyl\ngives off Hydrochloric Acid fumes that will rust any thing they contact and destroy your lungs if you breath it.  PVC will give off Chlorine gas.  Deadly. used as a chemical weapon in the first world war.   Be safe. RESEARCH before you cut plastics.  The glue in some wood products is toxic when burned as well.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Thank you for this video! I am very interested in 3D CAD and printing for private use. What would you recommended to beginners? Fusion 360 or Freecad?",
    "likes": 6,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Is there any laptop computer that this lazer cutter does not work with or can you point me in the direction to find that info out?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi. Which Laser would you recommend to cut fabric (cotton, poly, corduroy, fleece) for applique shapes?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I recommend Woodglut to every beginner and not only.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "I just ordered one. I get that this one won’t work on most steels, but can you recommend a baseline setting to engrave steels? I’d been looking to build a 3D printer frame one, but I can’t get a straight answer for metals. I need to be able to serialized and logo small metal, un coated parts.",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I want to graver high carbon steel blades which are the best for this",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hey, anybody here tried smaller laser engravers, mobile ones? I need to engrave inside a wooden tube, usually 10-20“ diameter, perfect would be if 8“ is also possible - which means the surface is round, and it would have to operate inside of a tube. The version one might work well, as it has an extended laser arm, not the typical x/y table.  What i am about to engrave is drum shells from inside... 3x3“ minimum. Anybody?!",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Will this ORTUR work on engraving PMAGs or do I need a Fiber Laser like the one shown in your other video (Laser Master Fiber Laser Marking Plastic - AR15 PMAG)? \n\nMy immediate need is to engrave 40 PMAGs so it's hard to justify buying a Fiber Laser.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "if ya wanna be nice you could send me that Makeblock laserbox please. lol het it don't hurt to ask nicely",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "Nice Video and has a lot of information in it.    I want to get into a Laser Engraver but of course there is so much info to digest and make decisions on.    Because of the COVID virus we have now lost the only place I would have gone to look at and ask questions about it.  That is FRY's Electronics.  I was going to build a newer computer with newer components.  I like to buy locally and now there is no second choice place to go.  The whole printing and engraving environment is changing so fast I have been deliberately slow to get involved and jump in.  Would you be able to make suggestions on where to focus if I mentioned some of the criteria involved?  1)  Engrave small objects like in the size of Keys, Knife handles and up to the size of 6 inches square for just a little more versatility;  2)  Because of size - price should be small due to the versatility and usefulness is reduced (comparatively);  3)  Precision - due to the size of the engravings they will be examined closely.  4)  Engrave or etch but NOT cut through.  5) Small because of my needs and can't have it take up a lot of room.   6)  Engrave any metals that will dis-color noticeably. \n\nAll these are valid reasons that must be evaluated together.     If you can please give me a few suggestions.  Because I don't know what the prices may be, please consider price to be of the lesser requirement.  I want a good one that will do the job.  Thanks for your help.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Just ordered the Master 2 laser which I am still waiting for but looking at the steel plate at the bottom,what would you put under it to do cutout like Yoda with solid wood?Would you go through and hit the plate? Really new to this stuff so hope it's not a dumb question.Thanks",
    "likes": 3,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "NO, I am a maker, and I cannot use my 5 axis cnc that i made from scrap material, they are getting important features away from makers. I cannot afford paying the license, and that's frustrating, mainly for a user like me that contributed with so many youtube videos about fusion360. Now i cannot make my videos anymore and i will have to look to another solution to replace fusion360 for real",
    "likes": 5,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "This video is all I ever wanted and needed. Thank you!!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "i use f360 but still confused to add some model like sketch up did. i mean add some stuff like stove, cup etc, in sketch up we can download in, can the fusion 360 did it to?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Hi there, can this be used to engrave in brass? I am looking for a machine capable of engraving small wax seal heads in brass. thanks",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "So what's the next best thing? Moi? Kus I have a feeling this bullshitnis just the beginning. Ugh...",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "This is super helpful. Are you also able to get a useful cut list from Fusion?",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "just got good deal on Agnes by hurricane lasers curious of your opinion on it im totally new to it",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I'm looking for a machine that will crave on rubber for rubber stamp making.  What machine would you recommend for this function please?  TY  would this machine work for that?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Im happy for Vectric, having it for the rest of my life, thats no paine and waste of time.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Nom: LegHight \nUnité : mm\nExpression : OverAllHight/2\nValeur : 203.20 \nMe : 😍🥰😍\nThank you so much I didn’t know this existed",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "the weakest link is the rod, both machines have 10 or 12 mm rods and they will bend the same, even if a steel frame is used it will not differ. Supported rails or linear rails should be used for a rigid x axis",
    "likes": 4,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "was a great video to stumble upon after trying to find some honest answers on engraving as a total beginner! I diddd have a specific question, you mentioned briefly \"logo on cutting board\" which is my intent for one, however the unit i was looking at was kind of a box that had everything inside of it. the diode was 3w, but no one ever says \"it can engrave all of these, dont get it if you use it on these\". I want it to be able to do walnut, but everything always just says wood, and there are so many species of wood of different hardness, i cannot for the life of me find a simple yes. In your opinion, 3w diode able to surface engrave (maybe 1/8\") walnut, and other hardwoods.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "is it possible to import a sketchup model into fusion 360 ?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "This one is the muse fiber right? That’s the only one that can engrave metal?",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Hi, please help, I'm looking for a laser to be able to engrave cloth (cotton, polyester). I've encoutered that not all lasers are able to even leave a mark on the cloth, so your expertise would be MUCH appreciated!!!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Definitely excited to see what upgrades you're gonna do and how to do them.",
    "likes": 6,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Thank you for sharing this! I was just wondering when you say the diode lasers are good for engraving, does that apply to all materials? Is it just a light etching of the surface or can it emboss silicone, for example ?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "what would i need if i wanted to cut 50-100 sheets of cardboard at a time?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "great video but the detail is far to quick gone over, so missing the detail your trying to show!",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Im looking For a laser engraver to customize barber clipper blades any suggestions???",
    "likes": 0,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "Well, at this moment it is impossible to use the free version of Fusion 360. Now, there are good much problems with the files you can modify or not, but also with the files you want to export.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Hi, very nice review. One question, did you receive the laser from China or the US? I'm planning on buying one and this would be one point in considering. If in US, can you provide the necessary info to acquire?  Thank you in advance.",
    "likes": 2,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "waste of money and time get a kuka robot arm \non ebay",
    "likes": 1,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "I'm searching for a laser cutter for my sewing room. I would like to cut thick leather (both natural and synthetic) what is the most affordable laser cutter that will do the job?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "10 files is NOT enough. I’ll be sticking to Creo, yes that dumpster fire.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "1:29:20 I only see a straight horizon where the hell is the curve ?",
    "likes": 7,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  }
]