[
  {
    "text": "Hi, does anybody here know if there is a way to get this cutter in Europe? In the links provided Ebay and Omtech doesn't ship outside USA and Amazon doesn't find this product at all.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I’m trying to figure out what to use just a cut out small things metal like for jewelry bottle openers just so you know maybe 8” x 12 x 10” whatever just something to cut smaller stuff not real big signs any advice would be helpful thank you",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Very nice video. Thank you! I am looking to do some 3D files for my laser to engrave. The way that it reads it is through a black and white bitmap file. The darkest areas are engraved the deepest and as the shades of gray get lighter, the laser engraves with less power creating a 3D effect. Is there any way to manipulate the map data to do this. I know it's kind of a tough question but I'm trying to get more into this. Thanks.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "I am just curious but why is your head all super wide in the beginning of the video ?   Hmmm.. fish eyed maybe ?  And why would you use a fish eyed lense ?",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Is there a way to make the height of the mattress adjustable? Or would it be fixed wherever you drilled the holes?",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodwor"
  },
  {
    "text": "Autodesk and other cloud monopolies are the magic flying carpet that can kick you off at anytime. Before you invest a lot of time skilling, think!",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Very informative.... you mentioned metal..... what will laser gun receivers or slides?  I'd like to do hunting scenes on shotguns and also leather goods.  Suggestions? My wife wants to do tumblers and more.... thank you!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello. 6040 50w china. What is the maximum thikness you can cut acrylic you can cut, with one or more pass to have reasonable good edge?\nIs it good to do more then one pass? \n\n(10-15mm) thx",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "I love my beamo.  30w laser. Nice setup, software and camera are great. Can easily hook to my computer.  I think it goes for $1500 (I bought the kickstarter so its obviously a diff price) and I recommend it when ease of use and safety is accounted for. Research your seller to make sure good customer service is available. I haven't had problems and I've used it for about 8 months regularly. I also never cut at 50% to help save my CO2 laser, but thats a personal pref. Never look directly at lasers, always get glasses but you still shouldn't look directly at it with glasses on either.  Also research what materials you are cutting because gases released can be harmful if youre ignorant of what you're cutting. Hope this helps and glhf :)",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Would this be good for stencils - good clean edges?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "after having watched plenty of ballooning vids, I do have serious doubts when it comes to the question fake or no fake..... // how did you manage to keep the cam rocksteady all the time ? // how come, the cam never turned and tumbled arround during ascent ? // how cam there was absolut silence unless \"the fighter jet\" did blast by ? // how did you mange the descent ? // there are no blow-up picture of the latex-balloon, now pictures of debris, now pics of the chute..... // you want me to make believe that the whistling sound comes from a kind of blow-out valve, right ? // If yes, at least by time time, the cam would have moved a bit... = but NOT in your vid..... // for me: = fake........; sorry !",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I guess they just really killed the free version with last update (Feb. 2021) now is possible to edit only 10 drawings!!! That's it's ridiculous. So wanna use it for free, you can but it's just ridiculous. You can view your empty viewport and the icons. That's what it has to offer now the free version.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "I am looking to buy a laser I have a budget of 600 dollars and I want to engrave metal rifles is there anything I can use for that cost",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Well if you actually want to own one don't order from gearbest.com, they bullshit you for TWO MONTHS on shipping, change dates, flip flop when you message them, \nWORST ONLINE PURCHASE EVER. \nHAD TO CANCEL.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Did you wait a specific amount of time between each step?",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "does this do gray scale engraving, ie varying the power to get darker or lighter burns?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What's a good laser for engraving marble, hedgestone for example",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "hello! thank u knowledge! i sell engraved fridge magnets (wood), im thinking for making my own for this summer (i sell 10k per summer) would this get the job done? thank u",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "WARNING DONT DEAL WITH THIS COMPANY ... DONT falser \nvery informative video \nbut deal with a real company that actually answers the phone \nthey took my payment and never answered   my calls or emails after that",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "That pull out tray totally made me think of a toaster and its little tray for bread crumbs",
    "likes": 2,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "Why are your hilts so massive? 🤣\nLike most hilts are 8-12 inches but urs are like 18+ inches",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "Thank you for the very detailed review - I am looking at a cabinet 60w model with the external water cooler and the additional glass/mug adapter. Good advice on dealing with the US side of things, that is what I was wondering about.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Holy shit, it's a 360 cam, you can drag the image to rotate! :D",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Do you think they sent the fighter jets because of the weather balloon? They seem interested.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "any supplliers in the USA for the ortur?   the shipping delays fron China suck...",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Anyone tried cutting 5mm foamboard with the Ortur Laser Master 2 (I note they come in 7W, 15W and 20W - guessing 20W is the way to go)?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Sketch up is a toy compared to a real cad program. Fusion has a lot of problems and some incredibly stupid design decisions, but it's a million times better than sketchup, and google is a garbage company that needs to die... Well, the same can be said for Autodesk.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "I'm curious. If I were to try and cut mother of pearl for guitars, about 1/16\" thick, what would be best for this?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "That's like $800 base on kickstarter? With $130 or so shipping to US? Add in some auxiliary stuff and that price goes up to something like $1500. Pass.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Is the T-Track \"In-Line\" with the Miter Fence or is it \"Behind\" the miter fence Line?  I have built a very similar system, and ready to lay down my t-track.",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "looking for a laser that will cut through 3mm glass? will this unit do that?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "No true Hendrix fan thinks it's spelled \"Jimmy\" - smh :D",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Looking to cut a basic square out of the center of hardback book cover. Would this work? Would it leave a \"burned\" look around the square?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "What is the least count of cnc machine for drilling holes??",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  /"
  },
  {
    "text": "Is there a way to Upgrade the workspace to a bigger size?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "But it is not free. to use, there are alternatives, like Designspark Mechanical. This works a bit like SketchUp only with much more possibilities also a parametric option if you turn it on.  And it is totally free installed on your local pc, no shit with your work in the cloud. So that after 3 years of free use of Fusion you suddenly have to pay for it (nice)\nI mean Fusion is a very good software but not cheap. you keep paying If I could buy it for a price and that is it, okay, I have software for that purpose not cheap but it is my own (special cnc software v-carve pro)",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Fusion 360 is a time wasting buggy program that promises the world but fails in the basics. Draw three ellipses one above the other try and connect 4 edge rails... 3 days later there is always several points that despite using the coincident \"CONSTRAINT\" will always snap to open space just slightly not \"coincident\" to anything!!! .... WASTE YOU LIFE USE FUSION 360   🤢  🤮",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "360 cam is very cool!\ni went to scrape some schmekum off my screen and voila! 360 pan!",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "get that ground on there otherwise itll blow itself up",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "What is the cheapest laser cutter would you recommend for cutting foam board effectively?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I cant find any of the dimensions on the plans. Any chance you can share those?",
    "likes": 1,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "The glowforge (with your $500 referral code) is still $400 more than shown here in your video.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Question. Im wanting to cut hearts out of 1/4 to 1/2 inch acrylic sheets and do words on them.. for molding purposes.. what would you suggest as a price friendly laser cutter?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can I use the Ortur Rotary roller with this laser ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "You say this laser is only good for wood. So, it can not be used on aluminum or metal ? Something like a drinking flask.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi thanks for this video.\nI am mainly interested in laser cutting/engraving Silicone bands. Will this do the job or will you recommend the laserpecker or non? \n\nThank you!",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Was anyone else watching to see how long that leaf stayed on? I wonder how long it toolk to come down,lol.",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Just wondering because my stepdad just got a 3D printer. Would this to be able to engrave on stuff he prints?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Can you engrave on metals with this? If not, what is the best affordable one to use for wood, metal, and acrylic? Maybe one that could even cut thin metal signs?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What would you recommend for coated metals? Such as cerakoted steel",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Try to use a flat and thick rubber band  around the top and bottom edges where the object meets the rollers. That will minimize the slip a lot.",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Would you recommend this or laser pecker 2, for engraving on anodized metal, it doesn't have to be deep at all, the smallest laser?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great how to! Two comments... do you have a bit setter? I'm wondering how you were able to zero your 2nd and 3rd bits after facing the whole piece of stock? And next, what prevented your 1/4\" adaptive clearing pass from cutting the model out completely?",
    "likes": 3,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "The snapmaker isn't that good ur forced to use theyr software that is buggy",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I do this for a living and I cannot believe you purposely made your block structurally weak?! The reason Ikea blocks have multiple length segments is because the wood they use is scrap they purchase from real manufacturers. Making a Butcher Block Countertop that does not contain full length edge grain segments is extremely risky and counterintuitive to their nature by design.",
    "likes": 1,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "What happened to all the $400 K40's on Amazon? none available !!!!!!",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Will this be able to engrave names into bracelets / jewelry (made of Stainless steel and also some made of leather)? Thank you.",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Nice Video you are so helpful. Does this K40 cut like 3mm acrylic? I would like to see a video if you don't mind on the best way to cut acrylic.",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Thanks for great video. How small does the detail get? I want to use it to produce about 10-point type on paper with some depth so I can rollerprint it. Thanks.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "The only thing I don't like about the finished product is the bright shine, of course this is a personal choice, I like General Finishes Flat on Flat.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "*YOU CAN SEE THE JET AT **2:48:34** LOOK JUST RIGHT OF THE SUN.*",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Bad ass review, badass channel and super badass website! Thank you!",
    "likes": 2,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Try some pre-stain wood conditioner when staining pine. You'll get a more consistent finish.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Hi, Great Video. one thing I am wondering about is overheads, I see the tube is about $400 for the 450W,  just a ball park figure,  what is the life of the tube  in hours.\nThe other thing is the software, How much do Muse charge for upgrades.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "When I import the \"mesh\" 3d file, I get a mesh body instead like your nice 3d model...why is this so?",
    "likes": 3,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Complete newb to laser engraving so forgive my ignorance but can you engrave aluminium with this?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Would this be good for engraving kydex and ammo magazines",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Why the hell would people question how it works, it's simple",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "Will this laser etch titanium? If not can you recommend a good hobbie metal etching machinethat will etch titanium",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "That yellow whatever really took this from  a 100 to a 30 as quality goes.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "how is the camera attached i spin around could not see any attachment.",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "how about a video about the quality; is there any difference and compared to your 50w laser how is it (not power but quality)",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Is this work for powder coated aluminium profile? \nColored logo can be print? \nDoes it affect the surface?",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Thanks for this very good review.  Just ordered a K40 :)",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Because of you I just grabbed an Ortur LM2 and loved it for engraving. You also made me get an Omtech K40, can't wait for it to arrive. Thanks for making these awesome videos!",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "fuck fusion, support the opensource movement and use freecad",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "It would be greatly appreciated if you would give what power and speed you used especially with glass. Also, are you using rasters or vectors or both?",
    "likes": 3,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "I have been looking everywhere for that laser cutter! I havent been able to find one for sale for a while :((",
    "likes": 1,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dol"
  },
  {
    "text": "Which Machine would you recommend for laser  printing on Mylar bags",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "expensive and worthless toy.  dont waste out time with this type junk.  lol",
    "likes": 3,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "Great videos! Can you suggest a good, reasonably priced, laser engraver capable of engraving titanium please?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Very informative video! Can you make a suggestion for a budget laser that can engrave titanium?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I have a laserpecker - having trouble engraving on watercolor paper & plastic (matte) eg notebook divider.  I’ve tried 100% on power and depth - nothing.  Wondered if you have answers.  Just located your website.  I like your review",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "The discount codes aren't working for either model when in stock :(",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "im just unboxing mine and want to know about the ground wire.  what should I run it to?",
    "likes": 1,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "What attachment do you recommend for engraving glass mugs with handles?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Soo many, I just want one to cut out 1mm thick plexiglass small letter stencils for my planning",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi there cud you do video on how you can cut larger wood with doors and stop and starting laser why move wood thank you love you videos mate",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "If you want to know how to do it yourself, just look for Stodoys.",
    "likes": 0,
    "video": "How to Make a Kids Play Kitchen: The Frame/Doors/D"
  },
  {
    "text": "Which pick would you recommend for fire arm polymer stippling?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Thanks for this tutorial. I followed it to the extreme and I also have the x-carve. Couple things is this is my VERY first project in fusion 360, so it took me a long time to get everything dialed following your steps. I appreciate the thorough-ness of everything. Few daunting parts about \"you'll have to get all this dialed yourself\" when I know nothing about the program is a little intimidating, but I just followed your lead and am about to go try and cut this thing. Also side note, I took a screen shot of fusion 360, threw it in illustrator and just did a trace draw and deleted the paths inside, and it did seem to go a little quicker (Even though I lost my scale tool bar and couldn't figure out how to bring it back up) but also was way more precise on the edges (or so it seems, will let you know after the cut). Thanks again!",
    "likes": 1,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "How close is the Alfawise Pro to other 3018 models? Can I watch videos for the others for tips on laser engraving etc?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Use NATURAL wood like not a plank but on the end of the grain like a chopping board cut from a log and there would be NO fraying and it would run beautifully. Plywood is horrendous for fraying tbh.",
    "likes": 6,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Hey! amazing video, could you try to test it on a pen? and is there a need for ventilation? If there is a need for minor ventilation systems could you please recommend some? Thank you!",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Ive watched so many different videos and so confused. Im using this to basically put my logo on items I make and maybe personalize some too, most are going to be rather small 1\"X.5\" in most cases, limited quantities. So pretty simple basic stuff.\r\nIm down to 3. Cost being a issue too. \n(1) Laser Pecker Pro or V2 \n(2) Ortur Laser Master 2 and \n(3) OmTech K40...\r\nIm not using to cut but maybe templates..\r\nPlease Help what is your Much More Professional Opinion... Also who may be best to purchase through who is in the US.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Surely common-sense would dictate the computer is taken out of sleep or hibernate mode.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I have the same laser cutter but I have some problems calibrating the mirrors. The laser keeps cutting at an angle. Does anybody have any tips for me?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Can I engrave one my pic on the glass with this model? thank you.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "every single one of these ive seen, from any company, theyre all 220V wall power.. I havent seen a single 110V model. Which is what we have in the USA.. We have 220V lines but theyre for like electric stoves and stuff.. and im not tearing my kitchen apart to plug in a laser and set it on my kitchen counter.. very very annoying cuz i want one of these so bad. I have a 20 watt diode laser cutter/engraver and it cant cut worth a shit unless i do 20 passes at 100% power. So i only use it for engraving.. Not why i bought it.\n\nDo you know of a 110v model? OR, will these 220V model even work on 110v?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "You should use builders paper instead of wax paper.  Way cheaper and not much more difficult to get off the wood.  You can get it at Lowes https://www.lowes.com/pd/Blue-Hawk-Builder-s-Paper-1-Pack-Paper-3-ft-x-140-ft-Drop-Cloth/50265367.  $12.98 for 3ft x 140 ft.  I use it all the time for glue, poly, paint/primer etc.  never had a drop hit my workbench.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "I know it has a safety mechanism where if you bump it it stops burning. Do you know how to restart it from the spot that I stopped?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I would like to *cut* patterns out of ABS or Styrene plastic (not engrave). Anyone know a low cost solution for this? This video just show lots of engraving.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I am trying to get into jewelry cut engraving, I am confused about which brand, or what kind of capabilities. Could you please recommend a good machine to accommodate my request?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "How dangerous is this thing in terms of fumes and the laser blinding you? I know you said that if the glass is down, it should be safe, but I still would worry about that. Thanks..",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Hello, can youhelp me with some advice, I want to start a business engraving blank charms and selling on various sites, but im overwhelmed with all the different engravers, rotary, laser, theres a bunch of them out there for every type, I would like to engrave stainless steel jewelry, rings and also do photos on charms as well, any reccomindations, not looking to spend alot as im just starting out ,  thank you",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Any thoughts on how these compare to camfive lasers at the 5k-7k range",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Finally one good video about laser engraving. Strike to the point!",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "People accepted the clampdown on Eagle because they all switched to kicad.  The biggest pain with autodesk is how all their products require your data to be stored on their servers, but freecad requires an internet connection to start up even if it doesn't mandate online storage.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Hey I’m looking for a little laser engraving Maschine to make some logos on metal grinders. Is a special laser needed to engrave metals?",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I wanted to know can you give me some suggestions, on a desktop engraver which can do wine glasses, wood, and plastic.",
    "likes": 6,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Hi!  Thanks for all the great info!  Will it work with Cricut design space as an operating program?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "...that's not Baby Yoda...Yoda was long since ded during the Mando time frame.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "thanks for the review, it is really helpful. I have a question though: do we need to wear any protective glasses? I noticed that you don't wear any glasses isn't dangerous to use it like that?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "What is the plastic cone pointing towards burning area? Is that guide laser? Would love to see video of air assist... can I use my shop compressor for air guns? Just lower psi I assume?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Really great informative vid 👍 \nOf the machines mentioned, what would be the best for engraving on ABS plastic? Looking to etch QR codes onto power tools (drills, saws..) Thanks  Barry",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I’m looking at k40 style cutters on eBay and the 3 main “brands” I see coming up are Ridge Way, Preenex and Vevor. They pretty much all look like the same machines to me other than different paint schemes between them or I think the Ridge way had leuvers I think lol, if you had any suggestions on this I would definitely appreciate it!",
    "likes": 2,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hello friend, I bought my xTOOL D1 Pro but, it has not arrived yet and, I have a question: Do the Limit Switches have to do with the laser functions > Current Position > User Origin > Absolute Coordinates? In other words, is there anything that needs to be configured before running the machine, so that the laser head does not collide with the machine's Frames? Thanks",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Great information as always! Congratulations on your new space.\n\nI am a photographer and I have a lab make prints of my work on aluminum. I would love to see how a MOPA or fiber laser would mark on the back of aluminum prints, and whether it would generate too much heat that would damage the image or coating on the reverse side. If you are willing to test it and make a video, I would be glad to send you some defective metal prints to practice on.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Engraving stuff is the easy bit. Running s successful business is HARD. My engraving business (operational for 13 years) took three years of 18-hours a day, 7 days a week to develop and become profitable - now serving corporate customers in 22 countries around the world. To infer that simply learning to laser engrave translates into a profitable business is disingenuous. It took me a couple of days to learn to engrave - and nearly 4 years before I saw a meaningful profit.\nViewers need to know that making a kitschy trinket does not necessarily translate into a profitable business...",
    "likes": 3,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I am starting a small laser business and have a 5k budget for a co2 laser. Need recommendations on what model is best. I want to use light burn and need decent speed and rotary capability. Found your content and love the information. I don’t want to purchase something and have to upgrade several months later.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I am starting a small laser business and have a 5k budget for a co2 laser. Need recommendations on what model is best. I want to use light burn and need decent speed and rotary capability. Found your content and love the information. I don’t want to purchase something and have to upgrade several months later.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Is it possible to cut epoxy resin with a CO2 laser cutter?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I hope that the green googles You waved at 0:53 are not what You used as a safety googles for blue laser, right?",
    "likes": 2,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "Great video! Would any of these machines be appropriate for cutting thin aluminum sheets? Or what would you recommend for that? Thanks!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "You should differentiate the laser beam generation (fiber, disk, CO2, diode) and the beam steering (galvo, gantry) since they are different things and are not to be confused. Otherwise people will think a galvo can be only uses with fiber lasers which is wrong.\nIt's probably more feasible to use this combination, since fiber lasers usually have a better beam quality than diode lasers (up to 1/100, with one beeing the best and going to inf) and 1/10th the wavelength of CO2. Both increase the ability to focus the beam.",
    "likes": 2,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "You made the comment that you wouldn't use this type of laser for wood.  Why not?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "hope you can answer this question?  If you have an object that wont fit inside...like a wood wine box.....can you lift the machine and place the object under?   You mentioned width and depth but not height?   thanks in advance!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Fun fact: the 2 lights for focus is the same concept that the Dam Busters used to get the correct attitude when flying over water before releasing the bouncing bomb.",
    "likes": 7,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Shop infrastructure vids would be cool. Talk about why you did what you did. What you are considering or planning to do. Shop layout. Might be cool to do. I'm thinking of Adam Savage, he's always thinking about something and improving this or changing that. You have a move in and have more room to play with. Do you do anything with the vertical space or build out any rooms or features?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Great review. I just ordered a thunder laser. Hope to make my money back this year and order one of these at the end of the year. Unless of course you would like to donate yours to me :)",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I would love to see more fiber laser active ☺️Thank you!",
    "likes": 1,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I love the idea of fibre but have no use case at the moment (or space). I am more interested in getting a co2 galvo \n\nCongratulations on the new workshop that's a mega space and I can see it really helping!",
    "likes": 1,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "JESUS CHRIST the prices nothing for the beginner you best have the know how and will to use it DAILY",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I’m a crafter and think about add a laser. Just don’t know which one I should purchase. What would you suggest? Than you 😊",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I'm new to lazer cutting I'm looking for a low power air assist but large work area both x and y axis. Even if I have to buy add ons. Hopefully below 2500 dollars.  Anybody have suggestions",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "His idea is to look on Etsy and steal others work wtf",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I recall checking into fiber lasers about a year ago and hearing that compatibility with Lightburn software would be coming. \nWhat’s the current status?",
    "likes": 4,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Why are galvo lasers not used on a gantry?  it seems like galvo = small work area but fast travel, gantry = slow but big work area. why not do a galvo head on a gantry to get a large work area and a wider (not directly downward) beam on a gantry?  If the galvo head is coupled to a wire source (or other pump configuration), the galvo head should be easily movable relative to the diode bank (my understanding is that fiber optic fibers/wires/cables are flexible and durable).  if the gantry could move the galvo head over a large area, that might also mitigate the other con of galvo heads you mentioned (sub optimal angles at limits of galvo head), because the galvo head wouldn’t need to be pushed to reach as far to yield a work area that seems competitive (it could stay within an optimal angular range relative to the travel of and on the gantry).  I’m not currently working in the laser industry so I apologize if this a dumb question.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Video is about laser engravers looking for a laster cutter video",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "They wouldn't happen to offer interchangeable laser modules of different wattage?? Be nice to have the option.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Starter-question: Where is the main difference between LED- and CO2-laser in possible material or thickness?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I may have missed it in the video but the Diode and CO2 are different wavelengths and burn different materials, not just power concerns.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Because of your video I purchased the G Machine.  Next up is learning lightburn",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I cannot find the one with the 200x200mm work area, only 110mm",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Dude, no one looking for any of the desktop machines is looking to get a completely manual, laser cutter the size of a golf cart. It’s not even in the same race. I really hate that you spent so much time of this video on that thing.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "If I wanted a laser that engraves an image into acrylic In order to make molds for enamel pins...which laser would be best?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "One thing I've been making is fridge magnets. Easy and cheap to make.",
    "likes": 7,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "anybody know if the plans are editable or not?with which software ?",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "Question, I plan on reproducing old RC airplane kits, which machine do you recommend? Space is not an issue. Looking at the 60w one with the manual z axis…🤔🤔🤔\nGood video, 1st one I’ve seen on your channel 🤘🏻",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hi , I am new to your work shop, which I found very interesting, I have a question I might be able to find it if I go online do these devices run from a Mac sauce at all, This might seem a strange question but I’m thinking of trying to do something to keep myself busy as I am in my 70s I’m not sure whether I am capable of doing this at the moment I’m trying to find out a bit more about it. \nGive me a piece of wood and I’ll make the chair a window or staircase out of it as this was my business when I was in business by myself back in the UK I’m now retired and living in France I still have some of my machinery looking to do some smaller work if possible to keep myself active, And a friend of mine who lives in the states called Shady acres workshop is a wood turner and he has just recently purchased a laser engraving machine and we’ve been chatting online about this, PHIL FROM THE MOULIN FRANCE",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "It seems like your Omtech prices are way off right now, I just looked and the Polar is showing right around $4000 while the Gwike Cloud is $2800.\nI thought it might be because Omtech is showing me Canadian prices but no, the CAD price is only $3600.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What laser would you recommend to cut out leather patches for hats? Not for hobby, but for production.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "please use stupider soundtrack. this one is not stupid enough.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Great video was looking at getting the  xtools d1 pro and using your code though sadly only works if living in the US. As I live in uk you code doesn’t work.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Thank you for always updating us on these machines. They are extremely helpful and I have started my personalization business with lots of help from you to picking my first machine.",
    "likes": 5,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "i'm only six months late to the party but I'll still try to help everyone out and save them 8 min of their time to just say this is like $2.5k+ !!",
    "likes": 2,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Is this louder than a glowforge when it running ,  with an external fan ?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Woodglut has very good and accurate woodworking plans.",
    "likes": 0,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dol"
  },
  {
    "text": "We have a glowforge midrange machine. Had it for a year running full time. It started having problems. Couldn't get any support from glowforge. It's our business so we bought another to use while the other gets fixed & can be used as a back up. My son basically started just replacing parts & the carriage turned out to be the problem. We had the new machine for 2 months. Nothing but problems with it. It wouldn't cut on normal settings. It also would start randomly not cutting or excessively burning on higher settings. Finally glowforge sent a \"referbished\" replacement for our brand new 5000$ machine. The refer machine showed up with cooling liguid leaked all over. Tried running the machine at glowforge support request & the entire laser arm is off center running crooked & is completely noisy because the track wheels are worn.\nI highly recommend no one buy a glowforge. Their customer service sucks & there is zero product support. Their poor business model is a devistating model for your business if you are trying to run 9ne with glowforge.",
    "likes": 22,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Can you please mention how noisy it is and what about the smell",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Does any one know what the laser eye safety protocol should be for the OMTech Polar vs the 60W? It looks like the 60W has laser safety glass on top while the Polar has clear glass. I assume the clear glass will pass reflected laser light. Does that means that one would have to wear safety glasses when in the room with the Polar but not the 60W?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What can I use to profile hockey skates' blades. cut (profile) the blade to a specific radius contour. thickness is about 2.8 mm  and carbon steel type of metal.  Thanks",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Glow forge is not the plan. Too many drawbacks, but thanks for your input and ideas.... I dont own either yet, but it will not be Glow. Merry Chistmas!!!",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I've looked at Glowforge but I refuse to buy it due to the online service requirement.  I'm tired of the trend of subscription services to use hardware and the amount of e-Waste it creates when they go out of business.  Thanks for showing some alternatives.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "It's highly likely that GWeike is producing the OMTech, GWeike is the OEM for a huge portion of the chinese import market.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Many of us have the glowforge because were able to run them in the kitchen and vent out the window and it somewhat quiet once you get an external fan ,    what can be expected on this , can I turn off the internal fan an use a more quiet one.    ???",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Glowforge’s demise is their “software” (and technically price). Forcing you to use their proprietary cloud crap and then changining it to force you to pay a subscription. I wish I never saw their video and that Adam Savage wasn’t involved. We would have never wasted $5000 for the pro (we were “founders”). \n\nSeeing this is disheartening that a hell of a lot better laser is cheaper.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Glow forge NO. Why? cloud based software. Piss off. I hate that.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hello my friend. I have watched many, many laser YT videos. Yours, this one is by far the most thorough I have seen. Thank you for taking the time to make it. I am going to subscribe and of course like this video and if you have many others I will be watching and liking them to. Thanks again and GOD bless!!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I would love to see a comparison between the K40 with all its upgrades to the new Atomstack diode x30 Pro 33w laser that's coming out.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "This is rough -  can’t figure out how “sponsored” this video is. So many bad reviews on this unit and the company but I’m in love with the compact design and portability of this unit.",
    "likes": 4,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Is there any software that will run on the Apple iPad Pro (2021)?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Be careful saying that it's safer because the CO2 beam is invisible. Just because you can't \"see\" it doesn't mean it can't blind you. If the enclosure windows don't completely filter/block (gaps/seams are an issue too) the laser light then that's a problem. Proper laser safety glasses should always be worn when operating any laser device such as these.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "$ 3000 ......... haha,  that's cheap alright.   I might have chitted a brick when I saw the price.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I'm excited I was able to pick one up on Ali Express for $145.00  12/22 I can't wait.",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Hey! What desktop laser cutting machines would you recommend for cutting sheet metal? Or have you done a video on this already, hoping you can help! :)",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hey! Just used your affiliate code and bought the 80w Omtech! Thanks for making content like this you really made it easier to narrow it down which one is for me and my new business.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Okay, I'm very impressed with how you explain things; I'm not new to laser but never fully understood in the simplest term and understanding of the fiber laser tech. You're a great teacher! Sub'd :)",
    "likes": 5,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "never use flux is one of the worst machins for laser engraving cut etc",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I will never support a compnay that requires a monthly payment in order to use a product your purchased from them. 50 a month to use a glowforge outside the most basic of options is an insult",
    "likes": 7,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "the difference in work enviroments for this machine smells of silhouette vs cricut",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I wonder if this can mill carbonfiber or other composite materials",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Sculpfun has a rubbish and dishonest shipping service I ordered mine on the 5th December thinking I would get my machine shipped by DHL 16th December still waiting!!! AVOID AT ALL COSTS 👎🏼",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Great viddy! Man. Hard to see how Gf can keep their prices that high. Especially with sandboxed software. \n\nMy heart still wants that big 60w one.",
    "likes": 3,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "You should REALLY get your hands on and try the Flux Beam Box Pro, blows the glowforge pro out of the water. The only thing it lacks is the passthrough.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I am completely new to this so forgive my ignorance. Would any of those machines work for cutting fabric to make a ski jacket? If not what should I look for?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "When you described the spindle you said it was a VFD. This is wrong, it is not a VFD. VFD stands for Variable Frequency Drive. A VFD is used to drive a three phase AC motor. The motor used on this unit is a brushed DC motor. The speed is controlled by PWM, Pulse Width Modulation.",
    "likes": 2,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "This is so exciting however even at this price it's all a dream.medicine cost more to live . I'll keep dreaming through .",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "if you do many passes would it go deeper? like doing a mini 3d model?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Can this be used to print  logo size of 1mm height  and width of 5mm ,on metal ,rubber, and plastic",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Get your facts right when comparing models and reading your transcript.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Definitely appreciate the video. Something I took from your video: there is better options then a glowforge. Thank you for that.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Subscription software. FOR A LASER CUTTER.\n\nJesus fucking Christ. That's an automatic L for me.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thats a neat little organization system. Gonna have to check out your files.",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "I always forget about makercase. Thanks for reminding me. I need to do this in my workbench for sand paper.",
    "likes": 0,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Thanks for the comprehensive review!  I am just looking into the entry level machines for the first time and this was very informative.  I look forward to watching you make and break more stuff in the near future.  By the way, Go Timbers!!  (I am a Portland local)",
    "likes": 5,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Who the fuck uses support? Only people that are too damn lazy to read use support (The reason why is support is full of people that know less than you and are looking at the same documentation that you have access to to fix your problem) \n\nWorked in multiple Help Desk jobs (including apple)\nIt's all about quantity, not quality so they will hire nearly anyone\nThe standard is about 3 weeks of training (from knowing nothing)\nThe only useful thing about calling support is for a repair which you can do online anyway\nmoral of this story is that you are better off reading the documentation as that is exactly what your help desk guy/girl is doing anyway (most of the time directly from the website) you will save so much time",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Super helpful. I do have the middle of the road Glowforge. Super glad I got it. Very happy with it. But I’m looking to get a second laser. And Omtech was what I almost got the first go round. Where I work they are also wanting to incorporate some laser work and maybe the Polar would be a good option. Either that… or my Glowforge will go there and I’ll get a larger laser for home. LOL. Either way… thanks for the review.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Do the lasers have a lifespan? If so, how do they compare?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I would love a CO2 desktop laser primarily for cutting acrylics (though I’d love to do some wood projects as well). The price point of the Polar is appealing but I am also looking at the Full Spectrun Muse 3D—could you compare the too? What makes the Muse 3D worth so much more? Is it really an overall better investment?",
    "likes": 8,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Okay so OMTECH polar or G-machine overall? I know polar is brand new so that worries me but I do like US based.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "So basically it's a copy of Gweike Cloud? 😂 Or is it the same company? 🙈",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "if you do many passes would you br able to actually sculpt steel, for example a big block of steel, and i wanna make some 3d image, could i go making lots of passes and actually producing a 3d volume?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Someone is sending out \"You have won XXX\" messages through your channel using your logo and a telegram account. I suggest you look into it.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I'm looking at the Gweike Cloud Pro vs the OMTech 70W CO2 16x30 with autofocus..... both seem to be about the same price although the OMTech is much bigger. Other than the size, is there any reason not to get the OMTech?? Also the Gweike Cloud Pro says it does 3D... do you think the OMTech does also??? Hey, great vids!!! Thanks much....",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I keep thinking I want a laser but then I realize that I would use it like twice a year. They are super cool and I want one but just can't justify it. Better to know someone who has one than buy my own.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I remember how I bought the cheapest CNC2418 from Alibaba... came with a drill and a laser... I basically drilled and lasered everything... my neighbours happened to be on a holiday... else I would have drilled and lasered them too. Where is the laser tattoo robot booth? Since the 90ties people love piercings and brandings and tattoos... Let's have a Kickstarter for that.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Do you plan to review Gweike Cloud with RF metal tube? I'm considering spending a little extra on top of the CO2 pro version, but am not sure if it's worth the upgrade and what would be the real benefits compared to the CO2 version.",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Random question. Where did you get the lighting for your setup in the garage? I love the ambiance!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I’d love to see the revenue and cost projections for some of these. Even crude estimates would be valuable, as the cost of engraving is only one part of this. Add in the cost of customer acquisition, shipping, returns, etc…all of this must be considered to determine if this is a hobby or a profit-generating business.",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Glowforge likely spends $4,000 to acquire customer that's why they are still losing money despite 100mm in sales annually. If you have a good product that everyone wants why would you spend so much on advertising?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I got an AF-2028, 60W (the red one) and I am waiting for my ventilation supplies so I can set it up. What differences can I expect between the AF-2028 I got and the MF-2028 unit you're showing here?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hi, what laser setup would be best for table top coaster making ? Using tile, wood, cork cloth and so on. I just want to focus on coaster making only. Thanks.\nAnd you videos are great.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hello. I just got the Atomstack M50.  I want to use it on my big cnc router.  I can not find any info on the inputs.  What do I use to turn it on and off? and so forth. Is it 3V, 5V, or 12V input?  What pins?  Thanks.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I still love my Glowforge after 2 1/2 years. I don't use their monthly plan because I upload all my own files. I've tried several diode lazers, which were great for quick Engraving, and another co2 Lazer which I didn't care for at all and gave away. I think it would be great to try the omtech version but for now I'm not looking to buy another.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Glowforge is garbage in a gold wrapper, omtech is garbage in a silver wrapper..\n\nJust buy the chinese  blue/white or red/blacks.\n\nAll of these machines are rip offs of them..",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hi powered... 40 watts.....   we made it to the big leagues, have fun cutting 1/4 inch of anything except baltic birch.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I have a glowforge and seriously need this stuff my craft room is a complete nightmare!! Can you please send me the cut files for these in svg format>>??? PLEASE!! for 1/8th inch plywood.",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "My Glowforge is CRAP!  It was still in warranty at the time when the glue that bonded the glass lid to the hinge failed. It was a huge surprise when the glass lid popped right off.  I contacted Glowforge customer service and confirmed the warranty and they wanted me to pay $200 + shipping fee to ship it back to have the glass/hinge repaired. From that point on... I've been disappointed with the company and discouraged to use my Glowforge. I honestly thought they're going to send me a pre-paid postage sticker to send it back for repairs & being that is under warranty, i thought the repairs would be free.  It is now an expensive paperweight and taking up space in my house.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Cloud-based only...? subscription....?? Yeah, that'd be a big fat NO from me GlowForge.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Omtech and all these videos seem to ignore some things. Like they are dirty secrets. Omtechs PR stuff says engrave wood acrylic rubber leather but glass is not mentioned and considering that the depth is 30-70mm (1.18 to 2.9 inches) glasses/mugs/beer steins don't seem possible. 2 emails to OMT and no reply and no reply from their FB page. Also nothing on replacing the tube. Can we do it or does it need a tech or sent in ? And the power supply is it replacable off the shelf or a special built one ? End user replaceable or service call/tech/sent in",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hi, what do you think is the best laxer for simple stainless steel signs for a manufacturing plant?  Looking to make stainless steel signs that are easy to read and can stand up to harsh sanitation process.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "cloud based software when there is no practical reason is a deal breaker for me.  manufacturers, take note, consumers will not trust that your servers will outlast their expensive machine",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hey ! Its been one year since I took your advice on pulling the trigger on the Atomstack x7 Pro. It was worth every penny! Now that I have an idea of my market I would like your advice on the best way forward! My clients are mostly Yeti (done hundreds) and glass etching but I find the diode is a little slow. (5-10 min per cup) .. Thoughts? Even had a large company reach out to engrave brass medals but unfortunately not powerful enough. Any help is appreciated!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "glowforge forged ahead in price and lost me lol glowforge pricing itself out of the market and having a monthly fee. no way",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I got a glowforge basic back when they were $2k.  I love it, and use it semi-regularly as a hobbyist.  I will say that since seeing them introduce the subscription service and push it so hard, I've had the constant sneaking worry that one day they'll try and lock all function of my glowforge behind a paywall, but so far they haven't done that.  I only ever upload designs so I have no need for the subscription.  If they ever do decide to brick it for a subscription (or go under and their webclient ceases to be), I'll look at other companies, but I can't afford to upgrade as long as I've got a working laser already.\n\nDespite my overall very positive experience with glowforge, I don't think I'd recommend them to someone now, when you can get a more powerful laser that can run in house software for less money.  When it was 2k, it was also one of the only really user friendly lasers on the market, and one of the cheapest lasers.  At twice the price, and still locked into glowforge's online software, I just don't see why anyone would pick it over a competitor.",
    "likes": 43,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "phone support? At omtech? Idk if that’s true. I spent 3 months trying to get customer service and never had phone support. It was all email. That said, I do like my k40 machine.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Have you checked out the XTool M1? It seems like it sort of bridges the gap between typical diode and CO2 laser desktop units. You know more about lasers than most people (I suspect) so I'd be interested to hear your thoughts about it.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hey, I was just on your website trying to find the laser test file download. I eventually found it (great tool, thank you so much) but it took a bit of surfing around until I found it in one your review pages.  I understand why you would have it embedded in a review, logically it makes sense in that spot and it also drives more clicks around your site, but could you add a link under one of the resources? Or add a new resource for utilities that has the test file and other useful utils? That would be awesome.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "A Glowforge IS 4000.00. Are you telling me this is free?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Just a heads up, QGIS is pronounced Q-Jiss. In my work I do a lot of geospatial mapping for vehicle automation and we use QGIS all the time. It's a great tool for map data.",
    "likes": 4,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "So, are you saying that the Polar speed is the same as Glowforge?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "can you make everything you talked about with the desktop version (50w I believe) OMETECH laser machine?",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Just discovered your channel. Mark me as a new subscriber.  Some great content here.  Also couldn't help noticing your shirt... You must be from my neck of the \"woods.\"  Cheers!",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I feel the only thing missing is the ability to incorporate a rotary.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Dear Brandon I want to invest in a good machine for thing good details engraving on wood, please let me know what's a good investment",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I have owned an Omtech 100W 24x36 for more than a year.  The only thing I disagree with in your video is the \"Omtech has great technical support.\"  In my actual experience, every issue is responded to (in emails - no return calls) is to clean everything and refocus the machine.  In fact, they didn't even read my email, which asked about being able to buy the on/off pushbutton switch that is sticking, and their response was to ignore me.  I asked to pay for a service call.  At this point I have actually convinced two people to buy a competitors model and I am working on my third person.  I purchased the laser and requested support from the Anaheim California location, but I have not seen anything to let me know that the entire company is not represented by the same lousy service.  I would be fine with their lack of help, but even when I asked if there was anyone who could help, I was met with silence.  I was finally able to find someone who does service for Laser in LA, and I was happy to pay for the help.  I am very disgusted with Omtech's complete lack of service.  If you are going to buy a laser, try to find someone who has and uses one.  Service / Customer Service / repair is very hard to find.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "The Polar product page says it does have autofocus. You say it doesn't at 7:00. Can you clarify?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Question: I have the Xtool M1 Pro and deal with a lot of burning on the cuts. Are the CO2 laser better at resolving the burning issue?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hi, which budget machine would you recommend for a small jewellery business for personalising words onto small 5/8” sterling silver and gold round discs and oval curved vials?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Love your reviews! I currently have an xtool 10w. Been thinking about jumping up to a glow forge or the laser box rotary. I’m actually looking for something with a little more features in the basic program (I’m not ready to learn any  of the fancier programs). I’m wondering which product has the better project library?  Which one would you recommend? I know glowforge has a cost associated with it.",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "@Make or Break Shop What would be your recomandation for begginer, Neje A40640 or Aufero Laser 2?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "If you mainly want to do engraving.  What machine would you recommend?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I am very new to lasers, and am planning to buy one soon. The polar seems like a great option but how would it handle a rotary for example?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "If I have questions I don't want to put on here how can I reach you?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Due to wanting to produce some larger pieces, I'm looking at the Muse Titan (48x24 inches).  Do you have any experience with Muse?",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Sir,\nI am interested in the Xtool D1 Pro Laser for cutting out leatherwork patterns. Have you done any reviews of this? What are your recommendations, as I am new to this? Thank you!",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "You said you use the tracing feature of the laser itself. What does that mean? Just laying out the work piece to cut out with the outline of the work?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Is it possible to use a desktop laser on a 4x8 sheet of plywood if you remove the bottom?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I received my Polar 350 today.  I also own a zf3551, a FSL PS20, and a custom-built 5w UV.  \n\nI bought it thinking I could use it as a semi-portable.  \n\nHere's my thoughts:\n\n1) Not really meant to be portable.  \n2) Very fast from uncrating to lasering.\n3) In Lightburn, unless I'm missing something, the focus (z-offset) has to be set for every layer.\n4) Camera calibration was easy - except a bit inaccurate (so I guess not as easy as it seemed).  It would not even detect the dot pattern unless I opened the lid part way.  It seemed like Lightburn doesn't like the 180 pano camera lens, but this is my first machine with a camera.   I'll fiddle more tomorrow.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  }
]