[
  {
    "text": "You kept calling the exhaust fan \"air assist\" and I'm confused.  Does the large white fan somehow also provide air assist? \n\nSecondly, on the \"supplemental\" air assist, you've connected a fairly low output aquarium pump. Does the built in air assist provide less \"assist\" than the pump you showed??\n\nThanks!",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I never post any reviews. I just want people to be aware of how hard it is to get a hold of someone in the company. I have an issue with my laser firing. They told me that usually its the hinge on the machine that collects debris causing the laser not to fire. This worked for maybe 2-3 cuts. I am back to the same problem. Now, the machine no longer fires. The machine homes and \"enables laser\" but not light when framing the project. When I disable fan and hit start, the machine acts like it is firing. I am following the instructions word for word. I have checked the settings. I have reinstalled the software. Looked the FAQ. I have emailed, called and left messages, and did the online chat.  The team seems really nice. I would just like someone to get in touch with me to trouble shoot. I am willing to send my machine back and have them fix it.   I can't recommend this product because the customer service is subpar. I just wanted to make a gift for my two year old. I am happy to update this if I ever get a hold of them.",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Thank you! That stupid drop-down menu to select USB and \"actually\" connect the machine was what I was missing. Appreciate you man!",
    "likes": 5,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Thank you for sharing your knowledge. I knew a lot of them but the vector section and A1 were really helpful. 😊",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "@ excuse me!\nwhen i close the lid the display shows the lock is still open, press start the machine still runs but no laser beam is generated. can you tell me how to fix the error when i close the lid the display shows locked?\nThank so much!",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "You got a big FU Penn and Teller trophy from me. I thought you had to mirror. Glad you clarified in the comments.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "What's a dsp controller? Is it not compatible with gcode made from lightburn?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "All you talked about is features. Now talk about the quality of customer service, and customer satisfaction, for the various brands. Please. Seriously.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "love the video, as someone whos never even looked at these ive learned so much already!",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The truth is it’s usually best to buy a Chinese laser they are just has good we have had Chinese lasers in full industrial production for nearly a decade with no problems.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Great video especially for someone like me who is a beginner. Thanks for putting together the comparison grid -- very helpful!",
    "likes": 4,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I have the Glowforge plus and have had it since 2020. I refurbished it myself and it’s working great! However, I know that the life will not last for too much longer and would like to upgrade. I am still hesitant on jumping into the Onelaser Just because it’s barely been out and there aren’t very many videos and I just am a little worried about putting down a bunch of money for something that’s not known very well, but on the other hand, I hate to miss out on the discount. Needing some advice!",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "I’ve had my eye on the Aeon Mira 5S Redline, and I have a few questions regarding my product line that I plan to work with. I want to make sure the machine fits my specific needs, so I’m hoping you can provide some insights.\r\n\r\n1. Can the engraving and cutting height be automatically adjusted to uneven surfaces (e.g., wavy materials)? Ideally, I’d like a 3D mapping system where I can freely define the measurement points based on the material. I’d like to set the number of measurement points per square cm or at least define a measurement area to ensure the engraving or 3D map is as accurate as possible.\r\n\r\n2. Is there an automated height detection system or any add-ons for soft materials like leaves or flowers, which are difficult to measure with mechanical height detection?\r\n\r\n3. What is the noise level of the machine and the exhaust system? I plan to use it in my home, so that’s important for me.\r\n\r\n4. When working with larger materials that are fed through the machine, is it possible for the engraving or cutting to be automatically detected and seamlessly extended? I’m looking for intelligent software that can adjust the engraving path automatically without needing to manually realign the material.\r\n\r\n5. Do you use or recommend any infeed track with a stopper and optional conveyor belt for precise material alignment and consistent movement at the right angle during the process?\r\n\r\n6. Is there an intelligent function for engraving multiple identical materials? I would like the machine to detect and optimize the engraving process across multiple pieces with identical designs, to save time and ensure consistent results.\n\nI know that the xTool P2S has most of the features I need, and their software is actually quite good. However, it seems that they may have purchased reviews on Trustpilot, and their customer support has been quite disappointing, so I don’t fully trust this company.\n\nI’m also interested in experimenting with inlays in small QR codes, around 30x30mm, where the glass tube CO2 laser might reach its limits. It could be better to go for an RF option, but I’m not sure if Aeon is the right choice for this. You may have a better idea of what would suit my needs best, considering you’ve tested a larger product range and are up to date with the latest technologies.\n\nI’m based in Germany, so it would be good if there aren’t any issues with shipping or customer support, but that’s mostly optional.\n\nBest regards",
    "likes": 0,
    "video": "This is the World's Fastest Laser"
  },
  {
    "text": "Hey mate, have you had a look at the speedy 100 from Trotec? I'd love to have a comparison with the Nova 24.",
    "likes": 0,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "Hey I have never did this before but I want to get started to create things I have a huge network and feel I can start a business and have a lot of customer success what machine should I buy. High end or mid tier?? Please help thanks.. also one thing it must do is put logo design on footballs 🏈",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Oh man the idea of printing on wood before laser cutting it out instead of hand-coloring everything with acrylic paint is really really intriguing…\nIt’s just… an INKjet!? I swore myself I would never use this again 15 years ago already… \nAnd does it REALLY look good?\nI mean, I don’t want photos, but still…?",
    "likes": 0,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "The powder n oven are toxic...PPE and ventilation please!!!",
    "likes": 1,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "Xtool XCS software is garbage...so many bugs and it has a memory leak that slows the software down.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Can this engrave a 1-inch diameter cylinder of wood  that is up to 30 inches long?",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "I'm starting to watch his videos and been looking then. But with this one I have noticed how often he's adding the \"questioning\" tone after words, phrases or sentences and I couldn't finish it.",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "it has been a few months, and we have a new player (One Laser)....\"desktop CO2\" for a school/library makerspace ... XTool P2, Thunder Bolt, OneLaser XRF  (starting from scratch or replacing Glowforge)... the integrated (& simpler) software (XCS vs Lightburn) has me leaning P2.... but i also like the XRF not needing chilling",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "LaserMATIC Mk2 is $900 in the US v $1100 international. $300 more.. That's disgusting.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "2:52 I disagree, my 20w laser does everything at a decent speed, 1 pass enough to build a business from and sell 100's of items. It's extremely rare that thick material needs to be cut.",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Indiana jones looks like it isn't centered or aligned to the black card.",
    "likes": 1,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "What are the easiest to repair?  My stepper motors is warn out, the manufacturer won’t sell me a replacement and I’m look in at a mirror laser now?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Was looking into a powerful laser system for etching Yeti bottles, engravings, coins (with heavy relief), cutting metal etc for SIGNS and making metal signs etched…\r\nAny recommendations on gear??  We are looking around a 10-20k price budget.  And looking for all the accessories that I would need for doing all that…   i was looking at fiber lasers from these companies around 80-100watt...   any thoughts on them??    CLOUDRAY, OMTECH LASER, AEON LASERS, EPILOG LASERS, and MONPORT Lasers.",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "What kind of strength of laser to ceramic tiles and stones",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I have the F1 and had some horrible customer service experience. I love have several other lasers, but would never buy xtool again.",
    "likes": 2,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Being a novice, I think it falls short of the X-tool for the time being. It is drawing the smoke and debris from cutting/engraving through the internals which means extra cleaning effort. Needs extra air for the air assist. Doesn't have its own software, so need to buy extra. It would be a lot better if they offered all the accessories now even if not ready so that the consumer could buy as a bundle rather than get nickel & dime for them later. If I already had a laser plus air pumps and purifiers, it would be a great upgrade machine.",
    "likes": 2,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Dude how many time you made similar videos with same products 🙂",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I'm still leaning towards the P2S as a first laser, built in air assist pump, exhaust fan, camera view, software. Plus X-tool has the accessories already to go and bundled. I see the one laser is starting to bundle, I would like to see more about fume extraction and the  conveyor.",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I am interested in the preset setting for various materials.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "I have finally have set up my Hurricane with Lightburn. During the setup process in Camera Alignment Wizard In the Fill Speed, and Line Speed it wouldn't allow 6000 to be entered. Any idea on what I did wrong?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "from running a shop for around 8 yrs now I can tell with 100% confidence that any machine or tool that does multiple things is a waste of time and energy",
    "likes": 3,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Given the content this is a very short and compact video. There are creators out there that would take 45 mins to explain the same.\nYou sir are on point and I salute you.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Can you help assist me with meerk40t using Lightburn I have a Basic Monport Reno",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "just got an xtool p2s, setting it up now and have to put distilled water and antifreeze in thee tube. BUT does it really need antifreeze when it's in a room that wont go below 10°C ?",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Anyone have thoughts on the Elegoo Phecda for a beginner engraver?",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "What should my power and speed be in my xtools1 be for silicone brackets can anyone help me",
    "likes": 0,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "This video seems very wordy. You seem to go on tangents. Way too much? Can you make another video and just show the quick steps to do it",
    "likes": 3,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "Definitely enjoy this long form tutorial video  Thanks",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Great review thanks! Re. the colours, I'd say its more a tempering effect than oxidation on steel.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "From what I've gathered, the fully enclosed hobby level diode machines with a camera, air assist and at least 20W of power cost in the 1200-1500 range. This is comparable to lower end CO2 machines. So why not just get the CO2? Well, for one, the cut quality seems to be cleaner with a diode laser, as they usually have smaller kerf and are consistent across the entire work area. The versatility of light cutting up to 15mm and more detailed engraving in a single machine is probably a better option for hobbyists than a small CO2 laser. Or am I wrong and there are CO2 lasers that outperform the engraving quality of diodes?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I have my P2 a couple of weeks now, and I'm pretty shocked at the quality.\n\nSome stuff was to be expected, like laser misalignment, but serious gantry misaligment and multiple camera issues. I've now spent 90% of my time trying to calibrate the machine, but the more time I spend, the more issues I find. Also, the calibration software they provide is just atrocious.\n\nI would absolutely not buy this machine again. It's clear to me they should not have been shipping this machine yet, there are way too many design issues with it.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "FOR THE PRICE NOT BAD FOR THE 13 0R 9 BUT SHIPPING TIME AND THE SHIP COSTS ADDS UP...UP TO 50 WORKING DAYS TO DELIVER?",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Biggest downside of cheap laser cutter/engraver for me is inability to cut clear acrylic. I have 10W super cheap Atomstack and it can cut very thick wood and engrave leather, wood, whatever not transparent. But time to time I would love to cut something transparent since that is something I can't print on 3D printer.",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "I have the Creality 22W Pro Bundle. My advice to anyone looking at this laser, save up for something better. You find out really quick how limited the machine is and how poorly built it is (wobbly legs, wobbly laser module, cords barely plug in, airflow is horrid making it shut down every 20-30min). After about 2 months I put it under a shelf in my building and haven't touched it since. Creality is an FDM printer company just trying to stay relevant so their support on their lasers are non-existent. Maybe I got a dud, but my friend bought one as well and had a similar experience. I know it's a cheap entry level laser, but I have a hard time supporting a $500+ paperweight.",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "I feel let down. What you showed at the end was uninspiring.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "What's the best enclosed laser for wood. acrylic nightlights. And metal please. 🎉❤I really love ur videos",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "You desire more than just one like, thank you for your work",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Hello your videos rock and help. ? Have you experienced Lightburn not opening on windows 11. I been using Lightburn for 3 months and yesterday I couldn’t open the program, it gave me an error message saying “Lightburn.exe not responding “ can someone help please thanks",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "That guy is NOT the CEO of Thunder Laser---who's literally a middle aged Chinese man. He's just the CEO of a company that resells Thunder machines in the US.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Doing a poor job at material calibration doesn’t make a cheap laser better than a nice one.  \n\nThis is a huge failure in the host, and not the equipment. Learn to use a laser before misleading all these people",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "your rate of speech and demonstrations are to fast. Slow down, use pauses.",
    "likes": 9,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "This is not even close to being a fair representation of what each of those lasers can achieve. You can get much, *much* better results from the Creality (and other cheap diode lasers). Either your speed was too low or you power was too high. \n\nYou are *_not_* \"definitely going to get a darker mark with the diode\", it'll always depend on the power and speed. You can dial them up / down enough that it will barely mark the surface at all. Always start by printing a test grid.",
    "likes": 2,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Should’ve mentioned the unusable area on the rotary turner when engraving tumblers and how you need chick extenders not offer by WeCreat.",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "8:51 that 3rd one made by omtech Pro is just .... 😅   So, you are telling me, omtech pro is minimum 300% higer cost than other two options, with 40% lower efficiency and produce the worst result in this comparison, wow, im shocked, but thank you!",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Would love to see you do a video on the Longer nano pro, 12w galvo diode, 100x100",
    "likes": 1,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "I don't understand why the Monport 55W C02 Desktop laser isn't a part of this list, with it being less expensive than all of these and more powerful than all of these.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Hi, thank you for your informative video! I have a question, which laser would you recommend that will cut 18 gauge (1.02mm) copper metal sheets? The laser would be purchased for a small jewelry metalworking business.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "one thing to note is the F1 Ultra for smaller jobs and dual lasers Diode & Fiber and around 10,000 mm/s speeds around $4000",
    "likes": 2,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "This was an excellent tutorial!  Short and to the point! Love It. New Subbie!",
    "likes": 3,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Wow! I really love the concept of the One Laser! The design looks sleek and the features is impressive at first glance. However, I heared some concerns about its consistency and misalignment issues.",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Awesome - thank you for this!\nI had an XTool setup, never got to use it. I had emergency open heart surgery (no idea I had issues), followed closely by hurricane Helene with destroyed most of my workshop. Insurance only covered a small portion of loss. Talk about a small business hit. 😳",
    "likes": 5,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What is the best way to Record videos of the laser engraving process? I want to make sure I do not harm any camera that I am using. Also wasn't sure how you can do this with a enclosed machine.",
    "likes": 0,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "What is the best way to record videos of the laser engraving process? Is there anything I need to know? I wanted to make sure I won't harm any camera that I'm using. Also wasn't sure how you can record a video in a enclosed machine.",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "I can see the potential in their X Series, but I feel the price point to be more justifiable for the features offered. I also noticed some ventilation problems, which are a bit concerning, and the alignment was off.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Is there anywhere else that I can purchase a replacement 45 watt laser tube for my FSL Muse 3D laser?",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Hello, I want to cut carbon fiber 1mm thickness with epoxy, I mean a classic carbon fiber coating. Which machine can do this do you think?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Could someone recommend a laser to me.\nI’m looking for a laser engraver to start a new business. I looking to be engraving live edge furniture my son makes. I would like go as deep as possible when needed, 1/4 inch max. Boards are long so through way is needed. Most boards are 20 inch to 30 inch wide but would also like to do possibly go as wide as 40 inch. I also would like to make the normal tumblers and glass engraving.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Could someone recommend a laser to me.\nI’m looking for a laser engraver to start a new business. I looking to be engraving live edge furniture my son makes. I would like go as deep as possible when needed, 1/4 inch max. Boards are long so through way is needed. Most boards are 20 inch to 30 inch wide but would also like to do possibly go as wide as 40 inch. I also would like to make the normal tumblers and glass engraving.\nThanks",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "You will love the results but you will hate the maintenance!",
    "likes": 0,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "You might need to do a Hot Peal. Depends on fabric and on the DTF itself\nAlso a teflon sheet on top between the sheet and the hot element on the press is a MUST",
    "likes": 2,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "You sure can send it my way lol works love a DTF printer",
    "likes": 1,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "I am just starting to venture into creating custom maps and this was a very easy to follow process for me as a beginner.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Does anyone have any recommendations for a laser that I should buy. I’m a college architecture student and I make tons of architectural models out of 1/8” , 1/16” basswood. I would love something with low maintenance but also something that I wouldn’t drop a bag on 😅",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Thanks for vid.   I found that Lightburn software to be very similar to scientific graphics software from 20-25 years ago that drove an inkpen plotter.  But it's better, for sure.  I've only had the machine for a week, so my issues will probably resolve with some practice. The most difficult part for me has been to accurately align the honeycomb to the frame and  spoilboard(s), and then aligning the objects to be engraved/cut.  But this is somewhat due to using an Xtool D1 Pro, I think.",
    "likes": 1,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Much respect for the update. Great to see OneLaser is taking active steps to upgrade before they release. I'm an American expat who is retired in Korea and I contacted OneLaser to see if I can get one shipped here (more hurdles to jump through). They have been great in regards to communication.",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Just re-watched this and the other OneLaser video you have. Looking forward to a full review when you get it.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Yes and even more for us noobs. Thank you for the amazing videos.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Is it possible to get an upgraded xtool diode module without buying the whole machine again",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hello, just bought test for S1 on your shopify and there are errors in the fast engrave, in the image test and in the logo test. \nIn the image, all fast engrave speed values are set to 400mm/s instead of mixed, from 400 to 550mm/s.\nIn the image test and logo test, all 500mm/s values are really set to 400mm/s. \nWhere am I wrong? @makeorbreakshop",
    "likes": 0,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "You’re an awesome guy with great passion for your trade and with communicating with people",
    "likes": 3,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "All I want to cut are detailed stencils from cardstock for spray painting. Machines like the Cricut just can’t handle fine detail. Any suggestions please?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "When cutting thick foam in multiple passes, is it possible to have the cutter focus to different depths for each pass?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Woah - buttons that change to lasercam, Lightburn, and a face cam, that’s next level! You’re like the first real laser engraving streamer. I honestly have no clue how you pulled this off, kudos!",
    "likes": 0,
    "video": "Cranking Out Holiday Gifts? Avoid These Laser Cutt"
  },
  {
    "text": "Do you have that star wars file so we can try it out?",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Aufero AL2 Laser - 399 dollars... Tries to order one...  \"Sold Out\"   🤔",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I’m a total rookie but I’m a few months away from purchasing the xtool F1 Ultra. My question is what’s the point of an inlay vs just burning the image?Does it stick about the surface giving it a 3d texture?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Thanks so much for your content. I am a high school science teacher. About two and a half years ago I inherited the school \"design lab\" classroom which contained a glowforge pro.  Since then, I acquired another glowforge (free donation from a parent).  I have spent a great deal of time learning how to operate the machines, run inkscape, adobe illustrator etc.  My students are I are getting pretty good at making the kind of things people would actually buy.  The machines run 2-3 hours a day just about everyday. As problems arise I do my best to troubleshoot and put out fires but this is getting harder and harder.  I've convinced my admin that I am going to need to replace one of both of these machines soon. I am DEFINITELY NOT going with Glowforge again.  Knowing what you know, what would you recommend for a school setting (high school)?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Which would be the best lazer cutter to create parts for traditional RC planes in thin ply and balsa?",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I want purchase one. But i think ill wait until the tech gets better and the bigger unit get cheaper. I need a big working area.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "im just starting this days and feel something weird, i love the machine can do like this proyects but i cant be sure about to find the propper way to sell it",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "love this technic, in the case of the tiger the contrast its a bit lower becouse its made by thinner layers than the star wars project in my humble opinion",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "hi Sr, i have noticed som diode lasers not necesarely too powerfuul could cut an aluminum tape, of course this is not happend to you, this is for the thikness of the tape or is just a facr that a diode laser cant cut any thikcness of aluminum, thanks a lot for making this videos!",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "DEFINITELY want to add that this works with the RA2 Rotary. also, a lot of people run the blue laser for the initial pass on a tumbler, then run the IR as a clean up  pass to result in much shinier and brighter finish.",
    "likes": 3,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "... I dont understand how tf you choose this... 1.5w?! One of the highest quality kasers, de Longer ray's a5 with 5w is cheaper than that, plus its better in most ways(if not all)",
    "likes": 0,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "We have Xtool D1 Pro 20W with expansion kit and enclosure.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I need to cut 3/32 soft grain balsa wood for under $300 and when I look online people say I need like 40w what wattage do you think I need and do you have any ideas. thanks.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Good job Brandon. It's nice to see the OneLaser XRF in \"person\" and in use. Too bad about no USB port for file upload. I'm 69 years old and bought an Omtech Polar when they first came out (expecting to have fun in my retirement years), but it was too unrefined. I unboxed it, bought a couple \"improved\" nozzle assemblies, and the Ruika Controller from Cam Edmonds and then never even turned it on! Luckily I was able to sell it for about 80% of what I had in it. So, the OneLaser XRF will be my first laser. I'll be looking forward to your upcoming Thursday Live again. Thanks, Charlie in Central Ohio, but soon to be Central Florida !!",
    "likes": 1,
    "video": "Checking out the OneLaser XRF (Q&A Live)!"
  },
  {
    "text": "Watching from ship in the middle of the Pacific Ocean 😂",
    "likes": 1,
    "video": "Checking out the OneLaser XRF (Q&A Live)!"
  },
  {
    "text": "I know you can use light burn but can you use Inkscape too",
    "likes": 0,
    "video": "Checking out the OneLaser XRF (Q&A Live)!"
  },
  {
    "text": "I know you can use light burn but can you use Inkscape on one laser",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Do these lasers have the Z axis? I’m just kind of curious because I’ve been admiring some of the 3-D imprints done with stone, etc. just wanna know if these are capable of doing that sort of stuff or if you have to do some sort of special process to be able to get the kind of 3-D Indented designs and stone and I think there’s something with depth mapping?",
    "likes": 0,
    "video": "Checking out the OneLaser XRF (Q&A Live)!"
  },
  {
    "text": "Thanks, bud. I have a question: which air compressor do you recommend for the OneLaser? Please provide options for good quality, budget-friendly, and pricey models.",
    "likes": 0,
    "video": "Checking out the OneLaser XRF (Q&A Live)!"
  },
  {
    "text": "The sheer mass on that laser head is far to great for a modern unit at that price range. If it can shake a whole desk, it needs some refinement.",
    "likes": 0,
    "video": "Checking out the OneLaser XRF (Q&A Live)!"
  },
  {
    "text": "Can a 40W diode machine cut 1\" thick polypropylene?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "dont you hate when some one does answer your comments",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Do you have a tutorial on how to do that inlay with the metal powder? If not I’d love to see one!",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "So what open gantry diode machine and IR diode module would you recommend?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "that was a great video,my head is wrecked trying to use lightburn,i just cant get it to do anything burn or ingrave..",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Never skip grits, it will bite you during finishing!",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "Would it be better to seal the wood before engraving it then filling, sanding and finishing?",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Normally I have to speed up youtube videos, this is the first that I have played at .75  speed.",
    "likes": 3,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "REALLY COOOOLLLL THIS VID NEED TO BE VIRALLLL🔥🔥🔥",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "fml...with it being black friday, it seems like it would be a good time to pickup a laser...but now I feel like im more confused. Maybe next year...dont want to make a rushed decision.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I'm kinda dumb plz halp. I need something super easy to use straight out of the box. Just working with leather cutting / embossing. Any suggestions?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Nice. What about using bigger kerf and a ramp effect in order to achieve a more CNC-like inlay?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I’m trying to decide between a laser attic m2 and atomstack a48 fully loaded. It’s for a charity woodworking shop. Current Black Friday price on atomstack are attractive but reviews of Lasermatic appear to be better. Budget is around $1200. Any advice appreciated. John",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Thank you for the video, lots of great tips. I knew most of them, but there were some new ones and a couple that I hadn't thought to use the feature in that way.",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "This guy is obsesed with Star Wars series as i can see. I actualy didn't like those series.. at all.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "lucky you dont my have my laser. if you use it without air assist for engraving you have to clean the lens every few minutes.",
    "likes": 5,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "After owning the xtool S1 40W for a year, my conclusion is that it is GARBAGE. It is not beginner friendly at all. Their technical support is in China. Creative Space software suffers through each upgrade. Many complaints to the point that I am getting rid of it. No camera causes= huge material waste.",
    "likes": 1,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Thanks, exactly what I'm looking for, i think. Especially with air assist included.",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "I'm surprised there were no kerf adjustments shown.  How was that accounted for?  Unless inverting the image took care of it.  Step by step is the best video!",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I'm confused on the we creat.  How do they do a conveyor belt without a passthrough?",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Thanks for your input! I saw your list that you put out and I'm referencing it! I know this video is old, but would this ortur lm2 do well in 2024? I use a boss co2 laser at school where i teach, but this is for me personally. \n\nWould i need to get an air assist? Is that needed, or does the small fan in the laser do enough? 10w would be good enough to small cutting? I don't mind taking a few passes. \n\nAnd the boss laser has an air fan in there, would this just be ok next to an open window and an exhaust fan? I'm thinking about fumes or smoke. \n\nThanks for your great channel!",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I'm looking to get into the laser printing world and I would like to print on 5x7 or 6x8 metal or acrylic sheets. Which would you recommend? I was thinking of trying this F1 but I don't think my idea (product) will fit since it's a minimum of 5x7 inch. Thanks in advance",
    "likes": 0,
    "video": "The xTool F1 Is Actually Pretty Awesome!"
  },
  {
    "text": "Thanks for the video! What would you suggest if I wanted to print my own metal playing cards at scale?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "When will the Creative Space have Text to shape or line. This would be really nice and keep me from having to go back to lightburn and back to Creative Space. Love your products!",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Is it possible to use only distilled water for cooling? The machine is in a warm house +25 throughout the year.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "If you were getting your first laser , would you get the hurricane or p2s.😊",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "What's the cost of the unit, what's the cost of the co2 if you break it.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Another great video, thank you. I think this is going to be a great machine. I think Xtool appeals to more people because of the ease of use/software and their 3d mapping for curved surfaces. A little learning curve with Lightburn but being new to engraving, its not that bad IMO. Watch a few videos and you are good to go.\n\nI am curious about the noise of the base unit laser one. How loud is it in decibels? How loud when you add in the air assist? Also what type of maintenance is needed for the laser one (weekly, monthly? your recommendations). Also a quick run down for new people like me on what materials you can use with it would have been nice (but I can check the website for that). \n\nI'm looking at getting a laser this Jan or Feb. Considered Roly Lasermatic (larger version) and Xtool but this looks really nice. Will definitely put this on my list as a product to watch.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I want to add lettering to a silicone rubber surface - which type do you think would be best?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "May I ask what camera you used to film the engraving process from above and how did you make the camera smoothly drift and move while filming at 11:36?",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "After watching several of your videos, I decided to change from the Mira 9s to the Thunder 63 130w, thank you. I will no longer have to wait 4 to 6 months to receive my laser. What setting would I use to do the same as in this video with the Mova 63 130w? I will only pay 2,500 dollars more for the largest Thunder laser instead of the other company, great change and fewer days instead of months of waiting",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Love the thorough reviews and and information on all types of lasers.\nWill you be doing a review of the LaserPecker LP5?",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "I am wanting to set up a small business personal engraving cutting. Your video was great but could do with some advice. Power sounds great and size to but to start I am not sure. I have been considering the Xtool P2. Your explanation  of software was good. I want to use wood, slate plastic but possibly  metal to. I have a limited budget  of around £7000. Is there a machine or machines  you wouks suggest looking  at. Engraving wise the smaller lasers woukd give better detail. So a little confused but in a good way.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi Brandon: I’m new to all of this … lasers and YouTube videos:  i want to cut specular, (i.e. mirror-like vacuum-aluminized) Mylar ~7 mils thick — like a potato-chip bag. What laser would you recommend?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "For the x tool p2 series, you said that there is no water pump but you still need to put water in the machine. Is this reliable or are there problems that come with it? Also how often do you need to calibrate it?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I can't imagine spending 5k on a laser that runs on belts",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "I have a silly question... When u show the laser light in the video, if someone looks at it ( since they're watching the video) can that light also do something to their eye? Kinda like watching someone's YouTube video of a welder without mask.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Good videos bro , good information, thanks . Keep it up. What’s your take on the AtomStack hurricane, Onelaser  and the x tool (Co2’s) im looking to upgrade from my diode to an co2.",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "thanx for the video.. Got this last year.. just went right in..Running latest version on my mac.. One small issue.. Lazer consistency is off sometimes..  speed is at 1900 and power is at 80% ..   Does not always happen.. but just curious what in the world could be going on.. the depth of the engraving is just not consistent ...Air assist is off and over scanning at 2.5%.. could this be something in the \"Common settings\" Maybe the scan angle? the image is in 3 layers..but the setting are the same in all layers..   The layers starts good but then changes occur and you see deeper areas then the rest on that particular layer... Even when i join the entire file as one layer after i group it together..  I aways burn the same image, just change the text in it.. anyone here have any thoughts? thanx.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "You did miss (or skip) an entire category.... UV laser's.  From what I'm seeing, these are the \"IT\" laser of today, they can cut glass, engrave glass without masking, and not just the surface of glass, they also do not burn wood or plastic when engraving them, and they engrave thin metals without warping the metal.  But definitely not cheap.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Just ordered my WeCreat 20W today. Will mostly be using it for engraving. I want to make custom labels engraved on leather.  Looking forward to using my new machine!",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Thanks for the table option. I struggled to find a table, so thank you.I just purchased one",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "How effective is the X ultra  on a disk the size of a nickel that detailed? Thanks.",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "I have a Glowforge Plus and its definitely the definition of a company overcharging old people who just want a hobby.",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Every time I see this laser it looks like an upgraded xTool P2.",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "I really appreciate your Step 4 about Shape Properties and how to build the image test variants. This is one of the best, most detailed and relevant videos I've seen as I'm getting deeper into the software and capabilities that'll take my projects to another level. Thanks!",
    "likes": 6,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "volevo comprare un laser rf reci da 200w. è buono per incidere con una buona qualità? o serve solo per tagliare in quanto non ha una buona definizione?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "*Does Thunder Bolt & OneLaser Ships the Laser Machines to India??*\n*If anyone of them does then from where can I buy it??* \n*Please let me know if you know anything about Shipping & support in India* 👍🏻",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Thank you for the thorough update; I am awaiting the shipment of my order.",
    "likes": 3,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "I don't understand the pass through, it is manual, but how can you push or pull the wood through at the right distance for the next letter (in case of a long add)?",
    "likes": 3,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Appreciate the walk around video!  I enjoy the pace and detail.\n\nRegarding ventilation, does it exhaust internal room temperature air, or is there an ability to cycle through external air?",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Great update! Do you or does anyone know anything about the Gravograph LS100?  We have one in our office for a few years now but there is very little info that I can find online.",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "I wonder how long those POM wheel will last in a laser environment? It would have been better to see linear rails for durability and accuracy.",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "My biggest question is the cutting power of the RF laser. I have a glowforge that I bought a few years ago and I am frustrated by how often I can't cut through simple materials like 1/4 plywood. I would love a laser that could successfully cut 1/2 or even 3/4 plywood. I have a CNC too but the laser would make life a lot easier for templates and small projects.",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Glowforge lens pops out and has a magnet that keeps it in place. Super simple to clean.",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Do they have or will they soon have customer service here in the US?",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "question I am looking to buy my first laser/engraver 20 watt.  which is best , Roly Lasermatic MK2, Creality Falcon 2, longer B1, or is there a different one.  I need a working size of about 14\" X 14\" ( 400mm X 400mm).  with encloser, Camera, air assist, Honeycomb, Price around 1200.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Universal Laser have had magnetically attached lenses/mirrors for many years (certainly on their VLS series that I have). Not one of your cheaper lasers 'tho 😁",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Really liked this tutorial. Would love to see more.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "What other materials can I cut with this? Acrylic for example?",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Please keep this long form instructive video style going! Great work good sir!❤",
    "likes": 10,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "You would save a whole bunch of z hieght if your spondle was clamped mlre towards the bit as well as i would thibk mkre rigidity. Further something is out the more torque is multiplied seems logical to me anyways.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Why no Monport MP570 in this competition? Its's definitely the cheapest especially now on Black Friday sale... You can get 60W model for around 2000$ which is a steal! Oh forget the question bcuz Monport is definitely not a desktop laser 😂",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "That looks great! Love the long format tutorials also.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I just ordered one on the black Friday sale. Very excited to receive it. I will be upgrading from an ortur LU2-4-LF Long Focus. I know the F1 has a much smaller work size but I rarely find myself getting orders for large items so I decided to focus on small things beich are easier to store in my limited space.",
    "likes": 0,
    "video": "The xTool F1 Is Actually Pretty Awesome!"
  },
  {
    "text": "All lasers are great, but! bought 2 Xtool pro both failed within one year, bought 4 Creality 2/ 20 watt and 3 have failed within a month.\nhow about doing a video about service people get after sales. so far service is terrible to non existing with both companies.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I went from the D1 10w to the S1 40w and I can not tell the difference from the laser dot size. Sooooo you don’t need to purchase two laser heads unless you just want to spend the cash.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great video thank you! Could you share what glue you used? It seems to be very fast curing and I'm interested 😁",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I designed and built a 200 W version of this thing and it's pretty impressive. Mine will actually cut out metal patterns but it's not an inexpensive idea even if you can design it build one yourself.",
    "likes": 1,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Hello from 🇲🇨 indonesia .. \n\n\n hey bro .. this video Amazing 👍🏻🔥",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Seriously. It's alternate universe linus from linus tech tips xD",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "do they all have adjustable heights or are you pretty much stuck with one height or relatively one height? Some of them look pretty short which means there will be no engraving things like a tumbler.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Very interested in the X series, but not a lot of info on materials or thickness it can handle.  For the projects I need to run, will need information on the conveyor feeder and max capabilities it can provide.  Does anyone know where I can find this info?  its not currently on the OneLaser website.",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "One thing I find a little frustrating is that in all reviews no one seems to talk about or test material thicknesses. I  currently have access to a 150 watt co2 Universal laser at a lab but want to have a laser at home. I use the laser to fabricate wooden mechanisms using solid hardwoods; typically 1/4 in thick but have used 3/8 and 1/2 inch material (Maple,Oak,Cherry,Walnut). Can this XRF One Laser be used for this type of work? Are there other lenses available to help with the thicker materials? Thanks",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Im seeing forward to the acrylics video. altho i only own af 5W diolaser",
    "likes": 3,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "It seems there's no pass-through, right?\n\nThank you for the thorough summary!",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "How do I do this with family photos on my phone please 🥳🎉❤is it the same way. I might want to do it as a gift on a cutting board",
    "likes": 1,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "I came across the Monport Reno45 Desktop CO2.  Do you have any knowledge of it.  In your previous video with the list it isn't listed with your desktop CO2 machines.  Right now it is on sale for $1000.  I like the cutting size area (16x12) that is available.  Would this be a good buy? I had looked at the OmTech one that is smaller because I have a limited budget but the fact this is auto focus and larger cutting area seems better.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "When are you going to use the XRF to try that laser wood inlay technique? I’m waiting on that to know for sure if that’s the laser I want to order!!!",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "I like your T shirt! PTFC! Are you local or just a fan?",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Would you buy this one or the Bolt Pro 22 which is comparable cost?  and why?",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Curious if you're familiar with the Ryxon controller OmTech is using now in lieu of the coveted Ruida? Good, bad and ugly? Thx a bunch - enjoy your vids. Jeff",
    "likes": 1,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "Going to stroke a big check this month. Thanks for helping with my DD.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Just an advice show us what the machine does First so you grab our attention then later what inside the machine",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Hi, thank you for your video, I bought my Longer Ray5 20W in August, however I am yet to figure it out. I also purchased lightburn. Was I supposed to get some sort of hardware with it, as shown in the video?  I am a terribly slow learner, so I am having a difficult time.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "@29:05 The Atomstack M4 (original) is a 20W electrical input with a 5W laser diode output... The Atomstack M4 Pro is a dual 10W + 2W laser",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The Onelaser logo looks a lot like OnePlus.\n\nBTW the depth category should include depth using a riser if one is available.\nIt should also highlight Z axis type, because this affects some features like being able to do curved surface engraving.",
    "likes": 3,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I'd like to know what exactly is the connbection between xTool and WeCreat.",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Good timing! Navigating a potential purchase and yea... daunting task sorting this all out! What do you think?",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "D1 pro is great - just put an enclosure around it...cheap and effective.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "More please! Will certainly try out reverse inlay soon once I've sourced the veneers.... thanks for making these inspirational vids",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Looks very interesting, and the price is certainly attractive. I need to engrave on irregular curved surfaces tho, and xTool's XCS still seems to be the only way to do that readily. If Lightburn comes out with support for 3D surface mapping and motorized Z axis control, this machine could be a contender in that area, feature set looks pretty attractive otherwise.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I liked the long format. However I don’t know how you managed to get that intricate design to line up when glueing them together because you couldnt see what you were lining up,",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Thank you! I have a tough question for you... let's say there's this guy and he doesn't know squat about lasers... but he wants to start something without knowing exactly what to start making... and he can only have one machine... overall, which machine is more versatile with different functions and applications with different materials... the P2S... or the F1 Ultra? \nThanks!",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Probably a stupid question but I’m looking into getting a laser so have been binging your videos. You mentioned it has an air quality sensor, does it need a filter if used indoors? They don’t have any on their website unlike omtech or xtool",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "We want to engrave cutting boards. What desktop machine would you recommend?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Nice video! I'm wondering if this machine can cut cardboard 🤔 the knife seems pretty small and the Lazer might burn it xD",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Can i please have your honest perspective.  Which would you chose between the Roley, the S1, or the M1 Ultra?  I have never seen/heard of Roly until seeing this video.  Does Roly have their own software, or does it use Lightburn?",
    "likes": 1,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "the technique was stolen from Trotec. actually the whole project. He's a jerk that he didn't mention that",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "What air assist is that that you have hooked up to it?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Thank you for this! Great file and info on how to use it. Learned a lot and feeling more confident with my new S1.",
    "likes": 0,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "This video is exactly why I hate that YouTube got rid of the dislike counter. \nI would of been able to see that this guy doesn’t know what he’s talking about and wouldn’t of wasted my life \nLearning that this guy doesn’t know what a butcher block is. \n\nDamn you YouTube!",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "I have the S1, F1, and the Polar 350 by OMTEC. I am going to sell the Polar and purchase a CO2 laser from xTool. Would you recommend the P2 or the P2s?  Thanks.",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Which would you reccommend, the xTool M1 Ultra 20W or the WeCreate Vision 20W?  The WeCreat Vision has the built in Riser/autofocus and you can also interchange the 20W laser module for the 2W Infrared laser that can do more metal materials.  Why would someone chose this machine your are featuring?",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "How can you change the rf unit when the 20000 hr lifespan ends? No replacement unit at Gweike's site. Nor a 55w co2 tube",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Wish I had seen your videos sooner. Last year I bought the xtool S1, I hate it. Over all poor functionality.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Is it really worth paying that extra thousand for a 5% difference.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Did the lightburn inverse function not work? Did you get a different outcome using that function or did you not remember it?",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "How long will this laser last if you use it 8 hours a day?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "would you happen to know when they are going to be done with the final product and ship?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Shown at 9:31, the RF laser seemed to produce much more continuous and progressive gradation of marks on the wood than the CO2. Can you confirm this is usually the case?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I'm wondering now, does an RF laser create less smoke than an equivalent CO2 since the beam is thinner?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I really like this one but that Acmer P3 intrigues me. I await to see if you compare that particular laser to this one and the others like Xtool S1.",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Thanks - you always provide excellent reviews and you were a great help as I was assessing machines before I purchased. One important note is that Thunder Laser offers lifetime support and I have to agree, they have AWESOME, responsive support. I could not ask for better. Cheers and thanks again!",
    "likes": 4,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Price being equal. Which machine would you choose at the end of the day?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Definitely would like to see more videos like this, thanks!",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Flux Hexa is the best in the market if you need these dimensions. All these other machines are way too small. So what is best is relative to your demands.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "thank you for showing the fact that the laser vaporizes the negative artwork that is inlaid in ..couldnt find that info anywhere!",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "As a small business owner in the startup phase, I own several brands of laser machines. However, I have to admit that the xTool P2 is the one I use the most, and I am very satisfied with this machine.",
    "likes": 5,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Thanks Brandon, great review as always.  Looking forward to the actual performance of the OneLaser XRT, they advertise 3D Photerealistic accuracy and would like to some before pushing the button.  I was looking at CO2 lasers upgrading from a 10W diode to expand capabilities, big step. I like the fact that the RF, though more expensive, doesn't require the additional cooling requirement in comparing to the CO2 machines.  You mentioned the 3-2-1 warranty, does that mean should the fan on the RF tube or tube itself faults that there is a 3yr warranty on it?  Thanks again for all the great videos and reviews.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Finally, a laser I'd consider purchasing, and it isn't available outside US, lol.",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "A six inch duct and in-line duct fan will suck out all the fumes from an open laser.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "One Laser sounds like an awesome unit, whether you go desktop or floor model.  However, I do have a couple of questions... (1)  If I start out with the desktop model, would you suggest that I start out with the glass tube chiller model or the RF model?  Being a NEWBIE, I want to make the right decision.  (2) Then, the Hydra unit ... the 700 model does not come with a pass through option? Please advise. Thanks!",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Technique could be useful for model building and such.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Very nice. Good length giving a nice overview of what to expect.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "How thick can material be without the riser base? \n\nDoes the riser base allow rotary functions to enhrave tumblers etc?",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "One laser xrf or thunder bolt?\nWhich one you chose?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Didn't find this to be a review but more of a sales pitch. Things I can read on the site for the most part.",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Great reviews, and thanks for the details !  I’m totally on board with this ranking. \n\nI had a Polar before—it worked fine at first, but quickly turned into a disaster. The inside of the machine? Constantly filthy. You have to clean the lens every couple of hours to keep it from getting scorched, and the build quality is… let’s just say, not great. I’ve spent so much time on fixing shit, dat I could’ve paid for a whole new machine by now. And customer service? Practically nonexistent. They pass you around, and might call back two weeks later, right after you’ve DIY-fixed the issues.\n\nThe P2S was my top pick—not just for the minor upgrades, but mostly for the bed size (23.6” x 12”) and speed. And let’s be real—their ads are literally everywhere. You can’t escape them! This company must have piles of cash to burn; it’s insane how much they’re pouring into marketing. There are other niche brands like Bolt and Mira, but their bed sizes are too small for my needs, and the pricing is all over the place. Then I saw the ONELASER X, launching right after the P2S, and this new brand checked all my boxes: a bigger bed size (26” x 14”), excellent build quality, twice the speed, a clean cabinet design with an enclosed base, and full US-based support., Honestly, I was nervous about going with a new brand, but now I’m convinced I made the right choice.\n\nHopefully, OneLaser ships my order on time—because that’s the important part they can’t afford to mess up! I mean that seriously.",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I have a d1 pro 40w with extension rails and an Omtech Polar. I was to upgrade my diode to a second co2. My debate is btw the one and p2. The only reason I would lean at all to the p2 is the ability to see shape. For example, if im engraving spoon, it can auto focus to that. That would be my only reason.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "The HEXA as a une advantage then all these competitors, and that is the volume capacity beeing totally closed. That should value more then 1 point because that’s in real life what reall matters",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "15:50 ChatGPT says otherwise, it says that 38W RF metal doesn't cut as deeper as 55W glass tube, but I would like to see a practical comparison for sure,",
    "likes": 4,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I add a XtoolP2 and sold it after two months to buy the Hexa Flux.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Seems like a great system but I will wait until they add conveyor functionality",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "After watching the product video, I feel confident in this purchase. I really appreciated the clear, up-close views and detailed breakdown, especially around items to consider ordering to be prepared for the machine’s arrival. I'm glad you suggested getting the air assist, setting up proper ventilation, and preparing for fume management. Thanks for the excellent insights—I’m looking forward to working with this machine!\n\nOne of the most innovative features, and something I find especially valuable, is the built-in air quality indicator. This sensor is a game changer, allowing real-time air quality monitoring, which is particularly helpful in a closed room with only a window for ventilation. I had been considering purchasing a separate air quality sensor, so having this integrated feature is a fantastic benefit. Given that a lot of our work can produce strong odors, seeing an indicator for particle levels is very helpful for health and safety.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Great review, just waiting to see if they'll release in the UK.",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Beam combiner? That’s awesome adjusting laser would be much easier right!?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "The bolt has the same red dot system. This is not special.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "A couple of comments and a question. \n1. GF also has a removable lens. Makes it easy to clean. \n2. GF also has a status light, though I'm not sure if it's as function rich.\nQuestions:\nA) Why is it that the mirrors on GF never need calibration? I don't know if it's even possible. \nB) How does GF stay cool with never having to change any liquids? \n\nThanks for your videos. Very good!",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Great Video...as expected ! I just sold my Omtech Polar and I will be buying a newer desktop in the next few weeks. I have been seriously looking at the Thunder Bolt, but now the OneLaser XRF comes on the market. So, I am watching all the \"first impressions\" videos and reviews. Thanks, Charlie in Central Ohio, but soon to be Central Florida !!",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Great video! You really caught my attention with the air assist connection in the back, can you please explain how it would work with lightburn.\n\nDo you plan on running some engraving and cutting tests on wood and maybe acrylic?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Would have liked to hear more about the connectivity to the computer (if I didn't miss it). Is it USB only or is there a network connection option?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Excellent video thank you for sharing it!\n\nThe xTool p2 also has a removable lens but perhaps there is something different about the one laser, could you let us know what the difference is?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "should you add the $200 for lightburn in your comparison chart since XTool and GF have free control software?",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  }
]