[
  {
    "text": "How would this work if I’m engraving bolts with hex heads? Would the engraving come out worse because it’s engraving a round and not flat surface? What’s the learning curve for figuring out how to use this machine?",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "How long does the laser last? Will it need to be replaced?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "I bought this laser hoping to cut through 1/16” plexiglass. It didn’t do a great job. The shape was cut but it fused the back. Is there a setting/speed rate to improve the cut. This is on the D1 10W.",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "This was incredibly helpful. Have you done a comparison video of the FS 3D Muse vs the Make Box laserbox?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What watt machine is capable of cutting 3-4mm carbon fiber sheet? Thanks!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "As a newbie to the world of laser engraving/cutting, can this same process be applied to metals, like aluminium, using a 40W CO2 laser?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Bro you should have Fiberglassed this it would have been easier and looked way more detailed.Great job I learn new things through you",
    "likes": 0,
    "video": "DIY X-Wing Swing from Star Wars!"
  },
  {
    "text": "What are the alternatives to Sainsmart Genmitsu 3020 Pro Max at similar prices? z axis still not rigid enough :(",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "hi! thanks for your amazing videos! btw, do you know how strong should be a led laser machine  to do a deep engraving work like this one here: https://www.youtube.com/watch?v=gXc0jnqZYuA  best of luck with your work!",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "My xtool vibrates really hard when I'm trying to do pictures. Please help",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "I can't do custom pictures with my xtool why is this. It starts shaking and the picture doesn't come out right at all",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "I know it old vid but can you answer my question !  does it cut acrylic  ?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Funny how demand raises prices instead of looking at sales as job stability greed slows and potentially kills off buyers. X-tool lost me as f today as it just keeps increasing the price.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Is marking inside of a stainless steel spoon possible ? Thanks..",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "You completely missed out on galvo lasers, they are vastly superior for any marking that needs done quickly",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "There are SF and LF versions of the LU2-4 that are the same price but I don’t fully understand why one would be preferred over the other",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Mine has more than 600hours at 100%, Still going strong......",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Could you recommend a cuttingachine that can help me cut cardstone for invitacion making ? THANK YOU 🙏🏻",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Hey can you test how this laser perform on foam board? Diode lasers generally don't cut white foam board (flight test planes).",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "HELP 😭  I'm looking for a budget friendly laser cutter that can help me cut cardstock for invitations and maybe basswood or plywood. Thank you 🥰",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Glowforge support is trash, they have a rep for selling defective or slightly off units to individual makers/ hobbyists and keep the well working units for bigger companies/ clients.",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Hi. Are any of these diode lasers powerful enough to cut 3mm transparent/tinted acrylic sheet? The problem with acrylics is ofc that it does not absorbs much of the light, passing it through.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "i dont know if anyone asked this yet. But do you know where to buy a circuit board for this model already installed ? I would like to use light burn",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "You keep saying \"per second\" (10:48 for example) but the printing on the board says per minute. I'm sure it is per minute as it would probably shake the engraver right off your bench at those speeds per second.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Alright so if we have the money for the Makerbox Pro. Should we get that or this? Just a basic crafter.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Non of those accessories r worth it use ur brain and DIY it people not hard... otherwise why buy this when price goes up towards higher end lasers...just for a few add ons..",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Diode lasers can cut things; it's all a matter of spot size, wavelength, and output power. You wont find them too much on hobbyist machines, but stacked diode lasers in free space or fiber coupled to them (direct diode lasers) can rival fiber lasers in terms of material processing 🙂",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I want to by a 15w laser cutter for cutting 2mm paper. Do you mean sir it,s enough power to cut ✂️. And the machine should cut 1000 paper per hour. Can I achieve this number per hour. It will be nice sir if you answer me. Thank you 😊",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Looking for advice on engraving aluminum. Just etch it. What. The best one for budget? \n\nThanks",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Do you know what's the cheapest machine to be able to cut thin stainless steel gobos?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "never use the free glasses that come with these unless you want to go blind.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "After watching this video it helped me made the decision not to buy. Thanks.",
    "likes": 2,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "That was the reason I didn’t go with this laser. Nice upgrade!!",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Has anyone imported to UK and if so how much was the Customs duty tax,\n\n thanks",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "It is only the perfect tool if you get one that works.  I had to send mine back for a refund as support was unavailable and when reached by email got the hard to communicate with broken English thing. there is no support here in the USA. You better hope you never need any parts as it might take a while to get them ... if you can communicate what you need.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "The reason you can't get to the front edge is your brackets on the bottom are backwards.  I had the same problem when I put mine together.  I also put the bed on upside down (only had 3 cuts vise 4 on the bed.  Once you turn the brackets around, you will be able to go front to back, right to left.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Just dont use a fish eye lens.... there are way to many fish eye lens videos on youtube.\r\nI will send a rectalinear lens in space this april, and post it on my youtube  channel.  just wait for it:) i can tell you the result will be biblical",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "First of all  thanks for your videos, I have a problem of accuraccy in My twotress diode láser, Even in a low speed, i Make small pet tags ( i engrave them, they are Made by paint metal), is this new laser that you are promoting good for me? To make small engravin over the pet tags with accuraccy?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "The laser goggles that come with the Ortur LM2P is worthless.  They offer zero protection.  You need to go and buy a set of glasses that is OD5+ and EN207 compliant.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Do not buy this machine !!!! PLEASE go to their Instagram and Facebook page and read their reviews. MANY people including myself have not received their lasers !! Please !  This company do not respond to messages , packages are going to the wrong address,  and laser app has issues .",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "My first major woodworking project was building the exact same table you first built and they look identical and have the same EXACT problems, even down to the hand plane and the divets from it haha.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Ive just started researching lasers. Would this machine be ok for cutting sheet latex?",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "SMH 🤦🏽‍♂️ and I bought the atom stack 7pro and I’ve been seeing many issues wit with it but the D1 was too much for me and it didn’t have a frame extension for the price and I wasn’t liking the sculpfun at all, I have got it yet tho still awaiting it to get to me.",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Great vid! I don’t know that I can tell why you like the xtool d1 and the atomstack more than the NEJE. Is it the build quality? The huge workspace and the recent inclusion of the air assist of the NEJE makes it seem like a better alternative",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Mine worked twice and then never worked again.  The Bluetooth failed on it.  It's a cheaply made product.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "have you got your hands on a m1? curious how it compares",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Thanks! This xtool look great, I thinking of get one to start playing with lasers 🥰🐶",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Do you think a carbide tipped bit would work good for carving in brass or aluminum?",
    "likes": 3,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Would you recommend this for a beginner or another laser?",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Nice video.  I suggest that you separate the honeycomb from the aluminum plate.  The way you have it attached prohibits air flow through the honeycomb.  Even a little gap, will go a long way, especially when/if you ever add an enclosure with an exhaust that needs to draw air across the work surface.",
    "likes": 6,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Can you link your test file? I would like to use it with my new machine!",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "This is a great video thank you! I have the ortur and i think this is a huge step up!",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "I want to make a simple logo coin to inset into my wood turnings. I have used purchased metal coins before but they get expensive. My plan is to engrave a metal disc (maybe a dog tag material) or maybe a more elegant disc like stainless steel or brass. My logo is not complex and I have it in a jpg or other formats. Can this machine do what I'm thinking? I don't want to invest $800 only to be disappointed. My coins are about 20mm in diameter.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Thanks for showing the upgrades, can't wait to get my hands on the 20 watts diode!! 😱",
    "likes": 2,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Great review. Now I'm stuck in-between the Xtool and the Atomstack! What's your take on these two.? Which is better?",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Nice review of the add on goodies for the D1!  The honeycomb tray is a must buy especially if you are cutting.  As a bonus you can use larger neodymium magnets for things like leather and thinner material to secure to the honeycomb material.",
    "likes": 4,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Just picked up one of these. Between the build quality and your review of it I decided on it over the Atomstack.  I thought about buying the air assist but saw that many aftermarket solutions exist and figured I would mess with those first.",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "I have been using TurboCad Mac Pro for a long time and there are some things in Fusion a bit difficult to do understand. Question: every time you make models, the sketches should be with the components? Let's say you making a wardrobe. You need to have individual components for: Sides, Shelves, stretchers, doors, etc.? I do cabinets using a Festool domino. and every of those components have their own sketch?\nI got the sketch padlock many times ...",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Finally I watched the whole video. Great! Thanks for sharing. It would be great if you could keep on the side the menus or keys that you press a bit longer, so we have time to see what you pressed. Everything goes very fast ... Thank you! again",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Is the sink waterproof? If not, how could I make the foam waterproof pls?",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Pl"
  },
  {
    "text": "I bought this laser, this is my fist time using a tool like this. I am struggling with the tracking of the gantry. It wants to rack on the y axis travel, causing alignment problems. I know this is a cheap entry level unit, just wondering if there is a fix for this. I have been adjusting the guide rollers and drive belts with limited success. Just wondering if you have thought of doing a video on the set up and tuning of similar style machines. Thanks for all your content.",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "I know this is old video, but should I worry about adjusting Kerf in lightburn or fusion 360? My thought is once i pull from 360 into Lightburn, thats where i want to make my kerf adjustments.",
    "likes": 0,
    "video": "This is Why I Use Fusion 360 to Make a Bed."
  },
  {
    "text": "Which diode laser would you recommend for cutting .5mm poster board? I'm trying to cut stencils out of it.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "So just to be clear, this unit CAN engrave annodized aluminum?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "how about import ai files? can it be easily selected which area is engrave, which part will cut?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Have you experienced \"Connection Lost\" issues with the Diode Lasers you have?   I started having this issue recently with my machine.  Can't seem to get it working normally again. Any suggestions?",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I find your video a bit difficult to follow, specially with the pointer moving so fast on the screen.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Can this engrave brass coins? I want to make logo coins to inset into my wood turnings.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Any opinion on this machine, stool D1, compared to the sculpfun s9 laser?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Forstner bits would make the holes you put the screws in look nicer.  I made similarly my own bed frames and buying a set of forstner bits was definetly worth it as leaves such a clean hole.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Can the laser shield cover be raised up on the laser unit?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Hi top Video is the x7 pro better than the xtool d1. Which one would you buy?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "very helpful , currently am working on installing the air assist,",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "If you are looking for something like this, you will find it on the woodglut website.",
    "likes": 0,
    "video": "How to Make a Kids Play Kitchen: The Frame/Doors/D"
  },
  {
    "text": "When will they make a mini affordable laser that can engrave and CUTT THROUGH METAL. Small and portable.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Just FYI.\nDon't run the ground lug to a different ground than what your source of power is using, it is dangerous.\n\nNEC wants an effective ground fault path for ground faults, the Dirt or a rod in the Dirt is not an effective ground fault path. \n\nAn example would be if the metal frame became energized, the dirt has too high of resistance to return the voltage to it's source, in this scenario you would get shocked if you touched it.\n\nA rod in the dirt is only good at discharging static or lightning.\n\nThat is why the ground is tied to the neutral in your electrical panel.\n\nIf the case becomes energized it will take the path of least resistance back to source through the ground wire which would cause the circuit breaker to become overloaded and open.\n\nThat's how the ground wire works. It's an effective ground fault path back to the  source, utility.\nStatic and lightning discharging back it's source, Earth through the ground rod.\n\nThanks for the awesome video 👍",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "I just bought the X7 pro with extension kit, rotary attachment, extension feet, oversize rollers and pre-purchased the air assist. Basically everything they have for the X7. I've had it for about 2 months and used it a handful of times. It behaved glitchy then it started rebooting 1/3 of the way through any job. It did this running from the computer and from the SD card. Atomstack was pretty cool about replacement of the mainboard. No cost, no shipping fee. The new board should arrive 3/11/22, hopefully that will fix the problem. I'll let you know.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "15:40 You say mm/s and written is mm/min. So what is it???",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Do you know if this can be used with the cup attachment for engraving cups and tumblers?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Is this considered a UV laser? Would it mark on object the same way a UV laser would?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Very helpful video . Did you had a chance to check out the Laser Tree 80w  unit ?",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "For the Aufero 2  you can build a macro and use settings in Lightburn to basically simulate your limit switches.",
    "likes": 4,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "They updated their claim on their website to 0.06 x 0.06mm although their Amazon store shows both 0.08 x 0.15 and 0.08 x 0.08mm. I talked to their customer service and they confirmed it is 0.06 x 0.06mm. Could you check it with a different material without a grain such as SS?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Nice machine, few corrections, the clamp bolt size on the worked are M6, not M16\nYou seemed to indicate using the knobs to adjust Z probe height & X/Y zeroing. Not exactly accurate as the DRO will not account for those movements and not know offset or a curate position to apply to Zero!",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Great video!! I’m very interested in getting one of these units but I’d like to see more about the IOS/Mac apps and how you transfer the programs to it. I’d love it if you could make another video showing that process.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Im courious as to where the pic for the thumbnail comes from ? Im pretty sure i went thru the whole thing twice with a horizontal line in the middle of my screen looking desperately for the second where the fisheye lens is activated ,but to my surprise there is no fisheye lens effect in the film footage presented here ! Sooo i would love to know the reason behind the ball earth or its origin? Somebody please tell me some kinda lie or bullshit excuse for the sake of humanity??",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Wow im at a loss for words rite now !!!! Im no flat earther or i should say i wasent before i seen this video without a fisheye lens !! Its flatter then a fucken chalkboard ffs im perplexed",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Working for Inventables, this channel, editing podcasts, father....no wonder you haven't been putting out your podcast. You're a busy guy!",
    "likes": 5,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Great review. Have you tested the FoxAlien Reizer Mega Desktop CNC Engraver Class 4 20W Fixed-Focus Power Module and Adjustable Z-axis, 400x400mm CNC Engraving Machine",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "What type of laser will cut Polyurethane Foam the type of foam that comes in Pelican cases? this foam will be up to 1 inch think.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks for your tutorial I would like to know can you cut stencil or make your own stencil with this machine",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Been waiting for this machine for months. Decided I should get into desktop CNC machining because I was having so much fun with my k40 laser, and pretty quickly decided this was the machine to get because of the aluminium spindle bracket and the proper linear rails. Seemed like the likely price vs performance sweet spot. It had just started shipping to the US, surely they would get the UK certification sorted before long... right? That was like, 5 months ago maybe? Still waiting. Fkn brexit I guess.",
    "likes": 3,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Is it good for online business? For leather wood aluminum keychain?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I like your videos, but I am looking for a first engraver for metal (jewelry metals). One that doesn't take up a lot of space or money.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "The atomstack X7 pro is a diode laser that is 50W it works to engrave metal without powder coat.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Wire management? Where we're going we don't need wire management!",
    "likes": 35,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Great Video, thanks alot\n\nI watched several of your videos and noticed that you didn't mentioned Laser Pecker , any issues on their products ? should I avoid them and consider one from the list you mentioned\n\nI'm totally new to laser engraving, appreciate your help :)",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Just a quick mention regarding using the Offline controller, some folks don't know this, you cannot have your USB cable plugged in at the same time the Offline controller is being used. cheers!",
    "likes": 4,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Whatever you decide avoid Full Spectrum.....when you have issues and you WILL have issues their tech/customer support is nonexistent!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "It would be nice if they could design into this a dust collector motor with a small port that moves along side of the bit motor to collect the wood shavings/dust as the routing is performed. Is that what the \"second motor\" could be used for in the future?",
    "likes": 2,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "If it does in fact get shipped to you assembled that helps a great deal imo. Unless it was shipped assembled just to you for your review. Not sure.  Can't you lay the power supply and mount it just under the rails of the work bed and prop it up for air flow underneath? Thanks for your review of the 3020 Pro!",
    "likes": 2,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "What is the hole spacing for the work holding grid?",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I am new to lasers and would like to purchase one to cut thin wood to build structures for my hobby.  I was looking at the Ortur, but it seems that the diode lasers are more for engraving, will they cut?  I am wondering if I need to save and buy a CO2 laser if I want to do cutting.  It seems like the Glowforge and it's counterparts are overkill for my modest needs....any suggestions?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "how thick of material can you put in it to engrave? I make cutting boards that are about 1.5 to 2.5 inches thick.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Any chance you've run a test after several months of use? I'm curious if other people's modules have lost power after a while.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Do you know if any can engrave gemstones, like quartz or moonstone?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi… I would like to set the machine up in my office that is in my basement. If I get the fume extractor that they recommend, Do I need stool get a tube out through a window for ventilation? Because I’ve seen other machines that comes with extractor for use indoor spaces.",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I would like to know if there is a machine that cuts through silver and gold plates.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "this camera has a concave lens, if this was just a phone camera it will not look like this having curvature.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "They are basically tired of people not paying their dues. They created an amazing program that anyone can just pick up and make thousands if not millions with. Anyone can pay 500 for a year of fusion.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Thanks I am looking for cloth cutting machine for tailoring \n\nCan u pls suggest me some links on how I could select one",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Is it possible to connect it to LightBurn via wifi?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hello. This is a great video. I just purchased my first cnc/laser engraver 3018. \nI have a question. I want to make a branding iron for myself. Is it like the same process in this video or easier?  \nAlso watched your rubber stamp video but unfortunately there was no technical  explanation which i need :) so decided to write under here..\nThanks in advance.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Hi There- do you have a video that shows how to make these upgrades?",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Hi can you laser photos on like a tiny dog tag? Thank you so much",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Have you had a chance to review the 20 watt version that will be announced on March 2nd?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I think it would be very informative if you gave the engrave/cut times. I've owned a diode and co2 laser now and I think some people would find it helpful to know how long it takes to achieve a finished product. I'm not In the market for another one currently, I'm working more with plasma, but a coworker talked about this so I thought I'd check it out. Seems pretty nice and the creature comforts seem really nice specifically the integrated focusing jig.",
    "likes": 5,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "30W fiber laser using brilliance (BLI101MBLIQ120) Need settings for aluminum and stainless steel please",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "How long does it take for this machine cut a 1/4\" 4\"x4\" piece of wood with detail?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "This looks a lot like the Ortur Laser Master 2, but a whole lot more expensive.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Could you do a side by side comparison of this and the xtool d1 if you had to pick one what one do you recommend",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Not only is Glow forge software wi-fi it is located on the the Glowforge server and you must connect to the internet to use the LASER!!!!!",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Bsst!   Lightburn's cheapest license is $60 and always has been!",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Could you use this to engrave at least 0.003 inch into 7075 aluminium?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Good and informative review. Thank you! Just one question.. With CO2-lasers the air assist near or on the nossle is for clearing the smoke and fumes, so the beam is unobstructed for a sharper, better result and the focusing lens gets less wear due to particles sticking to it and burning in. In the video you mention air assist, or lack thereof, on diode lasers, but as a lacking safety feature for putting out fires.. Is the use of air assis that different in the two types? In my experience the air assist can promote the opposite, as it fans any fire, adding more oxygen.",
    "likes": 3,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "HOW CAN I CHANGE THE DIMENSIONS OF THE OBJECT WITHOUT ALTERING THE OTHER. WHENEVER I DETERMINE ONE OF THEM, IT AUTOMATICALLY CHANGES THE OTHER TO MAINTAIN THE RATIO. CAN YOU HELP ME PLEASE?  THANK YOU",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "HOW CAN I CHANGE THE DIMENSIONS OF THE OBJECT WITHOUT ALTERING THE OTHER. WHENEVER I DETERMINE ONE OF THEM, IT AUTOMATICALLY CHANGES THE OTHER TO MAINTAIN THE RATIO. CAN YOU HELP ME PLEASE?   THANK YOU",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hi thank you for the great video.  Can you tell me the name of the microscope you were using in the video?  Id love to get some information on it...thank you",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Loving this channel and your vids. In the process of researching for a laser. \nLooking for something to engrave and cut acrylic plastics/abs and engrave metals. \nTo clarify a Co2 won’t engrave metal at all?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I like the concept that Glowforge has, the self contained air assist and cooling is very nice. What I don't like is the software being online. If the company folds you are out of\nluck and if the Internet goes down while you are just about to finish off a big job then you are forced to wait.  My son in-law just purchased an OMTech 80Watt laser for about\nthe same cost of the Glowforge Pro, he can use Lightburn and then have complete control over his designs as well as still being able to run his laser even if Lightburn\ngoes out of business.",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Do you have an up-to-date video or thoughts on the laser after the Lightburn software update was added to the machine? I want to purchase a diode laser for my hobby shop so I can make some extra money. With all of the choices out there I don't know which one to choose. I would like a 10 watt. I am new to diode lasers. If you could help me I would appreciate it. Thank you, I watch all of you youtube videos.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I am really looking forward to see this machine also available in Europe. We own a small customisation shop, but also work from home and at customer location. The portability would allow us to use the same machine and software on all locations as we are now depending on different solutions, that each need slightly different designs.\nThe only thing I am missing compared to other engravers is an option for higher 3D material.\nI really enjoy your videos and, for this style, love to hear  about how these amazing products come to live with great appreciation for the design, quality and user friendliness.",
    "likes": 1,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "can you use this for tattooing?\nI have a bunch of anesthetic and a dream.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Just give us the best bang for your buck laser engraver.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Nice video and information. Story is interesting. Mahalo for sharing! 🙂🐒",
    "likes": 2,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "The price is insane. I would 100% buy a co2 omtech for that price. i may even put extra money and get a 60 watt model. I bought an 500 usd ortur and have made crazy money. I cannot see the benefit of this machine. It most be me.",
    "likes": 4,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "i am very interested in this machien. the two machines I'm currently looking at are this and the m1. very different machines for much diffrent scale. i really like the idea of image extraction(want to be able to ingrave silicone watchbands.) but I'm also a big fan of larger worspaces. lastly i would love cO2 cutter just about of my price range for now.",
    "likes": 1,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "Can it do tumblers if you purchase the \"roller thing\" accessorie?? Can they \"talk\" to each other?\nThank you for your time and effort 🍻",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Does anyone have a power and speed test file for lasergbrl?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I enjoyed learning about how the machine went from concept to creation. Recognizing the amount of thought and hard work that goes into developing a product is valuable. It reminds me to stop and appreciate the fact that every product around me is a result of someone’s imagination and creativity! 🤔That’s way cool to think about!\nYour product videos are great for getting to know the ins and outs of each machine and super helpful for making smart purchase decisions! 🤑\nI say mix it up!  It would also be fun if you recorded your projects and took us through the process with you! 🧩\nThanks for doing what you do! Your videos are great! 🙏🏻🤓 \nCongrats on the birth of your 3rd child!!!",
    "likes": 4,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "I bought online and was deceived by a money detector item",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Loved the video. It's nice to learn about the people making the product. Great content. I probably would have pre-ordered this but waiting until October was the kicker lol ordered an xtool M1 instead. The optic looks fantastic, and the filtration aspect is huge.",
    "likes": 1,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "Speeds?  Diodes are cool, but only as fast as the axis.   3d printers with a diode slapped on are slow...   Don't see speeds mentioned.",
    "likes": 1,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "So, mention of extraction no mention as far as I noticed of air assist, great idea of the built in mat but no mention as I saw of how spacers under work will work as you need that to improve cut through, no hold downs possible as I can see it so light materials may blow away. Cost seems massively higher than it needs to be, I would rather the 3 or 4 otur master Pros you can get for the same price.\n\nThe combined diode sounds cool though but it's not the equivalent of a co2 due to the frequency of the light, need mentioned cutting optically clear items but you can't do that with a blue light diode....",
    "likes": 0,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "Looks like a great machine!! And formatwise, I enjoyed watching a different \"type\" of video... In general I like it when creators explore different types of formats from one video to the next! Great job! 👍😊",
    "likes": 3,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "The machine looks very cool and I'd love to own one, but man they are expensive... I love the form factor, but the main advantage over an import diode is the air filtration. And a $ 2.600 price difference (the suggested retail price) over a regular diode is way to much. Because of the power and speed of diodes, they will stay in the hobby segment for most people and the price tag is probably to steep for most people to take this machine into consideration. But hey, just my opnion...",
    "likes": 3,
    "video": "The Next Glowforge?  The Rendyr Optic Laser Engrav"
  },
  {
    "text": "Did you need to activate or otherwise with the firmware…or is a case of fit the end stops and plug them into existing pins/sockets on the board?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "maybe you can help me the four screws that hold my gantry to the frame is loose, I tighen the screws but there is a lot of play I have tried everything that I know any tips?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Ok but whats the deal...every body says you can't run it at 100% or it will burn out?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I found this review super helpful, and has convinced me this machine would be a good addition. With this laser option they sent, and applying the code, it's 369 before shipping. \n\nIs there a way to get one of the 100*100cm cheapo Ebay engravers to work? I really need a much larger working space for engraving, but the few comments I've found online is that no one can actually get them to work.",
    "likes": 2,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Does importing a camera image for alignment also somehow work with LightBurn and the LightBurn Camera?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Is it possible to change the red laser cross hair to a dot?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "The sample metal dog tag included in the package lasered like a champ. But I yet to find another uncoated metal that will do the same? What am I doing wrong? There's a setting for stainless steel, but it doesn't do anything on metal blanks.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I wonder what the actual life expectancy is? Would running this at no more than say 60 percent, and doing multiple passes extend the life?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Kind of like this format as an educational product comparison video.  For hands on actual system testing, I prefer the Shop Video format.  Oh and to answer, what I would pick!  If I could afford it! It would be Glow Forge.",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "What's a good laser for polymer... specifically pistol polymer basically black plastic",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "As a hobbyist looking into laser cutting for the first time, this looks great, but is far too expensive for experimenting.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "So the xtool d1 now has light burn comparability, and the atom stack looks like it’s coming out with an air assist later this month. I think these updates fixed the biggest problem with each machine. But now I’m super torn between the two. Id really enjoy hearing your thoughts??",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Can the Atomstack S10 cut shapes out of metal sheets? If so, what is the max thickness? Thanks for all of the information.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I like the volume of information, but please speak slower. There was a lot to take in, and all of it is new to me.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great video, might i suggest talking a wee bit slower, and possibly mentioning your key shortcuts as you go. You have the issue where you speak quickly and just click around not really describing everything you are doing. Its the most obvious thing for you, but not for someone learning fusion 360.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Laser pecker is a scam.\nThey won’t deliver product \nSave time and money.\nJust type in laser pecker scam in google you will see",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Laser pecker is a scam.\nThey won’t deliver product \nSave time and money.\nJust type in laser pecker scam in google you will see",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Amazing breakdown of the categories and thanks for including the most important specs, price, functionality and putting them in categories.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Co2 lasers are even used in plastic surgery to resurface the face, yes they laser the face which regenerates collagen so your skin looks younger,  it’s crazy some brilliant person thought of using it on skin.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "What would be a good one for engraving on axe heads? In $2K -$3K Range?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "This seems awesome but I'd absolutely love it if it also (or if there was a higher end model that also) prints circuit boards. \"Prints\" might be a strong word, I mean burns/vaporizes the copper you do not want. Or perhaps, melts the copper for the traces that you do want onto the board. \nI mean this is cool in and of itself but if it had that secondary use as well I would just have to have one.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I want to buy 1 laser machine which one willl u recommend ?? I have no idea on these machines so really need some assistance",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Hey,\nCool video! \nI have been watching your videos and trying to decide which type of laser to buy... 10w Diode or 40w CO2... I want to engrave/etch metal... which one Is better to get the Atomstack X7 Pro or the Omtech CO2 and will they both etch metal the same way?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "the file doesn't load and I hope you don't send me a bunch of junk mail",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "hello! currently xtool D1 10w is at $600 equal to atmostack x7.  Which of the two do you recommend , if I just want to engrave on steel? Thank u!",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I can see this engraver setting in my garage in the near future. With that being said I am starting from scratch and I currently do not own a laptop.Can you recommend a particular laptop that works well with this engraver? I have owned Dell, HP's, iPads, etc over the years if that helps. I would prefer to spend any extra money I have on goodies for the engraver, but I want a laptop that will work well with the engraver without a lot of fuss. Thank you for your time and Thank You for posting this video. Your feedback is what I used to determine which engraver I want.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I'm trying to decide between this and the Atomstack X7 Pro. Which has finer detail and accuracy?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "can this engraving machine make cliche for pad printing?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Will this (10W version) cut 3mm solid white and translucent white acrylic?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Which laser do you recommend for metal engraving and maybe cutting on need for small pieces jewellery )",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Thanks for the video. I was just browsing the Atomstack site and noticed that they sell the 10W module as an accessory. Could I put that on the A5 machine as an upgrade? What else would I need to make that work?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hello I just got my aufero laser 1,  do you have any test files for lasergrbl, thx",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I am looking at buying my 1st diode laser.  I am debating between the Xtool and the Ortur pro2.  If you were to buy one of these two which one you would go with?  I know the Xtool is larger watts but I am thinking in one of your videos you said rumor was Ortur is coming out with a 10 watt head also.   Also want to buy a Fiber laser to do metal engraving and engraving of guns.  What would you recommend?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "why cant you find any good reviews on their laser, wish you could do a review on the latest release of this laser, I like the auto focus part",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I'm a wine rep and sell a lot of private label wines to companies looking to self-promote their business. Is there a laser that you would recommend that would work to engrave wine bottles?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great video,like the machine for it's size ! You said there was info for a give away, but I didn't see it anywhere in the video.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I keep getting the error 'Recovery Printing - Job is not done. Do you want to recover this printing?'.  Happened 5 times in a 14 hour print.  210 Nozzle Temp.  70 Bed Temp.  Using Cura.  Any idea why this may be happening?",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Thank you! I was trying to remember how to get to Change Parameters and you reminded me at 3:07",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Which laser would  be able to cut  stainless steel up to 2mm thick ?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Glowforge's seem really nice but I really don't like that requirement to use their web service. What happens if they shut it down or go out or business. My machine stops working.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Update: The xTool D1 now supports Lightburn which was my biggest negative from the machine.  Overall this is my favorite laser diode even at a higher price point than others.",
    "likes": 48,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "As soon as I heard 'Kickstarter' I closed the video.",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "They seem to have support for lightburn now.. considering buying this to do custom wooden invitations and maybe selling some stuff to pay itself off..",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "A breadboard is so the table doesn’t cup. Dowels are a good idea but offer really no extra strength, just help with alignment of the top. Be careful when using dimensional lumber from the big box stores because it is typically still around 18% moisture which is too high for furniture making.",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Great review.  How does it compare to SCULPFUN S9? It is said that the S9 has stronger penetration to cut thicker wood or acrylic? want to see",
    "likes": 1,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Very informative video. I am your new subscriber. Can this cut a 5mm thick acrylic with 300mm x 400mm size? Could you please recommend form budget buy to Best Buy? Many thanks.",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Can this cut 5mm acrylic? Would you please recommend the best one for that?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "What is its wavelength? I see you are wearing green googles but the machine has an orange shield?",
    "likes": 0,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "I need a laser machine more for engraving, it would be fun too if I can cut other materials, according to your experiences would I make the right choice to buy ortur laser master pro2?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "can you please tell me what is the differenc between this engraver and the SparkMaker laserpro for sale SparkMaker3D 7W/10W Laser Engraver & Cutter with Camera Diode Laser Dood engraving machine? and how can one confirm they would be getting the 10w, for sure?any fedback , suggestions? i trust your feedback!",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Can I engrave stainless steel with this if I get the rotary attachment for things like yeti cups?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Great tutorial on cutting shims. Also appreciate the humour - I found it fresh and entertaining; and I now I must look up something current immediately after this post. Lastly, I really think the video production was fantastic. Subscribed.",
    "likes": 1,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "I just put mine together today 10W with the rotary and downloaded Laserbox & LightBurn on my MacBook Air and it cant find my laser, I hooked up my Wife's HP laptop and it worked and printed. Do you have any ideas why my mac won't find it ?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Hi, so what is the real spot size of the D1, please? You didn't measure it during the review, many thanks.",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "I want to cut out svg file for miniature house on mat board and thin wood will it work for me",
    "likes": 1,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "hey , can i get a lazer working area of a height with 14 inches ? i mean my pc is 14 inches long and i want to engrave the bottom , what machine should i use ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I don't think your email on page to send test file is working. Also as a question, If I was planning on mass production of these for business what model/spec would you recommend for speed &clarity? You've been the best voice on Yat by far and I've enjoyed your work. I will be buying through your affiliate a d also several of your courses. Great work",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I think the comparison should be between the Atomstack A5 PRO and the Ortur Master Pro 2. They are both similar optical power. The X7 Pro would be the next step, don't you think? thanks for the video by the way.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Could you please test the size of the dot of LU2-2 and LU2-4 LF?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "What is your opinion with the mr carve M1 fiber laser?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "I was able to add limit switches to my AL2 quite easily since it has the same motherboard as AL1.",
    "likes": 6,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Does this work well and give good depth on hard woods as well?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Hi Brandon, I have to say, you are the only person that I watch when it comes to laser talk. Though I know nothing of the machines and most of what you speak of is a foreign language to me, I enjoy watching them all the same. With that being said,  I am seriously in need of suggestions because I have absolutely no idea what I need to purchase, especially since I have never laid eyes on a laser/engraver in my life.\r\nWhichever one I purchase will be going inside my craft room in my house. The room is 25 ft long X 13.5 wide so space is not an issue, however, the entrance to my house is only 34” wide, so it would have to be small enough to go through the entrance.\r\nIn no particular order, these are the things that I would love to learn to create… Jewelry pieces (namely earrings) from wood, leather, and acrylic. I’d like to be able to cut out the wood to assemble jewelry boxes, shadow boxes, keepsake boxes, small-medium-sized desk organizers, and similar items. I would also like to be able to learn how to make round door signs (at least 15”), 3D layered designs and other wall decorative items.\r\nI would love to be able to learn how to engrave on leather and acrylic, books, personalize journals, wallets, and a few other items. I am not new to crafting, just new to laser cutting/engraving.\r\nI would greatly appreciate all suggestions that could help me make my final decision as well as any other equipment that could help make things run smoother and of course, the more budget-friendly it is, the better.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Can other lasers such as OMtech Co2 lasers and Ortur Diode Lasers engrave on apple products such as Iphones, Ipads, Macbook Pros ect. without damaging the internals of those products?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I’m needing to make some cardboard boxes, for the stuff I’m making and selling on Etsy..  It will be a good option to make it them with a laser cuter like this one, or the Laser Master 2?",
    "likes": 1,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Great review again! You're the gold standard when it comes to laser reviews on youtube.\nI've been on the market for a laser for quite a while now and can't seem to make up my mind, so I really appreciate these vids.\nI know I want a dual diode laser. My 1st choice right now is atomstack x7 as they now are promising air assist to be released for it soon. Neje was on my radar, but their setup seems very \"janky\" and I've heard they're overdriving their diodes way too high = shorter lifespan.",
    "likes": 3,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Hi! Am I able tu use this using .dwg files in AutoCAD ? Or just using the software AutoCAD to draw what I want and then open it in another software to laser cut it ? Thank you in advance",
    "likes": 4,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "The aufero 2 link is a white page (body) with navigation links. Don't think that works well for affiliates.",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "How do you make sure it doesnt lands into a river or highway? Just curious.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Thanks for the info, really looking into getting a laser cutter",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Laserpecker team has not sent my product for 3 months...",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "A couple questions that I hope you can answer for me. I've been watching several of you videos, Thanks for doing them. Can you cut dry erase foam board with out melting the centre foam, or how bad does it melt or make a mess of it. If it doesn't wreck it, since the foam board is not perfectly flat how big a variance can you have with out having a major issue. I presume it would affect the focus? Just shopping and like the power of this X7 Pro. one last question will you be showing any laser cutter with the auto head adjuster like the one you mention in this video. Thanks in advance",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I’ve enjoyed watching your review videos. We are starting our own business and will primarily be doing engraving of different types of woods including hard woods. With occasional cutting small things. Trying to find the best thing to start with. Between this and Ortur. Any recommendations?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "This is great.. do you know anything about the SculpfunS9? I really want something that can cut thicker, but overall... a larger space. I hear the sculpfun S9 is perfect for that. Thanks so much! I love your videos!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Would you happen to know the highest dpi for the 10w version?...when i try going over 600 i get a \"danger, notice\" pop up.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "What about the sculpfun S9? Any thoughts on that one? I really want thick cut, rotary and a LARGE workspace! Thanks sooo much! Great videos!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thank you for sharing 👍👍👍very helpful information",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello, would you consider to sell it? :D it not can be founded anywhere...",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "What's the cheapest option to cut 1/8 acrylic sheets? Does it have to be a co2",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Looks like you have the prototype not the newest one",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Hi. Really nice video. \nWhich machine can you recommend for engrave 100 dogs and cats tags per day?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "It must have...about  6 w... . It is nice to who want learn about lasers .",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "you say this wont get as clean of a cut on the outer edges of the product you want engraved, but ... how far out CAN you go while keeping it cleancut?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Atomstack x7 or D1? Been watching lots of your videos and it's my go too. Want to engrave mostly barrel heads from whiskey barrels.Very little cutting. Want something that works at a reasonable amount of time. Or should i just bight the bullet and go CO2?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Are there any frame upgrades to increase size to 760mm or larger on one axis?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Just curious I want to open my business in the future and I know this isn't the place for legal advice but wouldn't selling that tile be copy right infringement",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Great video.. how thick acrylic would this machine be able to cut ? Maybe it would need several passes but i don't mind that.. if you don't know how thick acrylic it can cut, maybe you have an idea since you seem to know alot about this stuff :D  Cheers..",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Hi, thanks for the interesting content about diode lasers! Please make a comparison of the diode modules of different engravers. You can compare the size of the laser dot by projecting the laser onto a wall.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Just came across this. Great video. I went to see if I can order this printer and under their campaign for the Sparkman Laser Pro it says suspended. I know this video is 8 months old but does anyone know if this particular laser engraver is no longer available? Thanks.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I'm looking for a laser engraver to do simple engraving on wood or acrylic pen blanks or the occasional small wood project.  I have a Meterk DK-BL model that is the size of a Jack in the Box but it doesn't have the power to really burn nicely into some woods and I have ruined some projects that I have turned on the lathe due to the object moving as the diode head moves, or the type font not being in real-time what was on the screen.  I might not know what I am doing as well. I am not going into business but rather a simple hobbyist that likes to give nicely engraved gifts to friends.  I would like to stay under $400 if possible.  Thanks in advance.",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I would go with the k40 because of all i will learn whilst getting to glowforge level.. I would like to see you build that one u configured and see all those parts working.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Hello can you use a rotary with the Aufero Portable Laser Engraver 1",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Have you tried the sculpfun s9 laser? It's really looking good to me. I need a laser with a larger workspace or at least a pull through space, and a rotary. Thanks.. your videos are great!!!",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Is it weird that I want this but have no use for it?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Have you done any deep engravings with the 20W unit? I know 30w and of course the 50w can do it, but was curious about the 20.",
    "likes": 16,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Will this laser (10W) version engrave off copper foil from circuit boards??",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Are there any laser engravers for around $1,000 that have an auto focus/adjust on the z-axis to engrave on un-even metal surfaces?",
    "likes": 2,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "I have heard a lot of folks saying you have to avoid using the laser over 80% capacity, and a few who say 70% is the cutoff, but you are first one I have heard to say 50%. Considering these Chinese lasers are always 10w under the stated rating, you are ending up with 20w of cutting power. You might as well stick with a diode laser.",
    "likes": 1,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "Smart guy,  like your safety  measures,! Safety first 👍",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "Wow, nevermind my comment on you other video. I think I found my machine.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hey! I'm really interested in getting a laser engraver/cutter for my shop and I've been through a ton of your videos. I'm looking at a diode laser like this but I was wondering if you can speak to your experience in cutting wood materials like plywood, MDF, or solid wood. Thinking about this for making jigs and templates for routing. Do you know if this will cut up to 1/2 in materials? I wanted to use a laser for that and engraving cutting boards.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I giggle every time I hear the name. lmao. It's pretty neat though!",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Thank you for sharing nice video 👍👍👍 can this machine cut 1/8” plywood?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Thank you for sharing nice video 👍👍👍does it cut 1/8” plywood?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  }
]