[
  {
    "text": "Ok i was just using TinkerCad and noticed there was ALOT of limitations but that is expected on a WEB BASED 3D MODELING... I mean come on.. So i looked in to FUSION360.. and since im a bit older.. i can tell you how i felt reading the changes even years after it happened.\n\nYall remember Photoshop? Like every single person on the planet knew of and used photoshop at least a few times in their lives.\nThen they did the cloud thing.. and guess what.. NO ONE uses photoshop anymore except their super rich nich businesses that already havent moved on to other technology.\n\nThats the vibe I get. Autodesk was something of a community of free users improving their help and tutorials and user interface. Everyone knew what autodesk was even if you never used its software. \nThey will go 100% cloud and be premium for a insane priceing stradegy only to attract the richest of the rich customers all while making their name on the free version no longer offered.\n\nFU Autodesk\n\nMoving on to something else before i get used to your software then you take it away and charge $2600 a year.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "for 4000$  I can buy good machine from factory, 24x39” . why Pay for this garbage",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thanks for the review, I’m thinking of purchasing one in the future. Do you know if the Omtech 60W machine is able to cut clear or frosted acrylic?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Cool all in one. I assume they only offer a low power laser to keep cost down, and if you're looking to cut something, why not use the CNC function? \nI'd really like to see you review the Genmitsu 4030, which seems to have pretty solid build quality for the price and plenty of add-ons like extension rails to massively increase the work area and a 10W laser that would give you 2/3 of these functions, but very possibly provide much more superior performance for the same cost.",
    "likes": 0,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module"
  },
  {
    "text": "Hi,\nI am new to the laser world and am looking for a cheap laser engraver for 3mm mirror acrylic mainly, will the on tech 40w desktop laser work/ I will be creating small items for projects.\nAppreciate any advice you can give.\nThanks",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I just got mine yesterday and came from glowforge so was super nervous about how user friendly it would be. Everything worked great out of the box- I followed Cam’s setup instructions. I had a couple initial hiccups running it with my Mac (no usb and I needed a usb to usb c conversion and then still my Mac not recognizing it for whatever reasons and next trying to run it through a gfci outlet was a no go and still trying to figure out Wi-Fi/Ethernet connection stuff). But now running lightburn on my daughter’s pc it is working great. Much more powerful /fast/capable than my glowforge plus and wow for the price. If you follow the unboxing and setup videos that are on YouTube, read the manual thoroughly, then it doesn’t take long to understand it and get running. TBD if I can get my Mac to recognize it. Also 7mm hold down pins was my first cut and that appears to be the sweet spot",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I checked out your link for the glowforge but when I hit up the chat bot with a question I waited and waited and finally I had to go do something else.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "My wife recently went from a Glowforge Plus to a Thunder 100w Nova 51. She’s doing ok with the transition to light burn but still having trouble using the rotary attachment. Any recommendations or tips I can pass along to her?",
    "likes": 3,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "for $3500 I got a 100w chinese laser that can cut 23\"x37\" and has a motorized bed, rotary attachment, chiller and air assist compressor. Granted you should have some experience before going this route, but you can get a lot more for your money.",
    "likes": 4,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Great video especially for us newbies , I'd love to see a follow up video for pricing ?? Appreciate ya !!!",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "This is exciting but can you show if it has a full pass thru (the gweike cloud does not) and how a rotary will work? I felt like the gweike cloud was going to make it impossible to engrave tumblers as such. I love my China 50W laser but it has a lot of modifications done to it so it is less user friendly.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thanks. I have ordered the Artisan to replace my 350. The single point attachment of the platform is a good point.  Jim Bell (Australia)",
    "likes": 4,
    "video": "Is this feature worth $2400?  The Snapmaker 2.0 Ro"
  },
  {
    "text": "I've been comparing the Omtech Polar to the Gweike Pro and the Omtech looks a little nicer but it's $1000USD more money.  I'd say for that much difference Gweike wins.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Seems that the Polar's biggest drawbacks are the heights you can engrave both flat and with the rotary. Flat is .66 inch with tray and 2\" without the tray  and  the rotary is 1.18 to 2.91 inch. Don't know many shot glasses or glasses that small.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "This is amazing! I absolutely love, love this! Do you have plans for an ink pad storage tower? Or do you know where I can find them?",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "custom rubber stamps? is that possible with one of these low powered 20 watt lazers",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I know this is kinda off the beating path - but since you briefly featured your MF2028-60, do you happen to have any data on that machine's precision?  @omtechlaser doesn't publish it, and I've been trying to get an answer from them for a week or so now.  Kinda concerning that this isn't readily available from them.  \n\nI have a K40, and they actually do publish a 0.010\" precision rating for that machine, but nothing for the 55 or 60W machines.  Anyways - figured I'd ask you because you've been using OMTech for a while.  Thanks MOBS!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I just tried to purchase one, however, the discount code isn't working from the affiliate link.... What do I do?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Would you buy this over the master 2 today the master 2 is $318",
    "likes": 0,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "Thanks for your video! Do you have any spec comparisons or recommendation toward one or the other between the Gweike and the Makeblock/xTool Laserbox Pro?  I'm currently torn between the two and need a professional opinion to sway me in either direction. (To give you an idea, I would be using the laser cutter/engraver for typical Etsy work with acrylics, mirrors, wood, etc. I know either machine would fit for that purpose, but I do plan to eventually grow my shop and learn how to use the machines for more purposes down the line. I'm looking for a machine I can grow with and learn more about as well as do the typical beginner stuff.)  Thank you!!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "honestly... this thing looks cheap right away. i mean, it's $500. this is one of those things where you will actually pay MORE by trying to save money and going cheap.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I know this is a year old but you can get a k40 to a 12×24 work area that's still cheaper than a glowforge.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "hmmm, I dont see agate stone, such as carnelian being something that this machine can engrave. Can someone verify if this can engrave agate stones/crystals/gemstones, such as carnelian?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hey there, went to order a Polar and got this message(Enter a valid discount code or gift card).tried it twice...any ideas? Thanks in advance",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Better get one of the 'new' (oh well for lack of a better term) 3020 machines that can go up to 5 axis. They look really promising for a small CNC aside from the up to 5 axis benefits.\n\nAlso you do not want the powersupply attached to the machine. Dust, (metal) chips and EMI are some reasons why.",
    "likes": 7,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "How would you compare the Polar to the Gweike RF laser system.  I am interested in your thoughts about comparing the 50W DC to the 38W RF laser source.  Looing at quality of the laser, speed of cutting/engraving a quality of the engraved product.",
    "likes": 4,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "To start with I'm looking to write names on a 1/2\" thick piece of wood so would yall recommend this or the laser thingy?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Usually find your reviews good but man this one seams like you did it quickly just to  get it out of the way.👎🏻",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hi Thank you for the tutorial. Can this cut colored and Transparent Acrylic?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Thank you! I was looking to upgrade from a diode laser but space is limited so the big OMTech was out of the question. I was just about to buy a glowforge basic and after seeing this video I placed my order for the polar pre-sale!!! I had no idea they made a desktop version. I used your link, I hope you get affiliate credit!",
    "likes": 9,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I just added both to cart to see final price and looks like g machine adds $300 shipping. Omtech is free shipping. Could a deciding factor. \n\nHowever with g machine being $2550 right now for Black Friday and omtech appearing to not have a Black Friday deal on it seems g machine is still cheaper.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "You soups add a warning for using leather, the tanning process uses some serious toxic chemicals, including cyanide and arsenic.. hitting them with a laser is bad..",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I just bought a Gweike (comes in 3 days!) after seeing your video reviewing it. Now I see this one and feel I should have went with an OMTech Polar..",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Great review.  I have purchased the X-Tool D1Pro with all the attachments.  Half of the order is in and the other half will be here early next week.  Can't wait to get it all set up.  \nMy question is, what do you put under the honeycomb mat?  I am thinking that it would be a sheet of metal.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I just built my own laser.  It’s bigger and faster with 120 watt co2 and was $4000 Canadian dollars all said.  Put many many hours on the machine and it’s been awesome.",
    "likes": 4,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Why omtech continues to make products that are not compatible with 110V and 220V :(",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "neurotic presentation and speech but lot of information. Thanks",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "The discount code doesn't seem to be working for me.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I have a glowforge.  I would never recommend a glowforge because I own a glowforge.  I want to get rid of my glowforge and get a \"real\" laser cutter and not a laser \"printer\".",
    "likes": 95,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Love your videos...so thanks for them 👍 Have you had any experience with the Gweike RF desktop laser? I currently own the Ortur LM2 Pro & use it mainly for engraving ceramic tiles & slate. I would like an upgrade in speed 🤔",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I’ll be purchasing a laser next year and your videos have been invaluable; definitely will sign up for one of your classes once I get it in my shop!",
    "likes": 21,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I am curious what the power requirements for these machines are? Do they require a 110v or a 220v line?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I'm curious how big of a tumbler you can do with this on the rotary. Trying to find videos with the G machine all you see is people using some dowel rods in it but not really showing useful product in the rotary. I like the idea of polar as it'll be easier to get into my basement but I'm wondering if I wanna limit myself or just go with the bigger blue machine you have to the right and make my garage be the new shop area. Think it'd be hard to get that big machine into the basement",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Glowforge is a compete pos. Prior to buying my 50w Omtech, I rented a Glowforge from a friend, and it was 100% unusable because you HAVE TO scan the bed with the camera prior to every burn. So, if you think you’re going to design something and pound a bunch of them out, 1 after the other, you’re going to be seriously disappointed. It makes no difference that every piece is on exactly the same material and there is no need to scan every time. You HAVE TO. Their software is crap and replacement parts are more trouble than their worth.\n\nI had a Lightburn camera on my Omtech. I took it out and threw it away. I can’t imagine what could possibly be the use for something so wildly inaccurate, and that’s after having spent far too much time mastering the calibration procedure. I’d disagree with the statement that Omtech support is great. It’s not. I had an issue with a loose X axis belt. I spent several days going back and forth with them and their suggestions for what to do had nothing - literally zero - to do with the problem, which was a loose belt. I figured it out on my own. Aside from that, I’ve been VERY happy with the machine and I’m coming up on a year of using it for production manufacturing.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I thought with a co2 laser you still needed to wear glasses.. is that not the case?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Pretty good price point, I was surprised it was affordable as it is.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Is there any possibility you could do a comparison and overall review on a Omtech 2440 and anything that is comparable to it like the thunder or whatever else? I am going to the ISA Expo in Vegas in April and will be purchasing something.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Glowforge is going to have to make a pretty big decision in the next few years.",
    "likes": 18,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Will you do a video showing the Polar, or Gweike passthrough in use.",
    "likes": 7,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Great breakdown. Is the working area deep enough for Yeti tumblers on the polar? I see the rotary but it doesn’t look very deep.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Gweike is pronounced “G-wic”\nGweike is also the collaborative partner with OMTech meaning they manufacture the polar.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What is the difference between x20, a20 and s20 pro? Only color? But s20 and x20 are silver both",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Do you think the blade can cut a slightly thicker fabric like a 2mm neoprene?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "What size beam does the Gweike Cloud use? is it a small fine laser beam or is it pretty thick?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Can I ask how long it took for you to receive the Gweike Laser?\nI have placed an",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Let's not forget to mention that Glowforge has zero customer service.  I bought a Pro and the laser tube died after 23 cuts, their answer was for me to pay $1,651 send mine back and then they would in turn send me an old refurbished Glowforge Pro, what the heck?  I haven't even used my new Glowforge Pro for a month and it quit, then they insult me with a refurbish offer and to pay them more money!  Forget the Glowforge!  Zero customer service.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I spy an OMTech Polar! I did a couple videos on it already. Working on a couple more.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I'm new to this.  I'm a hobbyist woodworker and it seems clear that a diode machine will be what I want.  But I still have so many questions.  What does air assist do?  What wattage would I want and what difference does power make (speed?).  What software is most common and will I have to spend money on that?  Can the software run on an ipad (don't have a laptop)?  How long do diodes last and what do they cost to replace?  Can I run these in a cold environment (think garage in Minnesota in the winter)?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "what laser machine is strong enough for engraving Oak wood cutting boards as you talk about at number 2?",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I want buyer Neje  laser machine \nDo you think is good brand",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "No payment?  The machine is your payment, 😂😂. Great video though",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "If you do wooden coasters, Finish them in a polyurethane or epoxy. I have had amazing luck with Zar solvent based polyurethanes. I have a couple test coasters I made, that I have been abusing for the last year. They have held up flawlessly, no surface degredation, I am constantly putting hot and cold items on it, leaving water on it ... etc. Been amazed at how well it has held up.",
    "likes": 31,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I have no idea how I ended up here, but I was looking at signet rings and thinking of how I could engrave them myself. Wondering how this would work with a surface that is not round.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Very nice video, one thing to mention though... Maybe I missed it, but I think it's very important to mention that diode machines can't cut transparent materials like clear acrylic and co2 ones can.",
    "likes": 9,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hello and thanks for your time. Witch one you can recommend me to cut 1/4 and 1/8 acrylic in a clean and smooth way?. Thanks for the advise.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I just learned that diode lasers can't engrave metal. If you want to engrave metal and wood you need 2 different machines. What producers puts on web sites is actually metal coated with something and laser cut this 'something'. So... fast buying - bad buying if you are beginner like me.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "why does k40 not make an upgraded 1500 dollar version?!",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Since this video is two years old, do you have an updated recommendation?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "So your bookmarks example shows a Hobbit or Lord of the RIngs map?  Where and how do you go about getting permission to print that image?  Isn't that a copy right issue?",
    "likes": 5,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Any thoughts on the Epilog CO2 lasers particularly the pro series 36 inch? And also 60 w fiber from Tykma any feedback would be appreciated",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Photo isn’t spelled just with a P, 😂🎉❤. ROTFLMAO, Good one! Just teasing. Love the video and your Polar.",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Is the m1 worth for a beginner or is d1 better? for a 16 year old boy who want to start a side hustle.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Boy, really quick is right. By the time I got QGIS downloaded you were done, so I have to watch about 10 more times to really get anything out of your video. Thanks though!",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Which device do you recommend for engraving gemstones like agate?\nFiber laser or co2 or diode? also what is the minimum watts should i look for to engrave on gems?",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I love the video! Do you know where I can find the video of you showing us how you made your maps? I’d love to make a map of my local area! I live in the middle of Wine Country! I think it would sell really well if done right.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "What would be my best option (engraver) for stainless steel cups?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I am looking to open a shop in a mall for laser engraving products. I wanted to know if ventilation system would be mandatory ? if anyone can help",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I thought kids puzzles were a liability nightmare at least in the US.  If a kid chokes on your puzzle you are going to get sued.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Do you have a current breakdown of the best diode laser? I'm trying to figure out which one would be best for what I want to do",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Personally I 3d printed bar taps with a screw insert in a small block of wood epoxies into the bottom for longevity. Made $6k from a single owner of 6 stores. Good money, just have to go visit the bar, talk with the owner and show him a product. If he likes it, it's a very easy sell. Especially if they can give you their store logo art work to put on the top. It's kind of branding the bar so to speak. That is my secret business lol, wasn't trying to advertise it but its ok, it's not original,  just business",
    "likes": 11,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I find literally the same designs and drawings all over. Researching petroglyphs in Southwest USA turned up two designs created by uncredited authors being sold on mugs, tshirts, woodcraft, metal craft, etc. by at least 10 different sellers... as their own work. This crap is rampant. I can find tshirts with readily available art work being sold at discount stores all over the metro. One guy on youtube publishes a design build, and viewers complain when he doesn't make dimensions or code available.  When a creator does publish build files, code, etc., you can subsequently find that design being sold online as some douche's original work.\n\nSome people are actual creators. Everyone else seems to be ripoff artists.",
    "likes": 6,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Great video - 2 and 3 listed as tumblers in the description.",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Just because Glowforge is based in the US doesn’t mean their support is better. I have found that it takes weeks for them to reply to any email and try to blame any machine issues on the user.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Air assist is an option now, and they have also released a riser base with a honeycomb. Love this machine.",
    "likes": 8,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Please review the consumable CO2 tube in both kits in terms of usage capacity, cost and reliability. Do they have inbuilt fire detection and laser shut off features? I reckon Glowforge would be easier to service.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "If by \"ultimate\" you meant 1/16th the size, then Wow you did it ! Congrats it's amazing !",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's H"
  },
  {
    "text": "Hey can you tell me what type of omtech laser is that? It doesn’t seem like a k40",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Is this a space where a person would have to purposely be doing things wrong to not turn a consistent profit with any of the high end machines?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "step one) steal artwork from the internet \nstep two) engrave it on useless tat",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Just pre-ordered the polar from omtech. Can’t wait for your review.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I agree with all of these products and recommendations! Great work and great video! 🎉",
    "likes": 4,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Thank you for the awesome video.  I’m currently making ornaments for a local state college to give out.  I definitely like selling local rather than on Etsy.",
    "likes": 7,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "So your first idea is to take a design from a copyrighted work?  Come on...  This is literally why Etsy is flawed.  Tons of vendors stealing each others work and selling as their own.  You mentioned copyrights at the end of the video but your first item has copyrighted material as well:  \"Tolkien's original drawings, paintings, maps, designs, scripts and other graphic works are protected by copyright and may not be copied\".",
    "likes": 33,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I loved all the information you gave. Thank you. What is your recommendation /advice to use a laser engraver on stone",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi, can you post the link to this specific aufero laser 2?",
    "likes": 2,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "Hi mb, \nI love your videos!  Do you think this machine can also be used vertically against a wall?  Is the motor strong enough?\n\nGreetings,\n\nMartijn from the Netherlands",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Thank you helping making my decision easier.  Started with Fusion, and keep thinking I might switch to Sketchup, I just need to stick with it… :)",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "I never hear anyone specify what computer you can use. Mac or windows? Are there any that can not be run on a Mac?  Please do a video on setting up the computer and what computer you use.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Loved this video. Going to have to explore doing some things like this for sure. Thanks for sharing.",
    "likes": 1,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "It would be useful to mention the sound output also",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi, which diode do you think is best at around $300?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "been trying figure out software for it. about to break my computer over my head",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I love all of your videos.  They are so very informative.  Have you got any info or experience with the  ATEZR P20 PLUS 20 watt laser?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I need to laser engrave a piece that is 15x15 inches large.  Will it fit inside the gweikecloud? My engrave area on that is definitely within the work area specs, but I cannot find definitive info on what size material will fit inside the machine.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Hallo, thank you for your video. What laser can you recommend me for starting A business with engraving ultrasound pictures to gold pendants please?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi Brandon came across your video and would like to know what would you suggest for a beginner at using laser.\nI create O scale dioramas and want to design and cut my own buildings.\nGreat video but still not sure which Laser cutter that I need.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi do you recommend any laser machines\n that can laser engrave tall items 7 to 8 inches tall with a wooden base etc",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Im interested in how this compares to the FS Muse Core, since their prices are so similar. This machine appears to have more going for it at a similar price point if I'm not mistaken? Espacially since its in close competition with this top of the line Glowforge machine.",
    "likes": 2,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "What size honeycomb bed would fit it? everything is cm not inches?????",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I'm looking to do string inlay.... veneer - .9mm is common, brought to final thickness witha hand tool, and inserted into a routed slot 1/32 wide by 1/16 deep and  leveled to the surface with handtools.  I sounds like cnc would be perfect.  Thoughts?",
    "likes": 0,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "4 laser diodes at 6 W each hmm that seems more like a 24 watt laser to me,, hows that work? Also the cut chart you posted is for the Atomstack X7, do you have one for the X20 or A20 Pro??",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Would this machine cleanly cut 7.5 to 14 mil Mylar for stencil making?",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "I'd like to know if it can engrave on and cut pure silver and gold(916) surfaces ?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hope we will have \nnext cooperation for the EM-Smart One 20W fiber laser review. :)",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Dang it.  I was looking at this for a while and with the $200 discount from you and the Black Friday discount I am getting this for $2650 shipped.  Could not pass that up.",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Please HELP! I was going to get the X-20 pro but no air or metal table{$1500}. I can get this with both $1100 \"ATOMSTACK A20 Pro Laser Engraver Cutter, 130w High Energy CNC Laser Engraving Machine, 20w Laser Cutter and Engraver Machine with Air Assist, Support APP, DIY Laser Engraver for Wood/Metal/Glass. What would u do?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I’m both impressed and slightly horrified at the potential/inevitable Nineteen-Eighty-Four style uses of this kind of AI tech.",
    "likes": 3,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "Do you have a contact to talk about getting a laser?  I have several questions.",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "Your Mom's House has a running gag about Garth Brooks being a serial killer.  One of their fans used AI to show what that would look like. https://youtu.be/rI5kUOT9DU4",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "Great Review, I am looking and getting my first laser and I am wonder what you would think would be the best machine for a good price to cut and engrave acrylic stands for figures and acrylic signs.  Would prefer clear or something has some transparency to it?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "How long did it take you to print the helmet? I am working on a print in a smaller size and it is giving me 30 hours. I have already set up a number of customer settings but maybe I am missing something. Any advice would be greatly appreciated. Cheers...",
    "likes": 1,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "I’m looking for an inexpensive machine that will engrave but cut a letter out of wood all the way through. Can you suggest ir Tell me if this one would do that?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "With the new Monport 40 watt laser most of you you upgraded is already there now for $657.00 including a CW3000 water cooler and the Lightburn software license.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I paid $150,000 for a Laguna DLS 3000w fiber laser. You'd be surprised at what a disappointment it is with both support, software, and performance. Actual real good lasers are a half million or more. Bystronic makes amazing 5000w fiber lasers. I've never had a problem with them",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thank you for doing these videos. \nI’m wanting to cut round circles at 1/4 mid wood. Any suggestions?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Hi could you pls go over the portrait setting in light burn. My photos are not coming out good",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What do you recommend for a portable engraver for name tag blanks?",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Is EZcad something you have to pay for, or does the machine come with a bundled deal? Is there alternatives that are cost free for the software?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "What is the depth of engraving? Will it work on say tools, and firearms?",
    "likes": 4,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "It's so cool, when we can see the TS2 laser review video🤣",
    "likes": 1,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "Just found out that omtech is dropping their own Glowforge clone soon. Or more like 1:1 copy of Gweike Cloud pro, lol. The information on the model is not exhaustive, but they don't mention any cloud-based software, just lightburn. It is wee bit cheaper than Gweike, should come with air assist (though no additional info to this) and autofocus. I am interested if it is gonna be a worthy competitor to Gweike, an exact copy, or if they even managed to make it worse than Gweike. They named it Polar.",
    "likes": 0,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "Nice breakdown. I’d love to hear your take on machines that can run a router and laser. I’m sure it’s not ideal, but could be good for those of us hobbyists short on space and money.",
    "likes": 2,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "I was able to get a K40 for $80 new.(guy did not know what it was) I would much rather have someone upgrade it for me though..",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I'm in the process of making a butcher block countertop for an island.  I'm finding that my individual boards are not all the same thickness despite going through the thickness planer.  I think the knots are not getting planed down thin enough and are causing issues.  When putting all the boards together, there are gaps that, I think, are going to be too big to fill with glue/sawdust.  Still working on this little experiment!  Thanks for sharing your video.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "I run a 20+yo Universal V 50 Laser. can't believe how well this Mahine is made Never changed the Laser, Changed 4 sets of Bearings and Drive belts in set of struts on the access Lid. Paid 65k A$ back than for a fully decked out unit rotary included and got more than10 times the money back Super reliable, super happy.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Worst part about 3D printing that I am finding is getting the right settings within the software. Machine runs fine, but the prints can vary alot depending on what settings I use. Still learning. Would love an Xtool D1 Pro next 😁",
    "likes": 2,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "you should mention you only talk about cnc routers , not cnc mills like a tormach pcnc440 or 1100mx or even a umc",
    "likes": 3,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "Do Not Buy a Monport super shady business.  Offer a Preorder discount that I jumped on.  Got my laser when they release it however I endup being charge $114 over retail and they refuse to price match their own retail price.  Its a \"price reduction is a marketing strategy\" where they overprice their preorder and drop the price on release.  As of their release price drop 4 times in 2 or 3 weeks.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I have a 5-year-old Muse.  Its been ok, but lots of troubles from time to time.  Main board just had to go back to FSL for repair.  Got it back and it's working again, but now no WIFI.  Curious why you like the RE3 software.  I really struggle with it and find LightBurn to be awesome as have my first Diode laser.  Trying to convince FSL to make the Muse compatible with LightBurn.",
    "likes": 2,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "I'm at a community college art Department and we are just starting to create a maker space. I was wondering what you would suggest as a laser cutter for our new maker space. Several suggestions would be nice since we are just starting to figure this out. At this point we don't have a set budget to work within.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Greetings from San Francisco.  Absolutely the most versatile tool is... the Hammer!",
    "likes": 1,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "What a huge pleasure for us to be one part of your R2D2! 🍻",
    "likes": 4,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "want to warn everyone about the EXTREMELY EXTREMELY poor customer service from xtool EVEN when you purchase the Xtool care! I spent $3k on the d1 pro 20w and i am returning it and taking a $700 cut in refund 1000% due to the extremely horrible customer service. 1 week reply’s to 10% of the email sent out to them! Please save your time and money and shop else where. They spend TONS of money on ads and campaigning and they SERIOUSLY need to put that into their customer care.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I’m curious to know what safety precautions you took prior to launching your balloon. We’re you required to get approval by any agency? I only ask because an airplane could have flown right into your balloon and that little metal clip could probably cause a lot of damage to an aircraft going 500mph…",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "It would be awesome if you could list sizes in metric as well. Hurts my head trying to convert this in my head on the fly. Thanks from OZ",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Looking for a laser to cut thru SST .062 thk. any suggestions. thanks",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Good reviews fun and enjoyable I WANT TO GET THEM ALL",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "have anyone made it work with Piburn 4.0 rotary? Does it use a Ruida controller? Appreciate if any1 had made it work. Thanks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I currently have the Glowforge basic.  I’ve been trying to engrave on wooden spoons and spatulas.  No matter what I do my design will not line up.  Does this laser have the capability to line up your design.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Love your videos dude. I wish Ortur offered a 20w version tho. Also, you are not pronouncing it currently. It's OR-tur, not OH-tur. Keep up the good work though.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Thanks for the awesome video. I am intending to purchase this machine as my first laser machine. So the air assist is provided but we need to purchase the compressor? Will the air assist not work without the compressor? If not, what is the compressor for? Thank you very much.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Whe you say you cut are you actually cutting or engraving it clooks like it’s engraving?",
    "likes": 0,
    "video": "Can You Carve a Pumpkin with a Laser?"
  },
  {
    "text": "How does this guy not have a million followers? His reviews are the best. Best picture, audio information. Usually is very reply friendly (maybe cause he doesnt have a million followers lol). Follow this man.",
    "likes": 6,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "G Machine is super easy to focus though. I believe it always has a height of 17mm above the surface. So just subtract material thickness from 17mm and put that in lightburn under move and hit the move button. After the cut or burn it always goes back to that 17mm. It is one more step but for $3k less I think its worth it.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Is the \"air assist\" is mandatory or that's optional, and what is it for exactly?\nI want to start a engraving company and want to buy the XTool Pro but I am new at this and I want to learn as much as possible.\nThanks for the video!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Man thank you for this video this has really been a great resource for getting me started with my cnc machine. Top quality content my dood.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I couldn't keep watching after 10 minutes in. It made my head hurt! Do you actually use the lasers ever? How about chillers for the CO2s? Sorry if you included it later but most of these people want fast solutions.... an aquarium pump in a bucket is NOT that! Especially for the bigger wattage machines!!!!!!! Is there a redemption? I guess I'll never know because I'll never click on another video of yours!  Just some advice... actually try them before you use them. PAID PROMOTIONS ARE THE WORST! Goodbye! Edited for 10 minutes in...",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Do you have a review on the XTool Laserbox Rotary vs the glowforge ?",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "It looks like price has double up since the review.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Great review! I have a question, is there a low cost engraver that can solve the air pollution problem? I think manufacturers should take this issue seriously. The fumes from the cutting process are so high that I would need to buy a huge enclosure to cover the machine, which is a considerable expense.",
    "likes": 9,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "what exactly they pay you to call the laserpecker the worlds fastes engraver?   \nyou mean in the toy category?   ;-)",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "They offer an Air Assist for the M1 now... It's $159.00 USD for the M1 version. They also offer an \"All in One\" package now that includes the M1, air assist, a preorder of their honeycomb bottom, and the stuff from the Deluxe kit..",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "What is length and width of glass tube.. info will help if in future will alternative need to replace can it be doable",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "great stuff!    how can we contact you for a direct question/ application?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "It's took  so Mach time to find this video no fish eyes Len's finally  please backup if google removed uploaded again",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Hmm.\nI'm thinking of building a larger format laser engraver/cutter but don't need industrial quality for $10k plus. \nI'll start with a cheap Diode laser source until I get everything dialed in but build it with the intention of upgrading to a CO2 source.\nshould be fun.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thank you for your amazing videos! If you could have only one 3d design software, what would it be?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "1:25 and even if you don't have a table saw you can just plane it by hand. No need to buy all kinds of powertools.\n1:55 dowels are optional. They can help against slippage while gluing, maybe even make the joints marginally stronger, but you don't actually need them.\n2:20 this is actually nonsense. If you alternate the directions you're going to get a wavy surface. You're averaging out the warping, but not stopping the warping. If you keep them all in one direction and make sure it wants to bow in an upward arch, if you then fasten the middle securely the entire rail the top rests on will stop it from warping altogether (that is, unless there's so much force the fastening doesn't hold, but you shouldn't get such moisture extremes indoors).\n40:20 you did the breadboard wrong. In the board itself you can just drill holes, but the part it slides over can only have a normal drill hole in the middle (to keep the breadboard centered). The other holes need to be elongated slots rather than just holes, so the pins going through them have room to move sideways (but not length wise obviously). Just a few millimeters, but what you've done now is basically the same as screwing the board on. This creates stress. Also, there's no need to glue it in the middle. You can, but you should glue less wide than you did. Just a bit around the centre pin.\n 4:20 yup, you need to practice planing. Especially sharpening your plane. Make it sharp, slightly round the corners, use a shallow setting, work methodically, and you won't have marks. Also, you need to check whether the sole of your plane is flat. \n\nGood on you for keeping practicing and wanting to learn!",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "If the earth is flat show the bottom of the ocean.....\n\n\n\nYeah you can't because it's not flat lol",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "CAN YOU LET ME KNOW IF YOU CAN DO STAINLESS STEEL?foz2423",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Will this cut sheet metal? I'm thinking of trying to make stencils for pcbs",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I have a 5w and looking to upgrade. Can I just switch the module to a 20w? Is it really that easy?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Absolutely stellar. You moved fast for an absolute beginning. I am some what familiar with sketchup. I see the value in switching over to fusion, and that is why I’m here. Cheers.",
    "likes": 3,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Great video! what are the dimensions of the honeycomb panel needed for the Aufero 2? Thank you!",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "What's with the weird wobbles in the image in the latter 10-15% of the video?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I’m interested in an expandable unit? Atomstack? \nNeje @10  but any 20 watt \nAlso, to work without Computer hook up.  Suggestion? Thx",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I'm interested in working with lasers. One question I wished you had addressed is consumables. Do the diodes have a limited lifespan? How about the CO2 tubes as well? I know you mentioned upgrading the diodes so I'm assuming that's a DYI  project and if your diode is 'dead' you can order a replacement. How about replacing the CO2 tube? Are there any other parts that may wear out? Thanks.",
    "likes": 5,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi and thanks for this outstanding video! Which of this lasers is capable to cut the metal ?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "HEY! I was your 1000th like!  Great video - thanks for publishing material like this.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Atomstack is comming with a fibre laser head for about 500 dollars, will you do a review on it?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "You should look into Xtool's new 1064nm IR laser. It CAN and does engrave on metals like silver, gold, titanium, stainless, etc... Crap for wood but great for jewlery.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Awesome video!\nA  level plane 360 view, great stabilization!\nI can watch this over and over!",
    "likes": 15,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "great video, but dude, get a filter for your mic or edit out your swallows. I barely could get through this video",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Hi Brandon . I sent you a message on Instagram when you have a free minute I would appreciate your reply and advice \nThanks a lot in advance",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "we are ready to order the 20 w pro machine..is there a difference in the gray machine from the red machine?   If i order an extension table, do i need to order 2 honeycomb sheets...Does the software come with the machine?  what all would you order for this machine?  Can someone please help with these questions....what is the difference between the metal risers and the wood riser blocks?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi..you might have a video of how to use EZcad for beginners....many thanks",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "This is a little off subject but I sure could use some assistance, I have a XTool D1 pro 10watt, I then purchased separately the 1064 infrared laser head. My question is can I use the power brick that came with the infrared also with the 10watt?  It’s kind of a pain switching back and forth. I’ve sent this question to XTool quite a while ago and have still not received a reply. Thanks in advance.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "This video could have been 4-7 minutes based on the worthwhile info and delete all the bull time wasting. Thanks YouTube for fast forward tapping with ease.",
    "likes": 4,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Wow, REALLY disorganized and a time waster. Glad i didn’t watch this live.",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Awesome video! Thanks so much for uploading! I have never ventured in to this world and wondered if you thought you could laser engrave wooden golf tee pegs with this? Any help greatly appreciated!!",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Would you pick the atomstack 20w over the xtool 20w when it comes to most bang for your buck?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Can one of the diode lasers like the Xtool 20w mark on polymers (like polypropylene)?\n\nOr that only the fiber (raycus style) and CO2?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Air assist and a scissor lift are easy inexpensive upgrades that can be 3D printed coupled with an aquarium air pump. K40 Whisperer doesn’t actually come with it. It’s freeware and can be downloaded, though.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "please sir am in dubai where can i get that machine",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I run a 10K Mazak laser at my job but I’ve been wanting to get a small personal one like this to do fun crafts on the side. This helped out a ton for sure!",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "8:15 Max speed for Diodes 10.000mm/s for CO2 35.000mm/s  🤣  Complete Bullshit. Cutting speed for diode 350mm/s. Even more  Bullshit.  I think you messed up mm/min with mm/s.  10.000mm/s would be 10 Meters or about 30 Feet per second in Imperial. At such speeds The mechanics would totally desintegrate itself.😉\n\nEven a cutting speed of 350mm/min is hardly possible with diodes if you dont want 10s or 100s of Passes.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "How does this compare to glowforge?? Is it more versatile?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Are the links to the test files for tile engraving still available?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "hi brandon, what is the thickest wood it will cut please?and keep up the good review,rot",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "How did I not think to use my D1 Pro to carve a pumpkin? Now I need a pumpkin.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "What about colour etching on metal/aluminium?  https://www.youtube.com/watch?v=0nxqcKUA2RU&ab_channel=ATOMSTACK",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Great video, this unit be able to make small cut shapes of metal or other material?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I\"m sorry, but this video is terrible in my opinion. When introducing a new software to people, you do NOT constantly zoom in and out and talk a mile a minute. This is another excellent example of \"just because you CAN do something, that doesn't mean you SHOULD.\" I would love for you to redo this video so people can actually learn from it.",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "$700 as of today.  i think $500 is more reasonable for a 10w laser",
    "likes": 2,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Hi, I'm trying to find the best laser cutter for Extruded Polystyrene (XPS) Rigid Foam Insulation (It's that pink very dense foam - the pink panther one). Can you recommend one for a 3-4 inch thick foam and a bed size of at least 2 X 2 ft.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "2:48 I wonder if suction make be better than blowing smoke out and about. Suction could go through filters to help clean it",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "thank you for this review. Do you think it will be possible to expand the machine to 140cm by changing the frame and belt ?\nIs there a limit to the size other than the physical size of the frame ?",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "10:00 they suggest they have a Ultra Fine 50 Watt LASER as well; and may be more...",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Can you use the x tool rotary with the Ortur LM3? Seems like it’s better than the Ortur rotary",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "like ease of use (glow forge) but at HALF the price i am willing to learn a little and will go for the \"g\" machine",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "how come there are no videos showing the XCS software with this ...its like no one wants to actually show it ..lol ..been trying to use mine with my m1 and its so confusing",
    "likes": 1,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "I wonder if a BL Touch from the 3D printing world could be added to a CO² laser.  Once calibrated and outer dimensions specified it could perfectly dial in the focal point.",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I need some help deciding on a machine - I’m completely new. I have an apparel decorating business with embroidery. \n\nI have clients asking for leather die cut patches and other engraved items such as Yeti bottles and other water bottles. \n\nI was looking at the x-tool but thinking I should be looking at something a little better??? Thoughts",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Do you have any idea how the xTool D1 pro 20w compares to the Atomstack x20 pro?  Thanks.",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Product: ATOMSTACK X7 PRO 50W Laser Engraver,  15% off\r\nLink: https://www.amazon.com/dp/B09HKHWQ9L\r\nCoupon Code: B64TMTVT\r\nCoupon Code Price: 569.99*0.85-30=454.5\r\nOriginal price: 569.99",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hi I wanted to ask I want to cut acrylic mostly just round the edges of a acrylic sheet and some rectangle cutouts which one of those would do the 17-7/8 in. x 12-7/8 in. x 6-1/8",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks  so much for your  review.  I have been having  such  hard time  deciding  what to by. I am really  interested  in making  earrings.  Do you recommend  this  for that?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Correct me if I am wrong but, compared to a CO2 laser, a diode laser doesn't use gas, so it doesn't have a limited shelf life (which affects CO2 tubes, even when they aren't used)...",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "It should cut better if you cut clockwise into the work piece.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "great video, I would like to ask you what cnc/laser would you recommend for engraving skinny tumblers and coffee mugs with handle? Looking forward to your advice.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Purchased this exact Engraver for my son  and returned, (I myself have a 60W MOPA Fiber and a 100W CO2, so..no new to laser here), if you understand the words SLOW and UNDER-POWERED...you will stay away from this expensive \"toy\" no much of difference from a 10W Power (just the fact that they try to manipulate the power saying in the ads that the machine is a 130W power (but the diodes are 4x5W =20W) tells that they try to mislead the new buyers with minimum understand on how machine power and laser power works...my only guess, the machines giving to youtubers must be \"special ones\" given for free in exchange of a good word. Save yourself from a mistake",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "being tied to glowforge to run the machine gets a big, \" NO THANK YOU \" from me",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "There are a couple ways to get a stable focus, either eyeballing it or drawing lines on an inclined plane (too much to go in to here--search Youtube).  But once you find the height, measure it with calipers.  Then make a block that height--in my case, I 3D printed a simple rectangular block, was able to get within 0.05mm of the desired height, I think.  Then, if you want to etch, place your block on top of the etching surface, and let the laser module rest on the block while tightening.  If you want to burn, set your block on the empty honeycomb (or whatever sacrificial surface), and let the module rest on the block while tightening--remove the block and insert your material to burn.  This puts the focal length at the bottom of the material.  Note, this only works for up to a few millimeters of material.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "In 1947, a couple of aliens flew to Earth in a silver saucer-shaped craft. After closely observing mankind, they shit themselves laughing and crashed into the desert in Roswell, New Mexico. The US Army found the shit covered craft, conducted an investigation, deducted what happened and out of embarressment told the public it was a weather balloon. ,",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "you state they increase the size to 20mm  but you fail to make it clear that its probably that it moves 20mm in one revolution vs 8mm",
    "likes": 0,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module"
  },
  {
    "text": "Really, this vibrating clump does cost $500 ? Man, how lucky am I that I got a real milling machine for less than twice that money, Sieg X2P. No CNC but does mill steel or 1/2\" aluminium in 1 pass. The original Genmitsu 3018 for $180 ist a bargain, but $500 for nearly same construction is way too much.",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "very cool... that jet was so interested in you.  great video quaity... good job!!",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Great video!, just what i was looking for...im thinking of starting a small bussiness with this..but i was wondering of the X10 version is good enough..what do you think?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "As a fellow content creator I gotta ask... where in the world did you get those awesome light bars in the background?!?! AND are you using a slider or gimbal for some of the slow pan shots? Thanks! Sam",
    "likes": 5,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Help… brand new to any of this.  We have been paying a TON to purchase engraving items for our business and hope to get this OR the S10 atomstack.  Problem is the PRICE….?? \n\nSo my questions: \n- which one S20 or S10 model is easier to use… (software/mobile options)? \n\n-does settings come in a book or are they posted somewhere? (Seems like x tool models provide this with their machines). \n\n-looking to engrave: Wine glasses, bottles, metal business cards etc….  Assuming rotary tool is purchased with the machine…. Does the 20w REALLY needed?\n\nAny and all help would be appreciated.  (My head is swimming right now)",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I picked up the atomstack X7 but mistakenly got the 40W however I did get the Extension and its 410 x 850mm  Its Huge!!  Very happy with the purchase",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "This is the best video I've seen so far trying to switch from SketchUp to Fusion. The only problem is it's really hard to follow because it goes so fast, but I found changing the playback speed to .75 solves that problem. This video has really helped me understand how the software works. Great job, and thanks for sharing your knowledge. Your videos on laser cutters are awesome too!",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Atomstack x20 Pro or xTool D1 Pro  which one do you recommend guys?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I'm considering Lars is one those c*cks*ckers that was hire just to build a big group of users and make them adicted (\"guys it will always remain freee, woooow how fantastic it is, woooow i'm so excited, woooow woooow\"). It's clear it was the plan since the beginning. Evem more - that was its fundation because they, AD, needed thousands and thousands free beta tersters. I keep saying - NO TO CLOUD SERVICES. And no to corporaitons. No to autodesk. They literally fucked all those hundrets of thousands hobbists that were using F360 just a couple of time a year, occasionally, sometimes twice a year, for their own use. This is so unfair you pricks.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "First, great video! Great presentation style, nice and concise, good info delivered well. One thing I would have loved to have heard from you is what the main differences between a diode-based machine and a co2-based machine. I know you touched on diodes are more “beginner/budget”, and more compact and portable, but what are the pros and cons of each? Who’s the audience for each platform? And why would a diode be a better fit for this type of person, be a co2? And visa versa? I get that typically a co2 machine has a bigger work area, but I can’t image that’s the only benefit of going the co2-based route. Thoughts?",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Can't watch. You move your head too much. You're turning away from the microphone.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "None of these machines should be using the word PRO in their description. They are at best a hobby toy. The Chinese machines have part replacement issues and the water cooled are a real clumsy system that takes up space. Real pro machines, the kind that will last if you are trying to make money, are well over $12,000 dollars. Diode lasers required a LOT of patience and lots of scrap material to get the engraving where you want it on the work piece.  The video is spot on but lacks in total coverage of lasers that are out there.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "If i have a 10-25000 usd budget could you name the best one for me? Idk much about these yet but I'm trying to find the best for my dad's company",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "You are having problems with aluminium because you are not using the correct type of end mill. If the mill is chocking up use an end mill with more flutes or a higher rotation speed. Also you need mills with cutting geometry specifically for soft metals like aluminium and brass on low powered machines like this. If you had tried this with brass it would have probably given even worse results because brass is so soft it tends to grab the cutter so definitely needs correct end mills with the correct geometry. Also a shorter end mill will help and repositioning the spindle higher up in the mount will produce less stresses in the z axis and gantry assemblies.",
    "likes": 10,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I bet it's fast at double to triple the price.  Think we are a full year away from these being affordable or worth it for small shop/hobby.   Time isn't a factor unless you are doing mass production.  For most, I'm betting this is such overkill it just won't come into play this year for most of us!   I rather spend money on a quality CNC  table top system.  At 3k, I can get a nice cnc setup, which has an optional laser.  ;)",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Ah,  I see.  You learned me something.  \"They\" all say 10,20, 40 watts, but reality is, it's not true.   'Effectively' 10Watts, 20watts, would be more honest.  Website has a Atomstack X20 Pro 130W !\n\nI want to see that bad boy in action!   This is a great find.   The pricing on 40w system is really good!",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Love these reviews, but would like to have your opinion on a laser that is portable and fast. I am looking for a laser to put in my craft show trailer. My main pourpose would be for engraving anodized aluminum minimalist wallets, flasks and tumblers.\nI currently have an XTool D1. I was going to use it, but it takes it around 10 minutes to do a wallet and I want this time frame brought down. So, I am thinking a fiber may be the best choice....but I also want to keep it sub-$2000 if possible. It will be powered using a gas powered generator and will be in an enclosed area (meaining out of spectator viewing range - but still well ventilated).\nThoughts?",
    "likes": 2,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Would you use this laser engraver for phone cases with custom logos?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "They loose the drag chain ? 😢Otherwise, at 8:28 Is it really the xTool test on top of ortur test? It seems you were able to cut at 20% 50mm/s just the frame before? I've been really happy with the LM2 pro(and the support), but I will wait for their 20W version.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "cable management - use some zip ties - great content #specifications matter #stonehenge",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Hello and thank you for the video.  I just bought the Xtool D1 Pro 20w.  I am entirely new to all of this.  I downloaded your test file but I still don't fully understand the laser or lightburn. Do you have a test file you used on the D1 cutting 3mm Birch?  Or is there a magical setting I don't know about in lightburn that will cover these parameters for me?  Any advice would be greatly appreciated and thank you in advance.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "All I want to do is leather hat patches and engrave tumblers...SOMEONE PLEASE HELP!! WHICH ONE??",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "questions, i just bought the plans. what are the standard size sheets you used for the ply? my D1 has a cutting area of about 20x20 (ish) and are the templates set to work on a table that size?   Also what size paint bottle are you using? ( GW or Dropper size)",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "My apologies if this was already brought up, but I am looking to buy the Gweike Pro and the comment about the Autofocus function was a curveball for me. The unit clearly states it has an Autofocus Laser head separate from the camera. You could not use the rotary engraver without an autofocus head due to the irregularity of what you are engraving. Am I missing something?\n\nThanks",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I bought this 3020 in Nov 2021 strictly for aluminum cutting. I’ve been using a competitors machine for over a decade and it works great. I was disappointed with this machine and had several issues. It will cut aluminum but not not very well. The 1/8” bit must be all the way in the shaft. (And to prevent milling the table it’s best to lower the Z axis to the lowest point and raise the spindle in the holder so the bit can’t reach the table.) But the spindle is just not rigid enough to handle the cutting, the length of the shaft allows slight flexing. And the spindle doesn’t have enough speed or torque. I found that even slowly cutting a 1” hole in 2mm aluminum with 9 passes was nail biting. It did cut the hole but was a struggle. The finished hole was a few thousands under size because the spindle rigidity was causing it to flex inward. And just drilling a 1/8” hole w the milling bit would sputter when reaching the bottom, and wallowed the hole almost every time. So to fix both issues I hack sawed the spindle holder (another problem-only a 55mm spindle fits), and mounted a $70 rotozip (600W 30K RPM) with metal strapping. Now it mills, drills, and cuts much better. Note that after less than 10 hours the 300W spindle stopped working.\n\nThe other issue I had was that most all of the USB software I tried wouldn’t run a few commands of my existing gcode. Also, it was essential that I could stop and start the gcode from any gcode line, and couldn’t do it! So, to get around those problems I abandoned the USB controller and bought a parallel stepper driver and use LinuxCNC (or Mach2).\n\nOverall it’s a nice little machine but wouldn’t recommend for aluminum unless your into mods.",
    "likes": 9,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  }
]