[
  {
    "text": "I don't see any info on your channel about Elegoo Phecda, nor does it appear to be present on your sheet.",
    "likes": 0,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "Just ordered a omtech thought the price was really fair for an 80w co2 laser I'm sorta hoping that isn't a bad thing though. Great reviews on them tho",
    "likes": 2,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "Call out to the Ikier K1 sales. You can get the 40w that steps down to 20w for fine engraving, auto focus step-down cutting, and just all around solid machine for $1,000. All of the K1 machines are great for the price and come with the autofocus auto step down cutting and air assist included. I just got the 20w machine for $699.\n\nAmazing you can get a 50w CO2 machine for less than that new xtool 40w diode machine. Still think it’s kind of bad they pulled the 40w D1 unit just to force upsells.",
    "likes": 0,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "wonder what the best deals on eye protection, and best types for different machines, or is there just ONE that protects for All?  and I wear corrective lenses, so there is also that.   thanks...",
    "likes": 3,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "What do you think of the creality 40w falcon 2? B&Hphoto has it listed as coming soon for $800.",
    "likes": 1,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "Bless the algorithm! I've finally met the one person worse with CA glue than I am! 🤣",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "What machine would you recommend for LARGE acrylic panels? I’m talking like 40” x 100”. Simple tile pattern",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "TLDR buy diode. \n\n\nI want a fiber for engraving metal tho… now that Roly made the lasermatic MK2, and working on the MK3, diode lasers are just as good as CO2. Co2 lasers are a thing of the past…",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Hi I’m just looking to get my first machine. I’ve seen the ortur lm3 15000 speed so obviously this is different to this 20000 speed. Have you reviewed this? What do you think of the lower speed? Please help",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Hello, I have the same device.  What software do you use for that?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "If you were cutting a bunch of fairly large shapes in 3mm acrylic and had to choose between this with the conveyor feed and an omtech 80W what would you pick?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Phased plasma rifle with 40 watt range\n-The Terminator",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "bro u talk to much - we want tests ! - not marketing crap !",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "that is a good clarification,  of course the sellers are going to BS the potential buyer,  and if they dont then they have my attention.    A question;  I wear eye correction, do you have a video on best options for eye protection,  (especially for glasses ) ?    an now searching for the \"right\" diode setup for me, and intend to be fully prepared in the safety department.   Thanks for the data.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Hello, there.  Love your  knowledge. \nAnd enjoy your show .\nNeed to ask you, why can't\nK40 have a 650mm by 800mm\nCutting bed \nThank you",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Sorry, a lot of people are simply not going to buy anything called laser pecker.",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Wow !!!!!!!!!!!!!!!!!!!!! slow down your speech and  take a breath.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I am looking to buy my first machine but cant decide which is better . The XTool s1 or p2 orrr, should I go all in on a larger thunder laser  ?   \nDo you have any wisdom  I can use to make a final decision? Love your content by the way. Thank You",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I'm on a tight budget.. can someone help me?? i want one ..can you help",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi Brandon! Very nice video! But still, I'm a little bit confused on what fits best for me. Maybe you're able to help me. \nWhat I'm looking for and want:\n\n- smaller sized laser\n- for engraving mostly brass (watch dials)\n- should be very percise, since i want to make clear numbers, lines whatsoever of a minimum of 0.6/0.8-ish mm size (as well as keeping a thinness)\n- schould cost 500€ at max, but rather 250€ (or less) \n\nAny recommendations? Kind regards :)",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi Brandon,\n\nAny laser you recommend for golf clubs? I am looking into getting into customizing golf clubs. Any insight would be helpful. TIA",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Thank you for a detailed report, very helpful indeed. I’m very new to the laser world, am I correct in saying that diode’s do not etch on glass.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "hi! that machine can cut 5mm mdf? what parameters do you use to cut it if it is possible? thanks a lot",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Why didn’t you mention the Glowforge Aura? That is in the $1000-$2000 range.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "My complain is the frame! This not to expand! You are limited to what you get at first and no chanche to change the sides to longer pieces. Why not to use standard extruded material?",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "It's ok ,but...\nAt higher sections the method is similar.\nFor example a 50w fiber llaser engraver from keyence ( 20-30k$) pushing out more then 1,5kw in small pulses. The average output just 50w. Finally the result is much more effective for engraving, but not usable to cutting.\nEveritime important to understand the method and physical backgrounds.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "for the z axis, cant you just mount the motor up a bit higher, especially for using those 1/4 bits? and wouldnt that also make the spindle a bit more stable as well?",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I just ordered one for my business, we'll see how it goes 💪",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Thanks for saving my tail end while laser shopping!! You helped me find EXACTLY what I needed- I have the power and capability for my business application without needing a herd of people to get it in my house!!",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "What’s best for a small business I was looking at trying to do engraved flasks or something like that",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "The constant cuts to movie clips are distracting and annoying, especially at the beginning.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Hello,\nPlease Help.\nI need laser for plastic marking.\nI am interested for a project to engrave brand names and designs on electronic product housings.\nWhat do you recommend? I don't want something very expensive, max 2000$.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Whats your take on a Vevor? They have 5, 10 & 20w with air assist. Are they even worth trying out?\nI know nothing about engravers but would like to give em a shot so i dont want to spend to much, i may end up not liking it🤔",
    "likes": 3,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "i am about to buy a lasercutter and was really interested in watching your video.\n- but i couldnt stand watching your high speed video. cutting scenes constantly. not taking time to breathe etc. \n\ni will watch another, with a slower pace.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I did some car audio in the 00s and I can sell you this 1,500W sub here for half the price of a 200W JBL. The box says so.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Your video is such a predictable cop-out with it's inflammatory click-bait title, and ultimately predictable and cop-out conclusion of \"it depends\".  Your video and thumbnail is titled in a way that says \"Glowforge is dead\" and is subsequently nothing more than a sick advertisement for a company who probably gave you this machine for free, and could likely be paying you to make this review.  It's cheap, dishonest, and disgusting that you'd bait people with trash tactics like this.  You're acting like a tabloid personality, not a legitimate maker.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Hey dude, could you recommend something to cut upto 5mm Copper or Aluminum",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "The two important things they forgot about was to make it easier to move and look less industrial - more like a machine that has a place in a craft workshop.\nThe working area is tiny for such a chunky machine.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "One important thing you didn't mention is that the conveyor is not available in Europe and the riser base for European market is slightly different. They explain that it's due to keeping it a class 1 laser (but they've been known to powder the truth in the past).\n\nThe WeCreat machine you reviewed was created to be a competitor to M1, not S1, and yes, they are both meant for the crafter segment. Sadly xTool decided to pretty much abandon M1 users with no upgrades or new features since they released air assist and riser base over a year ago.",
    "likes": 2,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "When will you get a sculpfun icube 5 watt I think I need one but I’m waiting on a review from someone",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Question what is a good laser that's not hard on the wallet to make stencils to use with my airbrush projects?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hello, to engrave and not cut the 20W model okay. Which 20W or 40W is more precise? Help me please",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Having built-in software is a blessing.\nI will just pick LaserPecker next time !\n\n\nEveryone that use MacOS will need to check on their options first-hand before buying any laser engraver. \nSince your options are very fews : LaserGRBL (free/wine), InkScape (free/require plugins) or LightBurn ( native/paid ). \n\n\nif you haven't bought Lightburn, then 30d trial.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Aliexpress does this a loooooot. \n\nI did get one that had a much greater cutting depth than the one the original one I had but it was way out of focus when I got out. I had to do a lot to it so I think they're like defective units and then they get resold without the original brand on them.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Nice laser, but will pass because they didn't include a camera for quick positioning.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Thanks Brandon, great summary! Have been considering getting a laser lately and having all this info broken down by a friend was great!",
    "likes": 6,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hangon wait since when is brass softer than aluminium????",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Could you please do a review update on the K40 since there has been some added changes to this laser",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Im in the market for my first engraver looking around $1000. Thanks for sharing your knowledge.",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Next time DONT BE a cool and lazy guy and makle a video WITHOUT a laser goggle - when the laser works....",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "$5,500 financed through ClickLease ends up being about $9K at the end of the deal.  That's crazy!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "\"So that laser diode is going to be visible light and it's just going to be nasty to look at even if you are like nowhere close to the beam itself\"\n\nThat's actually an incredibly good feature, not a bug.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Hello - great video! THX😀, does the Xtool P2 work with the Atomstack R1 Pro rotary - because of the larger diameter (up to 130mm)? Do the connections fit?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Would like to know where to get that svg file for that clockwork.. @makeorbreakshop",
    "likes": 4,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Interesting. Not surprising that site like Amazon, Temu and Alibaba etc are lying just to sell, but it is what it is.\nTo be fair: the Omtech says \"easy focus\" and not \"auto focus\". Cleverly done, but actually true... ish 😉",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "You said that you were running your S1 in Lightburn. Just received my XTool S1 40w Laser. In Lightburn the only way I can move the Laser with the Move arrows, Auto Focus, or Frame is if I have the lid closed. It is a real pain to have to open and close the lid when Framing and re-positioning the wood. When I use the S1 in Xtools Propriety XTool Creative Space software I can perform these tasks with the lid open. Is there a setting or something in Lightburn that will enable me to perform the above tasks with the lid open? Any help would be appreciated.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Yeah please take the constructive criticism\n\nI enjoy your comparisons and talking points \n\nBut the movie cuts is old and tired",
    "likes": 3,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I am actually tired of companies telling me how to use my machine. Give me the options or at least make them available for me to add on if I want it. \nThe camera isn’t even available to use with it. So that’s a big deal as they are saying the 2 point measuring is “better”. But better for who?  There are times when a camera is better. So right now it’s worse because I don’t have the option of the camera.\nI have a D1 Pro, F1 and P2 from xTool. All have there advantages and disadvantages. But like the S1 on the P2 they are telling what is important to them and not for me as the customer. Why not have a red dot laser pointer? Why not allowing me to frame?  They say camera is better, however the fish is not that accurate. The 2nd close up camera is better, but still mediocre+ at best.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Good to see an enclosure with it. Hopefully i will be able to check one out.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "was wondering where the files where for that test if you can link it to me would be great thanks for the video amazing.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I suppose a disadvantage of an integrated compressor is they tend to vibrate and attaching that to the chassis for such a relatively small machine mass wise could potentially cause accuracy issues and cause things to loosen etc?",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Thank you for your thorough review.  I was on the fence for this laser and you answered so many questions about the options and what I would need/want and the \"why's\".  I have added this laser to my cart using your link, so if I do get it, I hope you will get kickback.  Consider me subscribed so I can learn!  Thanks for all of your hard work educating us!",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I disagree with cost a fully kitted S1 is the same price as a P2 with the advantage going in the P2's favor with the fact that its a CO2 that can cut most things. I don't see where the S1 fits in the grand scheme of things at the price point its at. I see it more as a gensis laser, a combination of all the things the D1 should have been. I'll be putting my money on a Thunder Bolt and skipping this one at its price point",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "After all the \"fun\" I had setting up a sculpfun camera on my Falcon 2 - 40 watt, I am not sure it was a huge advantage, and it was a major pain to get even close to workable.\n It will be nice to see the differences once the S1 I ordered arrives. I have a feeling that the 2 coordinate alignment system will be my preferred method... though being able to drop shapes randomly and have it do what the P2 could do would be nice.  Looking forward to joining the S1 family... just 3 more days!",
    "likes": 3,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "for 2200 bucks + the few hundred bucks per accessory you're better off getting a CO2 laser at that point that would have all that included and could cut clear acrylic  and includes air assist.  What is the draw here over a CO2?",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Hi, I am considering the Xtool S1. What I would like to know is the engraving quality in detail of the Xtool S1. Does it depend on the power, is the power of the laser adjustable (f.i.10 W, 20 W) or is it fixed at 40 W?\nWhat would you advise?\nAnd for thicker products and the rotary module, can one use it f.i. with extra feet to make the laser base higher?\nThanks in advance for your extensive reply!",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Please do a demonstration on a full wrap 40 oz tumbler",
    "likes": 5,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "It terrifies me a bit not having an enclosure. What happens if it passes over something reflective? Perhaps most materials are not to those wavelengths. It isn't something I have researched.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Nooooo! Do you mean that stuff made in China is INCORRECTLY specified and that the specification where it is INCORRECT is ALWAYS a HIGHER specification, indicating that it is not random error, but DELIBERATE error.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I struggle without a camera and stopped doing laser work only 3d printing then the we creat came out and I bought it along with the s1 and honestly I’m a little worried I’ll end up selling the s1…. Really wish it had a camera or atleast a way to add one ….. maybe I should have just not gotten the we creat or s1 and just got the p2….. would love some advice in a video on how to to off shape items with the s1 like coaster and triangle diamond objects and what not cause seems like square stuff be easy that’s about it",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I'll buy this without hesitation if they mentioned if they were working on more powerful laser(60W, 80W) modules that are also swappable with this system.",
    "likes": 4,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I wonder what is the new laser that's coming up in the same segment...",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Why do they use Green laser shield, but everyone buys orange glasses? Is the green really safe? Do you have an understanding of this subject? Thanks.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "That laser gave me a Semi. Cry I bought a falcon 2 last year.",
    "likes": 3,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I know in a year or so they'll be twice the capability for half the price ... If anybody has bought one now, and want to cut some parts for me, for fun and (maybe) profit, let me know! 1/8\" plywood or whatever you have...",
    "likes": 1,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "Just bought an Ikier 48w. Building my own enclosure for it from MDF. You'll need to wear glasses around the laser either way. That lid is not enough safety when dealing with Diodes.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "One thing the camera helps with that the positioning will not help with is when I take a piece of wood that has already had a large piece cut out of it, to cut small things like earrings and such. Since it will only show the full size of the initial board and not where things are already cut out, it will not work for this. I use this a lot so this is a no starter for me. But still very impressive machine.",
    "likes": 2,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I feel like a provided enclosure is somewhat overrated. The only benefit versus making a basic one yourself is the auto shutoff if you have kids running around or something, but that can also be added to a homemade enclosure also without much trouble. \nSeems a bit sus that xTool pulled the 40w D1. Seems like they're trying to push people into buying this new unit. It would also be nice if they offered the ability to step down the 40w laser to 20w for finer engraving like other laser diode makers are doing, but it seems like they're more interested in getting their customers to buy an entirely different laser module... another upsell. \nWhat would be nice is to see a comparison of this unit to your favorite budget CO2 laser. It feels like this is getting expensive enough that it would be easy to jump to a goob budget friendly CO2 instead.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "no camera = no go for me 🤭appreciate your reviews!",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I have a Xtool D1 and that has been a great machine but since purchasing the Roly Lasermatic 10 I'm sold on fully enclosed machines.  I have also got use to using the camera for placement of art work.  Although alignment has been a on going issue as it usually takes a sacrificial piece to fine tune the placement before starting customer work.  WeCreat machine sure looks nice!",
    "likes": 2,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I would like to know if Europe will get the feedthrough option. Its not on the website currently",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great review!   Thank you!  How does focusing and 3D probing for uneven pieces work when using Lightburn? Or do you need to switch to LCS for those projects?",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I have a M1 and even though its fully enclosed it still does bleed light. Caught myself a few times with goggles where i saw a blue flash in the corner of my eye when i was turning to walk to my laser. \nHonestly will probably upgrade to this, just for better safety but need to save up first the m1 already broke the bank and honestly dont feel as safe with it any more\n\nI do really like the camera on the M1 however and its useful for auto focus and potitioning the work piece and designs as i have my pc wirelessly connected in another room. \nHaving to manually measure and probe when i want to get in a specific spot seems like a downside but ill take better safety to be honest.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great review as always Brandon, I am always amazed by your production value and editing skills. You definitely have inspired me a lot with my own channel.",
    "likes": 5,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great video man.  I have a question for ya.  Will you ever do a test/review of the Ikier K1 pro max 48/24 w?  I need a 3rd machine for odds and ends and have yet to find a decent review.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great video its really cool to see how laser companies keep raising the bar on what diode lasers cad do.",
    "likes": 3,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I don’t use camera yet, and I dislike having to move from Lighburn with my Atzr, so the main feature for me is to be able to grab the laser head and move it.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Hey. Have you really tested Lightburn well? I do not have it yet. I am curious how well everything will run with Lightburn. But the S1 is really a very great machine. I love the S1.",
    "likes": 2,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "What do you do with all these machines after the reviews?",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "90W Co2 Laser effect..Can cut 15mm of wood at most! Hey 3:08, what was that cut on, I love charts. that's a great one.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Im confused by the mislabeled tests and references. What is the cutting ability of the actual LU2-2?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Hi, I want to laser engrave swiss watches. I want perfection. Can you recommend me a laser.",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "What’s best for engraving serial numbers on powder coated aluminum?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Thanks for the info. I'm considering building my own laser engraver/cuttter. I want it to be able to cut up to 1/4 inch plywood and maybe 1/8 inch acrylic. Would a 40W diode laser with a 5.5W optical output do that in 1 - 2 passes or would I need to go up to 80W or something else? I have more time than money so speed isn't as big a factor. The mechanical  portion is the least cost and problem. I have a machining background as well as machine tools to build the mechanics. The most difficult part for me is choosing a decent module that won't hurt the bank to much.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I find it crazy that people buy into the unshielded lasers expecting anything good to come of it. The only laser cutter/engraver I have experience with was a massive unit with full shielding and multiple warning stickers about the dangers of laser radiation. These unshielded units are either not powerful enough to do what they advertise, or they are dangerously leaking radiation into your surroundings and you should probably discontinue using it. Generally, a laser above 5mw is enough to cause eye damage if directly shone into your eyes, and lasers above around the 250mw range can cause temporary eye damage indirectly in large exposure. Above 500mw, the damage is permanant. \n\nThese units are often claiming their lasers are \"40W\", which is 80 times the limit for permanent eye damage. This makes the lasers about 9 times more dangerous to handle for the end user. At this level, indirectly viewing the beam or the landing point of the beam will damage your eyes, likely permanantly. The wave length of the laser doesn't change much about the danger to your eye sight, as even undetectable in the UV and IR wave lengths will blind you. Non-visable-light-based lasers (say that 5 times fast) are often more dangerous as you don't even have any reflexes to mitigate the damage. Visable light lasers will cause your eye to reflexively close, which limits the exposure time and chance of blindness. IR and UV wavelengths don't trigger this response, so you won't know anything is wrong until your eye starts hurting which means the exposure time is already exceeding three times the normal amount for visable light, if not more so. Don't cheap out on laser tech, it's dangerous.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "It says on their website it cuts clear acrylic. Is that right? Because I thought that was gonna be the game changer you mentioned. Everything else screams knock off of the M1 with higher laser capability. But almost identical. That said, if it will cut clear acrylic, take my money.",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Yes... and also...  laser cutting smells really bad..  even with strong filtering...",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Use a shorter bit to prevent the bending on aluminium",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "@makeorbreakshop Thank you for such an informative video but could you please touch on fibre lasers that actually cut metal like brass 1-2mm , preferably desktop. Thanks 🙏",
    "likes": 2,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hello! Would you know if Omtech has a trade-in/buy back program? For people who wants to buy a smaller OMtech machine but eventually want to upgrade?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Of all the machines you’ve tested compared to the gf pro as a beginner what machine would you go with?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "6:04 that is not where the 2 dots come out of... I had to say it😅",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "I have a Ortur laser. It is pretty good for hobby use.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I want to engrave petg prints. (for text) Can I still get one of those cheap ripoffs? Or will that only lead to disappointment?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I'm relieved to hear the software is local and not cloud based.",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "I've had the xTool 40w for 6 months now and there is now a build up of crud on the module fan, with the lower wattage modules you can clean/replace the internal module fan but with the 40w, according to xTool themselves, the 40w is an enclosed unit so you cannot access the fan, clean or replace it.  Since you have had the 40w for a while now what is your experience of build up on the fan, has anyone else experienced problems.  XTool have not provided a solution but have offered to replace the module under warranty but that will only put off the issue for another few months.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Apples to apples, I can see how the Thunder Bolt wins compared to the XTool P2. For $900 more however, the P2 comes with a rotary add-on, conveyer feeder, riser, and air purifier. Thunder doesn't even offer an air purifier or a conveyor feeder, and the rotary tool is $1400 more. With that in mind, does the Bolt still win?",
    "likes": 6,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I want this, but from xtool :D\nCan this only be used with their own software?",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "*I've known for ages that Thunder Bolt was by far the best there is out there. No comparison. Thunder Bolt is the Tesla of Laser machine. The reason for this is Thunder Bolt, like Tesla, cares very deeply about its customers by not only giving them the best bang for their money, with a top-notch machine that has gone through super rigid testing and quality control testing, and, their customer service is second to none. Whereas the competition cares more about making money first, then second, helping their customer afterward. Those companies have their priorities messed up.*",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "You missed the test to see which did the best job of etching onto a curved surface, either concave or convex. When you exclude a key feature of a competitive machine (P2) it's not a valid value comparison.",
    "likes": 3,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Where can I get that speed chart print out thing? (11:54)",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "These are just rebranded china machines nothing more",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Would the guy be able to cut felt for embroidery (are there color limitations?)",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "so it seriously comes in last place for cutting? the slowforge is faster? i was told that the 30watt rf cuts the same as a 60 glass.. that is not the case? is it faster than a 40watt  diode? haha",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Thanks for your videos! They are some of the best I've watched. Your ability to present info is excellent. So if I'm understanding correctly, no diode laser will ever work on clear acrylic? I",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I am not giving you my email address just to view a webpage, especially since you get paid via affiliate promotions anyway.\n\nPlease remove the email requirement to view your laser comparison chart.",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "In your opinion, what is the best budget engraving machine for laser engraving golf clubs? I build all my own golf clubs and want to start diving into engraving, hand stamping and paint fill. The hand stamping and paint are very easy. The engraving, after doing research, is much more difficult to find the right machine. Your feedback would be VERY helpful!",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I see now the OMTech K40 comes with the Lightburn compatible board, air assist, and a mA meter built in.  They are not $599.00  I think that is still a good price with all the built in \"upgrades\".  Thinking of getting one in a couple of weeks.  Would really like to have a cabinet model 60w or 80w laser, but it's just not in the cards right now.  Are you still loving your K40, and how is it holding up?  Thanks for the video...",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Dumb question, what you should say is who they paid big bucks to for the design.",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "uhhmm..  It looked like you were using geenish (likely welding-based) protective glasses for a laser that's around 450nm..\nIf that's right, then ur a bit wrong..  and you want orangey ones..   It's not LPF / HPF ..  all the glasses are band-pass (or band-stop) filters.\nI recall finding tables online, it might be worth some reflection.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Virtually every company which sells you anything is lying to you.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I just recently found your channel.  I’ve been woodworking for a couple years.  I’m looking to expand my capabilities with a laser engraver.  If possible, would you give me recommendations.  I’m only looking to predominantly cut wood up to 1/4”.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "100% we can confirm this is the best machine for the money!",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I think you missed a critical category - maintenance.  How easy is it to keep the machines in focus and the mirrors aligned. Along with the availability of parts should you need a replacement lens, or mirror or any other part for the machine.  Would love to see you add that in a supplementary video.",
    "likes": 20,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Lol that marketing video. You would think they sell those lasers for clubs and festivals.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Please spare the endless filler clips. They are neither funny nor useful",
    "likes": 2,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I wonder what the BBB would have to say about these adds",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I've read that you CAN laser leather with fiber. That true now?  Also -- can it cut thru leather to slice out pieces for wallet assembling? i want a machine that can do both leather and metal.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I want to cut glass for stained glass project, are their any viable options for that yet?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Glowforge was designed with a time horizon failure point - they glue the heavy glass top door to the metal hinge, which WILL fail at some point and brick your machine. They are also not trustworthy when it comes to their marketing and software. I advise anyone considering a laser to avoid from first hand, day one experience.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "That looks like one of those from china for a few k",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Great video man! Thank you for the really explaining things they way they should be. Can you recommed a laser cutter that would be cost effective, safe and do good work for me if I'm only going to be doing wooden and metal candle lids? Thanks in advance for any help you can give me with this.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I was laser engraving all the wood products in Explorer Vans back in the early 90's.   Things have come a long way since then.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Oh my god please nobody use a table saw like the clip at 8:57 unless you like injuries and flying wood",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "This machine is not \"fast\".  1000 mm/s is just under 40 in/sec.  Epilog, for example, has been making lasers that can engrave at 75ips for 15 years.  You can easily snag one used in good condition for $5k or less, often with a 40-50W tube.  Obviously we're comparing new to used and there are some software features the used Epilog won't have (camera).  But overall, I don't get why anyone would buy this when you can get a much better machine at the same price.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Great video! How strong of a laser do i need for metal engraving?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Wait a minute as I thought Thunder Laser engrave Metals? I tried to decide which laser machine I should start out either Thunder laser, Epilog and now I don't know because I tried to spend one time on the right machine, so there I don't have to turn around to buy another machine to expand, because in the first place that the machine was either too small to start with or not able handle. I am new to this and tired of searching as I am ready to start now, which I am financially good.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "at 9:55 you show the laser cutting sample. my understanding is it was only able to cut the wood at 80% and 90% power at 100 mm/s? 3mm basswood? This is weird as I cut .110 inch mdf at 100% power and 150 mm/s.\n\nI'm currently using a glowforge pro and I'd like to swap to something that cuts wood faster (I'm mainly cutting vs engraving). Its for my classroom so needs to fit as a desktop unit and I was lookign at the p2 or the flux hexa\n\nMy main interest is getting a machine that can cut ~1/8 mdf faster and it is hard to get a comparison of cutting speeds (we do alot of layered designs). I was hoping the p2 or flux hexa or other desktop style co2 lasers would be significantly faster than the glowforge pro if anyone can point to evidence for that I would appreciate, thank you.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I was hoping this was going to be a build your own laser for a fraction of the price, kind of video.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "This randomly showed up on my feed and I never knew I needed this hobby",
    "likes": 3,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I’m wanting to get my first laser engraver and cutter. I am very interested in the xtool d1 20w as my first laser based on you reviews. Do you feel this is a good option for my first laser? It fits my budget and I’m not looking to do a business with it. Thanks and keep up the great videos.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Ask a daft question, can you use this to make log cabins by moving the long pieces along 4.8 meters by 65mm thickness,  95mm wide",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "This video's background music isn't loud enough nor annoying enough.  But still a good effort.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "In the pro category, you missed Universal Laser Systems and Kern Laser.  Universal is similar to Trotec and Epilog.  Kern makes large systems that can do tombstones and other really large objects. Aand in the high end are six figures.\n\nI have a mid-sized Epilog, and I love it.  Metal tube with long lifespan that can be recharged, holds its power level for a long time, air cooled, and built in the USA.  Glass tubes are fine for a hobby, but if you want to get serious, look for a metal tube laser, also called an RF tube because it uses RF to produce the laser. It will outlast any import.  Not just the tube, but the entire unit.",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Why compare with glowforge pro when the Plus is $2k cheaper and the main feature of the pro you didn’t even give glowforge credit for - pass through. Bolt got 3 points for a 20x12 printbed and you gave glowforge 1 point for a 19.5x11 printbed???  Pro actually has a 11.5xInfinity printbed. If you’re going to knock the Glowforge on price for the Pro, at least give them credit where credit is due.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "3:00 Yes it is true....You CAN compare them....They're way off BUT you CAN compare them....\nSemantics....",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "1:40 Like I said....The title/header says it all....",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I want to get a laser but dont know what to go with. I know that for now i dont want a diode laser cause of living situation. I am torn between polar and the g cloud. Would like to get thoughts?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "You used to be above to buy a cheap 40w co2 laser for a few hundred, and a 90w with a 600 x 900mm work area for not much over £1000. Wish I'd bought one then, but I was concentrating on cnc machining at the time.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Rolymatics and the new xtool s1 are also alternatives that (if I’m not mistaken) also solve all these issues",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "That Tik Tok style zoom in and out... ugh. You don't need to overproduce your videos. The topic and your skill at presenting is more than enough.  :)",
    "likes": 3,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "You left out a couple of hugely important categories... 1.  \"Can you buy parts?\"  \n\nAt least one of those machines will not sell you parts, when your tube gets weak you have to ship it back to the manufacturer and they give you a coupon for a discount on a supposed \"Refurbished\" machine.   So to replace your tube cost you a few thousand dollars, or a bearing, or any other part you can't get from somewhere else.\n\n2. One thing I that wasn't clear in the \"Connectivity\" section, which machines force you to be connected to their cloud before they let you use it?  That is a HUGE deal breaker for me.  If the internet, or your router, or their server, is down so is your laser???  Not going to happen.  \n\nIf a company has that much control over whether or not you can use your machine that will eventually come around to screw you, guaranteed.  At some point that company is going to want you to pay for it's cloud, meaning a new monthly subscription service.  At any time that company could go out of business making your laser a super expensive paper weight.  Look at how many Youtube vids are out there highlighting how their projects were delayed, or completely ruined because Adobe's servers crashed so Premier locked up.  \n\nBoth of these issues make a huge difference in which lasers are usable/affordable.",
    "likes": 8,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "5K for a machine that uses Vwheels for motion?  That's bogus.  Even Omtech Polar / Gweike Cloud have proper linear guides.",
    "likes": 7,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "If you look closer is says coming soon uner the lightburn logo.  I missed that the first time",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Imagine trying to build high power heldheld lasers about 8-10 years ago....  Before we even had a green diode!  They've always lied.  It's part of why I stopped.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "compare dc power supplies from the US and China. An American two watt power supply is the size of a red brick and has 16 gauge output wires. The Chinese 2 watt power supply is the size of an ice cube and has 30 gauge wires\n\ncompare ac motors from the US and China. An American 1 hp motor is a load for a guy who is called Lurch and Worf and Sasquatch by strangers. you wear steel toed boots when you have to lift it. A Chinese 1 hp motor can be handled by a 12 year old.\n\nI wear 10 1/2 EE Red wings. I wear 11 Chinese boots. I can buy Red Wings through the mail. I buy Chinese footwear in a shoe store.\n\nChinese amps are not American amps. Chinese watts are not American watts. ergo, Chinese facts are not American facts. Adjust expectations accordingly.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I’m new to the channel, was pretty interested, but after the 5th cut to whatever movie meme, I quit watching to type this. Cya.",
    "likes": 25,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Side by side, this machine doesn't even come close to the LaserMATIC MK2, 10/20W, in price, size, R&D or build quality; yes I have both. You can get the 10/30W for the same price. The fact that it doesn't use Lightburn and you can't control the focus makes it a non-starter for me and for most businesses. This is the Glowforge of diode lasers for people who don't want to actually create anything themselves.  Good video as always....",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "\"I really don't get a kickback...\" Except they send you $5k machines for free... Can we dispense with the subterfuge in this space already?",
    "likes": 3,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Probably one of the best laser type overview videos Ive ever seen. I did recently buy an OMTECH 20W MOPA. Learning curve is huge, but I'm enjoying it.",
    "likes": 22,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Thank you so much for taking the time, and creating such an informative video. Always love to work.   Thanks!",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "2:59 I mean I can compare a Toyota Tacoma to a Lamborghini, doesn't mean it's a good comparison lol",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "You can safely generalize this claim to *everything* sold by the vendor named in your thumbnail, not just lasers. From the manufacturer's name to the number of items per package, nothing on that site is a guarantee.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The zoom ins and outs makes my brain hurt lol. Can't watch TikTok. You would get a thumbs up otherwise. I'd thumbs down, but that's mean so won't.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I was glad to see that you gave Glowforge a 1 star for software, but you didn't really say why.  The reason is because glowforge does not run gcode, it does not and cannot accept gcode, so it's impossible for any software to interface with it.  Everything has to go through their website.  Also you have to pay a monthly fee to do anything but the very basics with their software.  If you want to cut a square, for example, through their software, that is considered a premium feature and you have to pay for that feature.\n\nBut glowforge does do passthrough nicely.\nAlso glowforge has some nice features that you've missed.  For example it detects if you cut anything that will create poison gas that will kill you.  An absolute must if you're going to put this in a classroom where a kid might be vinyl in the machine. That feature alone would make the glowforge the only option for many IMHO.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Your forgot to mention the Roly LaserMatic 10 that comes in a full enclosure with exhaust, air assist, and rotary.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Very nice, it's a big shame it's only 20W, it should of been at least 30W like the new Roly.",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "I find that engraving at high speeds works great if you just need to mark a light pattern that you're going to cut out by hand. When it doesn't need to be detailed or dark. I did it for a table I was making. Did the pattern with my laser at max speed and low dpi, then carved out the pattern by hand so I could fill with different colors of epoxy resin. Made a round 18\" table with a gold and copper color tree of life.",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Pass through? This wasn’t touched on and I think is important for many people",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I hear you. I bought the 10w upgrade for snap maker 2.0, and I a, soooooo disappointed. It won’t even cut any type of metal. I was hoping I could cut some thin sheet metal. Nope. Only engrave. What’s the worst joke is that even though their website says it will engrave on glass and metal, the software has zero settings for this. So, which one is telling the truth? Why different? Annoying. Now they are hawking a 40w laser upgrade. Again, I call b.s. cause it will not cut metal either",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Wondering why wasn't the Aeon Mira 7 or 9 in this competition? I would love to see a comparison between the both Bolt and the Mira models.",
    "likes": 2,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I was excited to hear of the Bolt coming during one of the webinars and I held off getting a laser until it came out. Unfortunately it is just a bit too tall for my application and the price was a little out of my arena for a first machine. I went with the Polar for now as the price was only $2500 when I bought it. Maybe if I can get to a point where I can build my shop differently I can look at it again.",
    "likes": 4,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "M1 from xTool is full enclosure, has the same security lid, a pre calibrate camera, blade cuter and air assist as an option :)",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "As far as the speed/acceleration tradeoff, are these machines able to run circular/spiraling paths? If so, that should almost completely remove the limitation of the acceleration and the machine should be running at nearly top speed for the cut.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Does this laser work on metal or just wood¿ I purchased one and am waiting for delivery but After watching this review I'm concerned it might not be powerful enough to do what I intended.",
    "likes": 0,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module"
  },
  {
    "text": "Your 3rd grade teacher was lying to your parents when they allowed you to graduate.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "شكرا لك على هذه المعلومات القيمه\nأريد جهاز مع كافه ملحقاته مع التوصيل للعراق علمٱ أريده كي أعمل بها على الكتابه على الأسلحه",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Had a laser business which I sold some years ago and thinking of getting back into it, but I thought Trotec was Austrian.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Is there a budget machine that will engrave both metal and wood? I know nothing about laser machines right now, but want to learn. Thank You.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I would say the #1 factor beyond the price point is knowing ahead of time what you plan on doing with this, or any, laser to make money.  If you think you are going to laser some cool images on a piece of wood and ever get your money back...think again.  Every Tom, Dick, and Harry is out there trying to do the same exact thing.  The cheaper the entry level into business (and 5K is beyond cheap) the more people are going to be in your space and for that reason...you should really have an idea of how you are going to make a profit BEFORE you buy the laser.  This is way more important than the price differences between the laser.  You can come back from spending to much if you have a great idea.  You will not come back from getting a great deal on a laser if you have no idea how you are going to turn a profit.  Figure it out before you buy the laser....don't hope and pray you will just magically figure it all out after you get it.",
    "likes": 11,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "A great vid but just like the companies I feel you are understating the danger of an open enclosure a little bit. Fire is one things but a far more imminent danger from using a laser and wanting to see how it is cutting and engraving is being blinded for the rest of your life. \n\nEven a stray beam from a 5 watt laser is enough to turn your vision from stereoscopic to monoscopic and that'll happen a whole lot faster than starting a fire.",
    "likes": 11,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "You need to update the spreadsheet and add the Falcon2 please",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Would have been nice if you had tested the \"color\" engraving on stainless steel...",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "I had a fun argument a few weeks back with a clown on Facebook who claimed his tiny 10w diode could cut though 3/4\" ply like butter lol",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "i once saw these guys at a craft fair with like 5 of these open diode laser engravers doing like custom coasters or something. there was no shield or light block or anything there were kids staring at these lasers with no eye protection from like a foot away. thats super dangerous right? i dont know how they were approved by the craft fair",
    "likes": 3,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Thanks for the tutorial,\nI have just made my first engraving of a bas relief following the method explained in your video",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Hard to follow with the changes to Fusion 360.  Got lost at 12:40",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "good video,.though some the feature is available on LaserMatic by rolyautomation",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "It does check a lot of my requirement, but I must admit, I would like to have more information before buying it. How the rotary clamps, how the bed looks like, what are the specs of the exhaust port(size and does it include a fan?), I see it is compatible with lightburn, but what does work with it, how burned are wood pieces when being cut with the air-assist. Does the auto-z-adjust allow to move when cutting objects. How confident are we to have the company living long enough to support the warranty\n\nAlso, there is almost no pictures of the product available on their website :(",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Thank you for the review. Do you think this would cut 3/5oz leather? Thanks",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Thunders are so solid and amazing lasers and incredible to see them come out with the Bolt but pricewise Polars can now be had in great condition used for $1700 or less. I rather have multiple used Polars honestly for this price. I dont engrave much however, mostly cutting. And even if i was engraving, like you said, ill get multiple diodes.",
    "likes": 5,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Liked the video, but I kept thinking shouldn't this be compared to Aeon products for price vs desktop category. I think the Thunder still would win but I think that is more of the comparison.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Laser cutters/engravers that dont come with enclosure, fume extraction and fire suppression should be illegal.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "What one would make model ship wood decks and cut out patterns?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "That's exactly what I'm looking to do minus the drill press since it's on it's own station. I'm curious as to what are the dimensions of the entire station LxWxH",
    "likes": 2,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "Another gimmick machine. Loading material a night mare to small. more parts to break down. Will not consider this machine in my list. X tool looks like the one I will be buying",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "I’m waiting for someone to release a 40 watt diode with a GloForge bed size fully enclosed with auto air assist, built in rotary, fume extraction, and camera. The Lasermatic Mk2 is closer.",
    "likes": 4,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "I have seen several reviews now on a few different channels, and really like the machine.\nNice and compact design. Good safety features an cool raising mechanism 👍",
    "likes": 2,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "I like the way this industry, as well as 3d printing, is going. More complete solutions for consumers, rather than sketchy projects for enthusiasts.",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Wait. It's Pizza Planet a real place!? I thought it was only in Toy Story.",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Would the low budget diode lasers be good enough for cutting 3mm kydex?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "So only one project from the memory card,or is there a way to choose from several stored ones ? There should have been a display,strange that has not been implemented into what seem to be a great laser......Thank you for a great review btw :-) 👍",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "What would be a good measurement for measuring laser lumans per square cm per meter?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Can you do a video with more in depth review of the desktop CO2s comparing the P2 with gweike, flux, omtech polar for people who are short on space! Love your videos!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Finally - I've been waiting for a machine like this one - not too big, not too small - just right for my projects. I've got a very small workshop and this is something I can actually fit safely. Now I've just got to save up for it. Thank you for sharing it.",
    "likes": 4,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Looks like a good option but will it be available outside the US. I'm UK based",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Sorry, Lasermatic10 V2 and Lasermatic20 beats this in every aspect that I can think of but thanks for giving us a walkthrough.",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Omtech has released an updated design of the K40 called the K40+. It has many of the features that people are looking for, including inline air assist and Lightburn capability. I couldn't find any in depth reviews on it, so went ahead and ordered one this week. But for under $600, it seems like a heck of a bargain vs. the standard upgrade path.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Looks like a really nice machine for sure.. \nI would really think about purchasing one like this is the bed size was larger.",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "does Lightburn charge for the program and then more for each different brand device?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Pretty cool machine it seems like it is really well thought out.",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "The software looks suspiciously like creative space. That's a smart move.",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Have to disagree with the cutting on the Bolt, Thunder put out a video of the Bolt cutting 3inch clear acrylic with the lens that it ships with. The wattage is lower on the RF's but the beam is more powerful its about the equivalent of a 60ish watt CO2 from what I have gathered by watching testing.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Having to physically interact with the laser after you've sent the file isn't a plus, it's a serious downside. You should be able to just set it going from your PC and crack on, just like with current gen 3D printers.",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Very timely video for me. Anxious to see your software tutorial. I want to buy my first laser cutter very soon and this pushes aside the Creality Falcon 2. Thank you!",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "If this had a 400x400 work area it would be great. I'd rather go with an XTool with a bigger work area and a home built enclosure. Enclosures are super-easy to make. You can just make a plywood box with a hinged lid. You seal it with caulk in the seams and weather stripping on the lid. And for air flow you put a PC fan on the side and a hose coming out the other side you vent to a window. To see you can add some plexiglass to the lid and/or sides. It may not look pretty but it works really well and is cheap.",
    "likes": 7,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Looks pretty nice, but the smaller work area is kind of a downer and probably a deal-breaker. It would have been nice if they could have made it on par with most open lasers for a few more dollars.",
    "likes": 2,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Not Lightburn compatible? That would be a no from me for that reason alone.",
    "likes": 21,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Looks really nice as a starter laser. Very similar to the Rolly, makes it way more fun to have kids help when you are not worried on out little eyes and fingers. Thanks for the preview excited to learn more.",
    "likes": 2,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Conflicted! Seems a nice bit of kit but do we know the company? The software looks a lot like xcs with a few additions.... Will it run on lightburn? What's the cost? Has it been officially released yet or is it another kickstarter special?\n\n\nLots more questions to come!",
    "likes": 0,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Awesome ' thanks for sharing...  I watched all of it.",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "What’s my best option for a machine to cut stainless steel keychains? I can only find larger fiber laser cutters so I was thinking maybe a small CNC but I don’t know if they can get intricate enough.",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hey Hi love your video's and great advice.  Just a question please, sorry if it has been already asked and answered.  I would love to know what you would recommend for a newbie, but good variety, for someone in Australia?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Most of them came without enclosure because were advertised to be used over things (mat, skates…) and upgradeable.\nThe very best lie brands don’t tell you is “this is cheap because it comes without basic things like endstoppers, air assist… and after you buy everything you ended investing near (or most) than a cheaper co2 (with the chiller which is the same lie for k40 models)”\nConclusion: diode for cardboard/plywood and large areas meanwhile CO2 for acrylic, faster jobs and professional usage (at similar prices on the lower tier. If you want to get serious get ready for going over 2K euros easy…)",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "what’s the difference from the other one you mentioned that was a little smaller but also a 40w laser",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I'm sort of taken back by the low \"cutting\" score.  I've seen videos of cutting 1\" thick clear polycarbonate and was suitably impressed.  Why the low cutting score?",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Good Video, learned a lot from it.  I'm looking for a Lazer engraver that I can engrave last names on 3/4\" - 1-1/4\" pieces of wood.  One that takes up to 18\" long and up to 10\" wide.  Not real expensive and on the smaller side.  I know the Glowforge Pro would do the trick.  Are there any others out there that you recommend that would work as well or better that might be cheaper?  Thanks for any advise you might have.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I know another laser named coolook creator 1,it seemed to be better,who can test?",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I did notice that. The stronger lasers are around $1500",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I have three 60 watt machines in my shop ,,,, spoiler alert, they are $22k each. \nYou get what you pay for.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Will 5 watt diode cut 1/16 th balsa 1 pass?, slow is OK.. The job,,,30 identical model plane wing ribs",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "It boils down to common sense & reading comprehension 🤦‍♀️ that we lack in society nowadays",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "What Asian truth in advertising is a lie! The only truth in Asian marketing is that they are marketing to trick you. I love in the bigger equipment they claim to have the best support, what they mean is the best support if they feel it is convenient for them and no cost to them. They know most can't do anything to hold them accountable for their statements or claims. I found its common for them to do things like if they were advertising a car they would put a 1mm gas line then claim the car travels at 180 MPH when in fact the gas travels at 180MPH down the gas line and not the car.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The thing i dont really understand is if i can engrave/cut round Details like a half ball into a piece of wood with a low Budget laser. Google explans only how to engrave round things not how to engrave round things out of Cubes at an example",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Why would you change shirts because you’re filming on a separate day. Wear the same shirt so there isn’t a jarring transition.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The tinted viewing windows on all of the omtech line, does it filter out the majority of the laser from making it out into the environment?",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Will a 10w diode laser cut g10 garolite sheet? Thanks for any info.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "54,000 mm/m ... or 54 M/m ... yeah what are they using a laser that can hit the moon ... and out right misrepresentation for sure",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The question i have. Are you still using this machine. Or how long did you use it. Would you buy it again.  I bought a used one 2 1/2 years ago never used it. Goi g to try it.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "The  Thunder doesn't seem to have any pass through capability like the others.",
    "likes": 3,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Im hoping you can help me make a huge decisions!   Im looking at starting a small business doing mainly photo engravings and cutting maybe at max ½\" thick wood. Im used to working a Glowforge Pro and im nervous about a steep learning curve with other printers. \nWith that said im really close to pulling the trigger on an Xtool P2 but I discovered the Thunder Laser USA Thunderbolt RF co2 laser and now I'm really torn between the two machines.  I really like that the Xtool looks a lot easier to use than the Thunder Laser and isnt as tall but i want the best machine i can get for what i need.  Quality is super important but i need to be able to use the software too.  \n\nIm really torn as this is a huge investment.  \n\nCurrently i use ImagR to process all of my photos to engrave and import them. \n\nCan you offer your insight? Thanks in advance!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I have a question. For some reason, my D1 pro 10w is not measuring correctly. For example, a 5x5mm square will be 6x7 or 7x7. Do you know why it is  doing that or how to fix it?",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "If you could answer this question 😊 What would you look for when buying a second hand diode laser?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi so I have a question about the gantries and accuracy of the stepper motors for repeatablility; if I am 'mass producing' my widget that has several processes in different steps where I have to take it away from the laser and then bring it back can I set up a jig calibrated to 'home' and will the laser 'home' to the same place every time... or are they typically not this accurate?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "These are just so expensive tho. If we\nCan get something that’s as good or better at a decent price then it’s worth it.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I used to have the hexa. It gave me headaches. Flux and personally the hexa are a F**** Nightmare. The machine looks good but it works terrible. DO NOT BUY",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "what kind of laser i need to cut metal around 2mm thickness like steel or silver ? ... from google a lot point to fiber laser but from look at video a lot people use co2 for cutting .. that confused me",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Thks & question, I want a CNC laser as a professional hobby;\r\n??Is a fiber cutting laser the bestest trade between speed, efficiency, longevity, power, ease of use, maintenance/repair, etc??\r\n   Buying a fiber laser which 1? & who from? NEW for 2023 https://www.youtube.com/watch?v=B0-uoI49uzo\r\nOh I'm a retired physicist & I might DIY\r\n   DIY 1000W Fiber Laser Cutter Part 1: Project Introduction https://www.youtube.com/watch?v=o-eVTnO0tFM&list=PLjmxgUbjr7L0_b-jpJ6s0hHq2t83OKy6s",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I need you to make a video about the skull engraving",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Your Gus Fring/Mof Gideon crossover shirt is AMAZING! I burst out laughing as soon as I saw it!",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  }
]