[
  {
    "text": "The one thing I like about this machine: The industrial quality.\nThe one thing I hate about this machine: The industrial quality.\n\nI'm still going for the P2, because some of its optional features are really interesting. But I am a hobbyist. As a commercial business I might think about this one.\n\nDoes it have a similar linear movement system as the P2? Metal wheels on rods?",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Cool helmet.  Where can we get that model?  Thank you.",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "I want the conveyor belt series up with the d1. Lol",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "That fire video probably prevented a very expensive law suit.\nThey should thany you.\nAnd they should include a WARNING IN THEIR INSTRUCTIONS",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Did some pre-purchase research and this machine (Nova 24-60) is what I went with.  So glad I did.  Excellent machine, support, and community.  Absolutely no regrets!",
    "likes": 3,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "There are a HUGE difference when it comes to power and the way Thunder Laser USA advertises the tubes provided. A 100watt Thunder has 10-20% more power than a 100watt Omtech or similar laser. As a example if you buy a 100 watt co2 laser from most manufacturers the tube has a MAXIMUM output of 100 watts but you are only recommended running them at 90% of the advertised power. Thunder Laser USA sell 100watt lasers with a usable output of 100watts. They throttle the power back from (in my case) 118 watts maximum output and this allows you to set the power to 100% in lightburn and get a true 100watt output with no risk of damage to the tube.",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "hummm... $7400 starting price... Nothing justifies such an expensive cost in term of usability and quality of outputs. What makes this laser cutter more \"industrial\" than its $3000 contenders? Not to mention that 20th-century style screen... You're right to disclose that you paid nothing for that machine even if your praises sound sometimes a bit dubious especially when you stressed a feature that's not impressive... Did you feel obliged to do so?  C'mon! We know the trick",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Sure is a nice looking machine. Adequate controller although I prefer the RDC6445 keyboard layout as more intuitive with direct functional access. At that price they couldn't include true linear bearing rails? Every Cartesian rail application I have experienced with roller bearing guides, the small bearings are a consumables over the long run.",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "I absolutely love my Thunder......zero complaints... lots of compliments",
    "likes": 7,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "What compressor did it come with? If much rather go with a straight compressor like that one vs a tank/compressor unit and all the plumbing that comes with it. Water separator and so on.",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "for that money i prefer to buy 2 omtech and i can increase the production to 200% compared to this laser😮",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Love my Thunder 51. Wish I would have gotten the 63. Takes 5 minutes to make the machines wifi capable. Mine is.",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "no way its just for air filter and not a laser filter",
    "likes": 0,
    "video": "Air Filter vs. Fire, Who wins in the shop?"
  },
  {
    "text": "We started with a Glowforge and when our production capacity exceeded that we upgraded to the NOVA 63. The thing is a BEAST. It's huge but the capacity and speed is fantastic. It more or less worked out of the box (kidding, it came in a massive and wooden shipping crate). Their support has been really good as well.",
    "likes": 4,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "I remember commenting that you should check them out ages ago. Glad you finally got one!\n\nThere's two things that I would like to note - the doors require a key to open, which is annoying. All I need is a latch. I don't understand why the doors are keyed when the main lid isn't. \n\nThe other issue is not having a guide that corresponds to the bounds of the cutting area. For example, you will see a ruler on the X and Y axis. You can push material up to it and know exactly where it is every time. Trotec and epilog both have ruler guides in some of their cutting tables.\n\nEveryone's got a different workflow though. I personally use absolute coords 98% of the time. I can add items to existing sheets just by bringing up the file.",
    "likes": 5,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "The price is too steep for me as a hobbiest, but I'm impressed by the robust choices they've made.   I think that if you've entered the small manufacturing game with a lessor unit, this brand would be the upgrade you'd strive for.",
    "likes": 3,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Always enjoy your reviews and videos. Well done as usual.",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "First and totally agree with that thunder laser. I love mine.",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Ну максимум по цвету неба он поднялся примерно на 17-19  километров, если конструкция, например :тоньше веревки, карабин пластмассовый за место металлического, он еще выиграет +5км в высоту, а так лайк 100%👍👍👍",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "You're the go-to guy online who really seems to know his stuff about laser engravers/cutters—could you do a review on the LaserPecker LX1? My wife has a flower farm and sells from a cart in front of our house and at local events. She's always needing signage. The LX1 has a module into which you can insert a chalk marker—that could be awesome for us. I also think there will be times when I want to engrave text on wood for signage. Just want to make sure I'm not missing a cheaper alternative that could do the job just as well.",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Great video with a ton of information. I am wondering if this machine or the newest model (Atomstack X30 Pro) can cut 5mm \"clean - transparency acrylic\"? Any help will be appreciated.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Hi, I'm thinking of buying the p2. One thing that bothers me, I feel like the cut isn't clean (there is charcoal cloud around the cuts). Is that the case? Thanks for the video!",
    "likes": 2,
    "video": "The curved surface ability on the xTool P2 is one "
  },
  {
    "text": "The footprint of these units is really confusing to me. It seems like 35-40% of the width here is a mostly empty box. It's fine if you have a large shop, but some of us have limited space to work with.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hello, I currently do custom leather patches on hats. I use real 3/4 oz leather, as of now I have them cut/engraved out of house. Would the 40 watt Xtool be a good one for me to use for my patches? Thanks and I enjoy watching your videos.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Fantastic video. Watched 100 fusion 360 videos and this one of only 2 that I found to help with my situation. Thank you very much.",
    "likes": 1,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Nice but irritating video. Suggestion for you - If you are trying to show someone how to do something, SLOW DOWN and EXPLAIN what it is you are doing and why. I stopped counting the number of times I had to rewind the video because you glossed over something so quick I couldn't follow it...",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "I wonder how this new machine would go with plain thick cardstock for wedding invitations???",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Just laser out a bunch of squares. Glue them together. There you go, got risers. No need to spend the extra $1k.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "A magnificent workspace!\nYouTube must pay really well!",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "I just bought a Rotary unit and it was $600... My A350 was $1200 at micro center, and the most recent sale had even lower prices... Where are you getting $2400 for a modular printer attachment? The biggest draw back is the price? Really? Do you have an example of either a better machine that does all 3 functionalities within the same volume, or 3 machines that are cheaper IN TOTAL, AND better. Gl",
    "likes": 3,
    "video": "Is this feature worth $2400?  The Snapmaker 2.0 Ro"
  },
  {
    "text": "You should try TIO2 mixed with water 1 to 3 ratio. Atomizer and it works perfectly. Nice work",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "This model is streets ahead of the regular 3018 in every aspect.",
    "likes": 3,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Have you ever used Creality Falcon2 22W engraving machine? It’s very popular recently, everyone’s evaluations are good, I’m hesitating whether to buy one, but I haven’t seen your evaluation yet, I hope you can test this machine.😄",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "How does the ventilation work\n/ show us where we would put the vent",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Wait, you need to pay Glowforge to use their machine?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Just a question. Compared to the Xtool P2 which costs $4600 how does this laser stand up as this one costs $450?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Thanks for sharing. Did you do a video of the wiring in the back? I just bought this laser and there is a black wire taped to the hose for water and it it is not connected to anything and there is no mention of what to do with this wire in the manual.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I ordered the full bundle package. Cant wait till it arrives!",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "How long would it take to do a sentence three inches long in an inch high",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Lol if they did this video again now the balloon wouldve gotten shot down by the F16s",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Great review👍🤗 but if u have 2 minutes when doing the editing, then please include metric system, so other then US can relate to all the numbers - we are not familiar with the imperial system, so we cant convert the numbers on-the-fly🙏\nPs, isn't metric the offical measuring system in the US anyway?",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "We have the Beam Air filtration unit. It does an OK job to extract fumes, but we struggle with strong smell when cutting acrylic. This seems like more of a design limitation of the Hexa, since we can see smoke seep through the sides of the lid. The Beam Air starts by itself when you start cutting. Is easy to open to change filter, and looks nice. Build quality feels a bit cheap, but ok enough. I definetly recommend extraction fumes outside, but it works fine if you can accept some smell when cutting acrylic.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Anyone who have the Hexa have any experience with smell? Our Hexa has strong odor when cutting acrylic, its almost like the fume extraction is not good enough?",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Kinda need \"ventilation\"-info , or whatever you'd call such a category, on these tabletop lasers.\nThese are, in most cases, not gonna be in some massive warehouse with industrial ventilators running all around the walls. They're gonna be on a tabletop in an office, basement, garage or whatever. What's the ventilation like out of the box? How does the inbuilt fan handle the smoke? Can you smack a tube on it, and cut MDF without worry of what leaks through the top?",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Nice planter,   but I have never seen anybody use so much glue .",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box"
  },
  {
    "text": "i need to laser cut petg what laser do i need? 1mm thick",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "personally I converted a cheap 2nd hand car radiator to do the cooling job better :p",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "If you were going to do a lot of powder coated cup engravings fiber or CO2?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "question please  as for the printer machine we know that it need for the ink   , what about the laser machine do they need for some thing like that   monthly or as need?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "please ,  what is the name of the machine that is very good for all of what you showed     thanks",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Great video. I've been working with lasers since 1992. But since my husband died I've had to catch up on the technical as no longer have staff or him. Your simple explanations are so helpful. Thanks Meg. x",
    "likes": 3,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I learned more about using F3d from this video than many F3d tutorial videos. Many things I was doing \"wrong\" or inefficiently at least. Thanks for you content I will definitely be checking out your other videos. Learned a lot about joinery too which I will use in my future models. (Example I had no idea you could use formulas or parameters, and I have watched 20+ tutorials!) Your simple explanations without being condescending or assuming the viewer knew how to use the software either was a perfect balance I had not previously experienced! Thank you!",
    "likes": 0,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "Thank you so much for making this review video!! I have been watching a lot of your video and learn about the laser cutting and engraving ! \nI am comparing XTool P2 and OMTech Polar. Do you know if we mainly using the machine in US. Which company has better after-sale customer service ?",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I am not sure how xTool and Makeblock are associated, but there was a Makeblock Laserbox 40 W CO2 machine. Perhaps that was the \"P1\" internally? :)",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I’d like to know what the replacement cost is for the tube as it is a consumable.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "getting a c&d letter for the name of a building is stupid.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Bought the Longer LK5 Pro 3d printer and it didn't work right out of the box. The Z axis would only go up but not down, wouldn't home and was doing strange things. So, I contacted Longer support to find out that my printer had a bad motherboard. Then they told me they would ship me a new motherboard and to fix it myself. I guess they got the name LONGER for it want work long but takes longer to get it fixed. I wouldn't trust anything with the brand name Longer on it. I have three other 3d printers from three different manufactures and have had no issues. Again, I wouldn't trust anything with the brand name Longer on it.",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "How would this do a cutting inch thick foam? I want to make inserts for some toolboxes to lay tools out neatly and have thought about using something like this to do it",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "In Your Experience what Fiber Laser do you think would be Best to make Challenge Coins?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Great video with excellent points. I’m building my benches first, using the same design as I want to use on the table, that way I learn from all my mistakes on the benches. I’ve seen about a dozen of these farmhouse table vids, and I’m doing the real breadboard ends and mortise & tenon leg supports. \nHow’s the Arm-R-Seal holding up on your table top?",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Thanks for the video\n And I ask if you need protective glasses with the fiber machine? I’m thinking of buying one but want to have it in my shop where customers come and go so thinking buying it with the protective cover or it’s not necessary?\nThank you in advance",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "$6300 for a 60W laser. That price needs to come down by $3000.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "You stated you have a Thunder Nova.  If I could purchase this or a used 1/yr old Thunder Nova 24/60. What would be your preference.  The Thunder would cost more for sure. My use case is engraving and cutting so far on a xTool D1 Pro 20w now.  I am concerned with the limited bed depth compared to what I have now.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "At that price, just go with a Thunder Nova 24 or Aeon Mira.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "If I am trying to cut deep foam for tools/gear storage. Would you suggest a laser or a cutting machine?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I'll admit, the features are great, but as usual, they are extremely overpriced for consumers.  Sadly, they are still using low quality laser tubes and mirrors. You are basically paying 2000$ for shipping software.  The cooling system is sub par, and being locked into their software to use the features is a gimmic.   If this company really wanted a consumer audience,  they would work with the popular sw companies to integrate the support they provide and also sell a product with better hardware.   This laser is being sent out in hopes to nab a few 1 off customers but geared at businesses that do not know better or want a mini laser farm.  Not including the software or time, an identical laser built with better quality parts would cost about 2k currently.   Yes it would not look as nice, but 3000$ extra just so you don't have to alignment your work is insane.  Also any business that would be using lasers, will definitely be concerned about time and ensure to align everything well to get the most bang for their buck.\n\nIn short... great idea, horrible price, wrong targeted market.\n\nUse better hardware and reduce the price by 50% and then you will be in the right audience and market.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "What can do copper clad PCB boards? I saw a video where someone sprays the copper with Matt black paint first, perhaps for reflection...",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What would your recommendation be for a budget cnc router for flattening and engraving hardwood up to 24 inches? Thanks!",
    "likes": 2,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I've been wanting to engrave surf boards and skateboards, is there a functional pass-through on this unit (better than the gewike or omtech)?",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Can the conveyor belt be used with the xTool D1 Pro with the new version of software coming out soon?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I liked your video. One thing I would very much like to know, what is the highest \"true power\" LASER head can the S9 safely handle (say DC current of 5 to 6 Amperes) and still use the existing controller and existing wiring with the exception of the  external power supply due to the increased current requirements? The controller PCB is is marked as rates for 12/24 volt input.",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Hoping you can help. Only have budget for 5w engraver and can’t figure out my best option out of these 3 units to be able to add accessories or upgrade later: atomstack a5 m50 pro, x tool d1 pro or sculpting s9 for my woodworking business. Watched too many reviews and I’m overloaded at this point, any help you can provide would be greatly appreciated. Thank you!",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Hi Sir wonderful explanation. I could not decide which brand is best and which one like how many watts etc better suits  me. I am starting a textile (cutting & sewing dresses) business and I need a laser cutter and engraver that better suits to my business. Can you suggest me a good one please.Thank you again for the video.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "10 years ago I was selling base model 40W lasers from Gravotech for $25k.  Amazing to see what a hobbyist can get for the money these days...",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "thank you for the review! is it possible for you to do a vid on the rotary tool with the P2 and the riser? i saw your D1 tumbler engraving video, but im curious to see how the P2 compares. im seriously considering buying this machine, mainly to engrave tumblers, but this looks crazy intimidating.",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Interesting. I was particularly intrugued by the way the base is so open. I can see that being a mod done to Polar units once they're out of warranty LOL. People are already putting their polars on risers so they can use the rotary with larger cups. So, my question for a future test - can the conveyor work with another machine?????",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Did you see the Elegoo PHECDA? I want to see your review on it.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Very nice!!! I wonder how long we have until these desktop machines go into the 100 watt range? That would be wonderful! I regularly cut 6mm baltic birch plywood with my 50w CO2 but it's quite slow.. Needless to say, but again.. awesome video Brandon! You're top shelf on this content!",
    "likes": 3,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "xTool P2 55W CO2 Laser  leaves them all in the dust!",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Hi! if you tired off playing with the machine and decide that you are not going to use it anymore could you please please donate it to my hubby. He love this machine but it is so soooo expensive. 😊",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "So can you still cut the 2x4 with faster multiple passes without fire?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Z axis functionality is awesome, but not 100% how totally useful I would be for most jobs. Seems like a great machine but at its cost, it puts it right against the bigger more power co2's, which as you said, are used more for cutting than engraving. Good review!",
    "likes": 4,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Awesome review of this laser! It seems like that xTool is on its way to become a premium laser manufacturer. One thing missing in the video in my opinion is a quick overview on the mechanical components. Are they using linear guides?",
    "likes": 8,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "14:34\n\n\"Do you need eye protection for CO2 laser?\r\nWhen working in the laser industry, the Co2 laser is one of the most potentially dangerous because of the invisible radiation it emanates. This requires a special type of eyewear protection that's essential to prevent permanent eye damage.\"",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Have you seen the Kickstarter project for the Elegoo Phecda laser? I'm considering backing it",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Can you review the muse titan? It's the biggest desktop laser on the market with an area of 48x24 with passthrough on all sides",
    "likes": 5,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I’d love to see an in depth demo of the automated Z axis in action. I grave a bowl or something more extreme than a slight incline!",
    "likes": 3,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "On your next review can you the test curved surface ability on engraving a tumbler without a rotary. It would be nice if it would engrave maybe a 2\" wide logo on a 3.5\" diameter tumbler.",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Congratulations on the new space! Also a great review, and I just ordered a xTool P2 laser.",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "It looks like the  P2 replaces the older Laserbox co2 range. They couldn't be used with lightburn, so along with the other stuff it is a decent upgrade.",
    "likes": 4,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I have been trying to find out about the pressure rollers. What thickness of wood can you put into the machine? I was thinking of making some door panels and the wood would be 24\" wide, but maybe as thick as 2\". Primary to engrave but I would probably also use it to cut some half-inch wood for some big wall art.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "What's your opinion on this? With new diodes in the 35W range, do you think we will get the same form factor with diode lasers in the next 2 years? I can imagine having 60W diode lasers in 2 years, which starts to call for very good enclosures!",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Don't understand why something like a 3d printer drops in price pretty fast but these co2 stay so expensive. Of you compare the hardware on these machines co2 is so overpriced. This machine could easily be made for under 1500$ if voron can do it so can these larger companies",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Thanks for this video (looking forward to more videos showing the P2 which I ordered for my 1st CO2 laser from a 20w Ortur LM2) I was hoping you would be more impressed tbh. Based on current experience, if you could only keep one, which would you keep between the P2, the Flux Hexa, Gweike Pro, Omtech Polar & Glowforge Pro?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Oh nice. I've been waiting for your review of this.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Thank You for this review! - I had never heard of this laser model until your review, and was really cheering on the Diode Lasers intrusion into the CO² segment for cost cutting until \nDiodes flew past the $1,000 mark and still could not seriously engrave metals.\n\nI am hoping CO² Lasers will start coming down in price as a result of Xtools' competition in the market.",
    "likes": 9,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Glad to see your review! All things considered, the P2 seems like a step up from the OMTech Polar but one thing that I think you failed to mention in the price comparison is that the Rotary for the P2 is an additional cost, whereas the rotary is included in the cost of the Polar. In your prior reviews it seems like you are pretty high on the Polar. All things considered, which of the two would you personally recommend (I know everyone's needs are different, looking for your choice personally). To add to that, if space is not a constraint, is there are full size laser in the price range of the Polar and P2 that you would recommend above the others?",
    "likes": 3,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Other desktops (like Gweike) seem to require an additional external fume extractor. Is the P2 powerful enough?",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Would you consider the Full Spectrum Titan a Desktop unit? Pretty expensive compared to these units.",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Intresting machine, don't know if I like the lock, if something catches fire I want to be able to open that lid as fast as possible",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "What do you think about the Monport 40w Lightburn-ready with CW3000 Water Cooling System? Is it similar to an upgraded OMTech K40 like you're talking about here?",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "And you can trace. Look at the software a bit closer.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "You don't have to scan the whole bed. Lol!! You can pull the Square out to the area you want to cut and then put your image in the square.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "I have a Flux Beamo and I love it. I'm eyeing the Omtech Polar, but that bed on the Hexa is drool worthy. \n\nI do have a question.  Do Glowforge owners not have to align their mirrors or change their water??",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "If you have a 20w, is it worth it to get the 40w, or should you jump to a fiber or CO2 at that point?",
    "likes": 1,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "What is your view on laser pecker portable laser?  The one that you use at a 90-degree angle",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Will Light Burn run those units...?   Also, what laser source is used on the OMtech machines?  Max, JPT, Raycus?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I am a huge fan bro! Thank you for comment earlier! P.S. I love watching your videos, top notch quality with your setup and articulation of points!",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "That official NASA t-shirt makes this review so much more brainy believable and scientific.",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "I would rather build a oversized Voron 3D printer with a laser module and add a good exhaust fan to it.\nThe lid isn’t made out of glass to block the laser wave length. (Probably 😅)",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Waiting to see your test on the xtool co2 please....😁😁",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Its most likely a polycarbonate door on that. It gets scratched easely but its opaque for the laser. Maby an acrylic door would work as well. 🤔",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Laser mechine is work on plastic and abs material too?\nWhat is MOP III? Is it ssme as laser mechine?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I love the Polar.  I've had mine about 2 weeks now and use it daily for DIY kits. Thanks for the comparison.",
    "likes": 5,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "The lid is actually poly carbon. At least most laser lids are.\n\nFor your cut tests I recommend extruded acryllic. cast is less true to width",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Great review 👍 Thanks for sharing your experience. Hello from France 😉",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Quick update: since releasing the video Flux let me know they have a Lightburn integration in the works, so keep an eye for that and I'll do an update once it's fully integrated.",
    "likes": 14,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Nice one. will you be doing a video on xTool P2: Smart Desktop 55W CO2 Laser Cutter?",
    "likes": 4,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "but can you even get a Polar???? colleague wants to but not available yet",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "While a top speed of 900mm/s sounds nice on paper, the weight of the head means that the accellerations are slow, which more often than not makes a bigger difference. The example engraving you showed wasn't nearly large enough to make use of the speed. That is, as soon as it gets to the engrave, it should already start slowing down. Now, to bypass that, there's the overscan area, which is this case is excessively large because it needs a long time to reverse that heavy head. \n\nLong story short; Top speeds are nice and all, but pretty meaningless without high accelerations to make use of it.",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Great videos, love the effort that you put into these review. I noticed that your point system didn't include the xTool P2. I assume that's because this was shot before you had the chance to really dive into the xTool P2. You gave the Polar a 4, what would you give the xTool P2?",
    "likes": 2,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Very nice to see another competitor in this market -- competition drives progress! I love the speed of this machine, the onboard controls, power bed lift, and bed size. The downside is the flimsy lid, lack of Lightburn support. BUT their website shows compatibility with other professional design software: AI, Photoshop, Autodesk, Sketchup, Solidworks, CorelDRAW. Great overview video as always Brandon.",
    "likes": 5,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "can you do a review of the muse titan? its the most powerful desktop laser at 100 watts and also has the largest desktop workspace at 48x24 which is crazy",
    "likes": 2,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "I was pumped on desktop model, working size, 60 watt all exactly what I am looking for but no Lightburn means no go from me and I suspect hundred or thousands of other potential customers out there! Thanks for the review!",
    "likes": 6,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "I cannot consider a CNC laser that does not support Lightburn or requires constant internet connectivity at this price point. It is an instant dealbreaker for me.",
    "likes": 1,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "But HEXA is so expensive bro. It's insane that price. I think Polar from Omtech or maybe P2 from XTool better desktop option for the price.",
    "likes": 4,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Decent comparisons...altho imo missing out the xTool P2 is a mistake",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Saw a glowforge up close in a shop selling it in the UK. Could not believe how small a machine the desktop plus is selling for over $6200! And the Pro selling for over  $8700 What a rip off!",
    "likes": 3,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Over 6k... yikes and no lightburn support. Hard pass",
    "likes": 18,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Did I miss the actual price of this in the video or was it never said?",
    "likes": 2,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "No Lightburn support is a non-starter for me. I guess if you're coming from glowforge then any amount of control feels \"good enough\".",
    "likes": 8,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Are you going to be covering the new Xtool equivalent?",
    "likes": 2,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "I'd fold this up in my glowforge and cut it in half 😂 job done.",
    "likes": 0,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "So,  I do alot of CNC work, and would like to augment my work with a small 10W laser for engraving.   What would you recommend as the most bang for the buck in this power level currently?  I have been looking at the Xtool D1 Pro,  or the Sculpfun S30.    Or I am definitely open to other suggestions.   Any help would be good. Thanks!",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "Looking for advice here. I need a laser cutter that can cut 1” foam (packing material) that is less than 7”x7”.  If it could also efficiently cut .118” acrylic, that would be a huge +++! The cheaper and easier to use the better.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I work with industrial grade flatbed lasers. Both fiber and c02. We can cut up to 3/4\" thick steel. Everything we cut requires assist gas such as nitrogen or oxygen. We've played around with etching and finite cuts for delicate materials but they're just not well suited to operate on such low wattage.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "1:13 The name in chinese is 金威刻 which romanises to Jīn Wēi Kè. Stick the chinese words onto Google translate to get the actual pronunciation.\n\nI suppose calling Jweike does not quite work so they went with G-Wei Ke. Without knowing the name in chinese I would have gone 'Gway Ker(like her)'. \n\nKnowing that they replaced the first word with a G, I would go with G Way Ker. The logo is also a clue G•Weike. Please let me know if anyone knows definitely",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "You are moving around the drawing way too much with your mouse and NOT explaining how you do all of the things you do.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "You only have the wood test file, what about tile ?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Nice video :). Where did you get your raw materials?",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I know this video has a bit of age on it, but it was really informative for someone looking for a first laser. I'll definitely be checking out more on your channel.",
    "likes": 2,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "How do you line up a smaller piece of material to engrave on...looks like I have it centered but then moves away",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "So if I have $2000 budget what laser engraver do you recommend?",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Any chance the k40 can do tumblers with an add on adapter for tumblers to rotate",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Surprised you've had no videos about xTools upcoming P2 machine...possible better than Gweike/Omtech???",
    "likes": 0,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "If I will just use for cardboard, do you suggest this Atomstack or ORTUR 3?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Exhausted still unfiltered the right? I still got a filter because it's just blowing out of window easily go back in another window, or neighbors or my animals could inhale that. \n\nAs I understand it when you burn abs it produces cyanide so it's more than a smell is what I've been told",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "your videos are great, I want to start a lacer business in Africa but I have no support from any company I buy from. Can you recommend a brand that is a thousand and below?.",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "Nice review, but I think they should of done the converging 2-3 red dots to focus, this listening thing is lame.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Can you use the 40W laser module on your own CNC frame?\nLinear motion system",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Hi. Are you able to print on paper, metal or jewelries with this machine? Thank you",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "how come your videos spend more time pausing than playing.  no problems elsewhere",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Should you rotate those knobs connected to stepper motors connected to their drives? I mean you’re sending electricity back through their wires/drives, right?",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Just purchased mine and it comes with duel fans so I think they are fixing the problems people talk about just gotta find a sturdy table for it and have been thinking about getting a full enclosure for it",
    "likes": 1,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "For my projects it's looking likely that I'll need a fiber laser.  I've seen some videos of fiber lasers doing a really good job of cutting carbon fiber.  Other types of lasers don't seem to be able to cut carbon fiber well.  I'm probably looking at a 50w machine, but I'm not sure if only the MOPA fiber lasers can cut carbon fiber?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I've seen some videos where the fiber lasers are able to cut carbon fibre.  I'm currently thinking about a 50w fiber raycus laser.  However, I'm also in need of some advice as the materials I'm most need to work with are aluminium and carbon fibre.  If I need a MOPA laser to cut carbon fibres that is going to mean I need a bigger budget.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Can these machines engrave tumblers? Glass mugs? Ceramic mugs? Thanks in advance 😊",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I am interested in engraving custom personalized ear tags.  I would appreciate your input as to which machine would be the best to look into.  I had a friend try her CO2 machine and she stated that it was very slow and time consuming to pump out the product.  It did a fantastic job, however, the time was a \"thumbs down\" factor for me.  Suggestions would be greatly appreciated.  Thanks.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Looking to purchase a laser to make personalized tags, it is a dual color tag.  I have a friend that used her CO2 Omtech machine and she said that it took about 5 min/tag.  I am very new to the laser world, any suggestions.  Thanks.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "So can you not engrave an uneven surface like a rock with the OmTech polar? I wasn't quite sure if i missed what you are saying about auto focus...",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Does the laser extension support the new 40W laser module?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "It's this for 500 or a 24w diode laser for 850 that can cut 16mm plywood in one pass without flames...",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "If you use smaller diameter bits will it reduce the amount of skips and chattering while cutting aluminum?",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "how do you know what kerf to use for your particular laser?",
    "likes": 0,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Hi Brian, we're eagerly anticipating your response regarding our collaboration agreement. If you could kindly update us by email, we would greatly appreciate it. Thank you!",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "Hello. How long does a laser tube last? Let's say you're producing 500 ornaments per week.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "HI. One thing I couldn't find anywhere...Can a diode laser machine cut a regular paper? or  I need special CO2 laser?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "How would you compare this laser vs the Xtool D1 pro 20W? Obviously the Xtool is more expensive, minus the air assist, so is the extra money worth it for Xtool - plus is the rotary better for xtool? thanks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "We have a laser on order.  What do you recommend for a computer?  Do I need something with a lot of ram?",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "at 5:20 you were showing some cheap honeycomb plate, not like yours by xTool. The  xTool  in the video( 19.6 x19.6)  costs -  $127.88  :)",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "hey! im trying to set up my gweike with lightburn - do I need to upgrade to the DPS license? never heard of that",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I am short on time so I just need a yes or no answer, is it worth it? The only thing I will likely use it for is helmets",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Great site! Thanks you helped me make my decision on which one to buy",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I have just purchased an LP2  (1 week ago) maybe it would be a good idea to explain a little more about it's very poor software...The app i downloaded via the playstore is a dogs breakfast....it only has 4..YES 4 fonts  which are all similar and you cannot download any more to this ridiculous closed ended app, every review i have watched so far would appear to have a different set of vectors than those i have on my app which are very limited in number and very poor choices... it can't be used with a mac unless you buy an optional dongle,  it disconnects from the machine if your screen times out while setting it up?  All the reviews i have seen keep showing a window with pre set calculations as a guide to show you what the settings should be for different materials...mine does not have any such window!  The hardware looks good but it can only excel if its software is well thought out...THIS ISN'T. it is very frustrating and to cap it all i have just tried to leave a product review on Amazon but strangely Amazon keep telling me they can't find the product i purchased new just one week ago?.. all my other purchases are still there waiting to be reviewed .I I wonder if they are getting a lot of returns.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I have a project which is going to involve making a lot of small custom designed parts made from aluminium and also carbon fiber.  One of my friends was recommending I look at diode lasers.  However these are really bad a cutting aluminium and carbon fiber is really hard.  I've seen the fiber lasers are much better for aluminium.  There is also some evidence from youtube the fiber lasers can also now cut carbon fibre.  However, I can't find many reviews using the fiber lasers to cut carbon fibre.  In short, I'm wondering if only a MOPA fiber laser can cut carbon fiber?  If you could let me know your thoughts that could make a big difference to me.  Looks like the 'Max' fiber lasers are also best avoided!",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I am sooooooo angry!  I paid $2,000 and went to build my rig to find out what you said…you have to have a different lower powered set up and indeed the 40w I bought and the $2,000 I paid did not come with a fully functioning 40w machine.  You have to have parts from an earlier purchased engraver to make this run.  I wish I had known this.  Who does business this way?  So now I have to either spend another $1,100 to buy parts I will put aside and not use or refund and lose some of my hard earned money.  Ugh!!!!!",
    "likes": 1,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Just got my Gweike C02 laser - Lightburn reads the camera, but the Gweike software does not see the camera - downloaded new driver, used suggested IP port, different USB ports and no luck.  Any suggestions out there?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "This is awesome. Can design lots of things from this",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "[Pushes glasses up] FYI, it's Industrial Automaton that makes astromechs, not automation. 🤓 Your shop logo came out great.",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "Ok... gweike cloud pro 2....or the announced xtool p2.... I have money on my Amazon account, so that will mKe the gweike a better rotation initial cost wise... thoughts?",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "I thought your video was great, the box looks awesome. I wish my honey would do but it's not his thing. I'm going to give it a go this spring. I've always loved window boxes. Dill, mint and cilantro are my main herbs.",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box"
  },
  {
    "text": "Thks & auestion;\n?Do/can laser cutters cut on the bevel/angle?  \nIf-so, one day I'll get one, cut-out lamination sheets, & bond them together much the same way a 3D printer print layers.\nOh ?what do you think?",
    "likes": 1,
    "video": "The Easiest Way to Create Graphics for Custom Sign"
  },
  {
    "text": "Which laser spot would be the smallest - 5 watt or a CO2 (like Glowforge)?",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Is that operated straight from a laptop? I have desktop 3020 and desktop died I'm looking for a laptop version  🙏",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Hi Make or Break shop, this is Lyn from ComMarker, we reached collaboration a few months ago and you said that the video review is in progress but didn't answer our email anymore, could we know what happened?",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Thank you for the information. Being very new to fusion setups, my next question may seem obvious. For the adaptive clearance cnc bit - one obviously needs to probe Z top height and X & Y outer corners (based on the stock corner chosen or box point); but for the parallel path the cnc bit is changed to a bullnose - and while one does need to probe again Z tool height again, do we also need to probe the outer corners X & Y again? .....It can get a little confusing when you consider that the silhouette cut for the adaptive clearance bit is set to \"tool outside boundary\", while the parallel path bullnose bit chosen is set to \"tool centre on boundary\". Does fusion just do the calculation for you when you go from one bit to the next \"for the x & y box point\", or does one have to probe X & Y again (in addition to Z) for each cnc bit change?",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Hi sir im from philippines,i would like to ask? What version of Aufero 2 is the best in cutting wood and acrylic materials??please advice...TIA😄😄",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Just saw some guys do wood  on a similar laser? Whats the deal?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Super CNC - cut for woodworking multi millionaire in mind!",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Why do you never respond to more than half of the comments / questions that people ask you below?  That is not very professional.  You seem very disorganized and unprepared - again not very professional.  You should have read all the instructions and become familiar with the Laser, before making this video.  Based on the way this video is done, I doubt I would purchase anything you recommend.",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "I can’t find where to add the discount code for the Gweike Cloud.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "thanks for taking the time on all these project ideas. I really enjoyed your video. I will do tags and tumblers today :)",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I used so many AI tools. As a new graphic designer my most favourite one is Blue Willow. It recently launched V2 with a brand new model upgrade. Now I got better-quality images with more aesthetic outputs",
    "likes": 1,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "How did you get your machine? Was it from China? I have ordered one 4 months ago, and have many conversations with them and still no answers as to where my order is.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hi there! Any chance you could tell me what the height of this RA2 is from the bottom side of the base to the center of the 3-jaw chuck? I think this could to be great axis for one of my other machines but am looking for this dimension to confirm fitment. Thank you!",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "My daughter has the Gweike but it's failed twice the first year, mainly the power supply. The Chinese reps have been extremely helpful and sent parts in like a week to 10 days.  I want to help her with a spare powers supply, but I haven't found one yet. If anyone knows of one, please let me know.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Do you think this will cut through thin clear  plastic, like plastic food gloves?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Idk if I should get the g machine or the omtech polar",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Nice video I wonder if it can be use to engraved guns",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Just bumping your channel with some extra comments to help out.  \nIt's fun watching your work.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Why. Do. You. \nConstantly. Pause. Between. Words? \nIt’s. Super. Annoy…ing.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "I ordered a 40 watt bundle over 7 days ago, and it still hasn't shipped. Their customer service is terrible.",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "I was trying to make my mind up xtool has 2 different packages I have been looking at, 40 watt laser  plus the 10 watt laser  or the 20 watt laser and the infrared laser kit.. not sure how much metal engraving I might do. But I dont think I would be cutting any wood thicker than 1/2 inch for project.. any recomendations ?",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "How are those cheap cnc on cutting acrylic? Preferably .25in acrylic.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "@Brandon, xtool d1 pro 40w, Longer Ray5 20w or Omtech polar 50w? if money isn't an issue!\nI am new to this and really want to get a machine, but I'm confused on what to choose.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Requesting the test file, it's a link that is supplied but when clicking goes to your site and says expired, how to get the test file (I posted this request in your last video too) 😅",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Are you aware this RF model has already been discontinued?  I ordered it last week and this week they said they’d make mine, but they have discontinued the model. Do you have any insight on this?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "after spending more than a month to get them to replace ( with shipping costs )an air purifier that died after 16 days they asked me to go around to the different places I had made disparaging comments and delete them or change them.  They did however send me two boxes of their 12 x 12 walnut boards.  I played with two and then said i will NEVER burn another of these again!  The absolute nastiest material I have ever put on my machine.  I t was like I had never quit smoking!",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "I have the 10W machine, and they told me directly that it isn't possible to install the 40W module on the 10W machine.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Good review glad I did not pull the trigger on this one, I want to use light burn.",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I'm looking to do custom firearms work. I know the 80W can do it but i dont want to get something that expensive if I don't have to",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Always good to see another maker channel growing. Way to go Brandon!",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "I was wrong about this, find out what: https://youtu.be/z-UxCy-Gg48",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Really great space Brandon! Looking forward to how you rig it all up…",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Judging by the measurements of the laser engravings DOES ATOMSTACK GIVES THE BEST DETAIL for REALLY SMALL DETAILS or SMALL LETTERS?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Totally overpriced and barely does anything more than a 20-watt. 👎\n\nEdit:\nWhat a rip-off that you have to buy the 10-watt still.",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Full enclosure is recommended for both dealing with the fumes and eye safety. They really shouldn't sell them without an enclosure. A fraction of a second of stray reflection can blind you, which makes the cost savings seem not worth it. 3:14",
    "likes": 9,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Does anyone know the nose clearance on either of the two lasers?   With wood always being worked LACK of height can be an issue",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Don’t you have to change hardware as well besides the Laser Head. Since the Laser Heads are All Different Power Ratings.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Hey, great video.  Just FYI xTool has confirmed that though they originally said the laser size of the 40w was .15x.15 it is actually .10x.15.  If you shine the laser on the way at very low power you will see that it is actually a rectangle not a square.",
    "likes": 5,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "You can reduce the power on the 20w to the 10w's. I don't know if the laser gets any finer. 🤷‍♂",
    "likes": 1,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Wait. I just sold my chop saw so I could cut 2x4s based off your last video. Crap.",
    "likes": 1,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Can this cut acrilic . I like it because I can pack it and go , the omtek  polar is heavy . So does it cut acrylic.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Very poor, rude, and uninformed customer service. Do not purchase an OMTech Laser. Falling apart (literally) and it’s going to take “three days for a technician to call you back.” Spend your money elsewhere!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thank you for taking the time to make a correction video I respect that.",
    "likes": 6,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "You think you were wrong about it?  I bought something else because of your \"i think I was wrong about it\"  thanks.  That's why You Tubers should NOT be giving advice on what they don't know just to make a few more YT dollars Damn.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Might want to add that the regular D1 laser modules, are not swappable with the Pro.  The pro laser modules have a higher pin count.",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Good stuff.  You have just about convinced me that I have what I need in my 20 watt D1 pro.  (Until I go large CO2 unit) #thunderlaser",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "I bet X-Tools this time was like: \"Can you like maybe not include the portion where we ask you, if you may not include the fireportion\"",
    "likes": 11,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Admitting you're wrong? On YouTube? You can't do that!\n\nSeriously, keep up the great stuff 👏",
    "likes": 11,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Great update. Quickly moving into easily burn-down-your-garage territory with these increasing diode powers. 🤣",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Really nice video yet again. Cant wait to see that review of the 30w atomstack.",
    "likes": 2,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Use code MAKEORBREAKSHOP50 to get 50% off your first Factor box at https://bit.ly/3DlNfcr!",
    "likes": 1,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Please Help! I Just Bought a Laser Pecker 3, I am New to Lasers and this has no Manual! How do I get Black Markings on Various Metal Types Including Zinc Alloy with Electroplated Coating? Do I need a product like \"Brilliance\"? Thanks!",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "I Just Bought a Laser Pecker 3, I am New to Lasers and this has no Manual! How do I get Black Markings on Various Metal Types Including Zinc Alloy with Electroplated Coating? Do I need a product like \"Brilliance\"? Thanks!",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Frankly if it doesn't have a pasthrough then it isn't comparable feature wise to the glowforge pro. More comparable to the plus.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Congrats on your space. Maybe you need more than 2 cameras to oversee that much space.",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "wonde if you can cut thicker wood if you wet it down , might even use a bromium solution to make the wood self extinguish",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I've been trying to find a laser engraver with an auto focus Z adjustment. I've watched a ton of your videos and they are very informative! I've heard you mention in a few of them that it is possible to get the auto focus on the Z, but the only laser I've heard you say that supports this is the Glowforge. I am not really a big fan of the glowforge due to the price and the monthly subscription... ridiculous! But I'd really appreciate it if you could point me in a the direction of an autofocusing laser! I'm wondering because one of the main products I currently produce is full of 3D contours that I think would look incredible with engravings on them.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Great video. Can the 20w etch an AR-15 lower? They are anodized aluminum.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I am impressed with BlueWillow. It completely free and the quality of art is really cool",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "Very pleasing to hear of your generosity toward your local school. However, given Glowforge's online-only pay monthly subscription model, I'm not too sure you've done them any favors.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I would never go the Glowforge route for the same reason that I have never and will never go for iPhone over Samsung or Mac over PC. Apple are monopolists. That is to say, if you buy an Apple product you are buying into a closed ecosystem that does not allow for competition, meaning that whatever you need beyond the basic product itself, i.e., accessories, software, etc., can only be purchased from Apple at whatever price Apple dictates, take it or leave it.\n\nGlowforge have obviously decided to emulate the Apple everything-in-house business model and for me their online-only obligatory subscription software model that excludes all other possibilities is a deal breaker, and that's before taking into account the fact that the product costs twice as much as the Gwieke. If I buy something, I own it _not_ it owns me.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Oh yea, I used to work for a company that did precision laser cutting, drilling, skiving, micro-vias and occasionally engraving. We had machines in the hundreds of thousands of dollars range, even a few into a million dollar range. ESI was a brand, from China I believe, that we had that did UV lasers. Another was the Excellon Cobra which had both UV and CO2 in 1 machine so you could cut/skive/drill with one and do a finish pass with the other. Or a multilayer panel with different materials like copper and dielectric. Cool stuff. Have been thinking about getting a laser engraver for some product ideas I have",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I WISH TO OWN THIS AND START A BUSINESS WITH IT BUT I DONT HAVE THE MONEY TO BUY IT.CAN YOU DONATE IT PLEASE?",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "@makeorbreakshop - great video, thanks for putting this together.  The K40 and MF1220 are looking much more attractive at this point in time.  Glowforge prices are up $1000 since you put this together.  Bummer.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Note to anyone thinking of purchasing - the 40w module and the extension are not YET compatible. The 40w requires a different power cable and they haven't made one long enough for the extension yet and will not be available for several weeks. They don't tell you this, so I am sharing here.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "What machines are coming out that could possibly be better then the polar? I’m in the market right now",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Just out of curiosity; how many CFI or PSI are you pumping out of your air compressor ?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Can I use the AF2028-80 by OMTECH to do 3D engraving?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  }
]