[
  {
    "text": "Would this be good for cutting stained glass? Or should I look into a 40W Co2 laser?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "So many videos where people get sent a machine to do a review, how does one sign up to get sent a machine?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I repair iPhones and i was wondering if this lazer is strong enough to burn the glue under the glass of the back of a broken iphone",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Would something like this work for engraving polymer pistol grips?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "On fire extinguishers. They are not all equal and applications is a factor. You should do a video on that 😉",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Could you review the beambox the smaller version with the bed size of 8.5\" x 11\"",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "What would be the best precision unit for PCB where precision and fine work are most important?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I have just purchased one of these machines and I can't get the laser beam in the tube to show or switch on. Water flow using supplied pump and distilled water are fine, although the rubber tubing supplied is crap and folds readily, with a series of clothes pegs, I have been able to press it open along full length providing no restriction to water flow. Power switches on and off to the machine okay, emergency stop working fine, temperature LCDs and Power LED working fine, as are the adjustment buttons. No damage to the box it came in or obvious damage inside, laser tube is watertight ie no cracks visible and no leakage. Set laser power to 30% following instructions in the instruction manual for mirror alignment on mirror 1, set masking tape across mirror  1 and pressed the pulse button. Result - no laser beam, and no burn on the centre of masking tape. Tried beam switched on constant, still no purple laser beam in the tube (as appears at time point 1.20 on the video) or burn on paper. I have tried increasing and decreasing power and temperatures in the tube have remained about 28 degrees C.\nMy machine does not appear to have a flow switch, having pulled the tubes both ways in the casing to their full possible extent. Is there anything else I need to do or can try other than sending it back to the supplier for a refund?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "hey 🙋🏻‍♂️ if u know please tell me if this machine can cut 3mm plywood and for what time for example 100 mm ?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "What engraver would engrave a gun handgun or rifle wooden plastic metal",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Thank you for this informative video. \nI am looking to cut kaizen foam only for tool box organization, will ortur do the trick?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Why is he rambling the whole time? And how does he have 31k followers? Video not helpful at all",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Anyone know what if any laser are good for etching tshirt designs onto cotton tshirts?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What safety glasses do you recommend for this type of laser?  Thanks!",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I would never buy a Glowforge for one simple reason, if they go under there is no way to control the unit. That is a huge risk.",
    "likes": 6,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I currently have a k40 thats semi modified. However in the future i would go with a 50 or 60w omtech",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "If I thought that I would use a laser very often I would probably go for the upgraded K40. My youngest daughter does crafting and she wants a glowforge. She said that it \nwas because it was all contained.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "That's a great breakdown!  \n\nMy shop doesn't have wifi, and I dislike being locked out of modifications, so Glowforge was already off the table before I hesitated at the price tag. \n\n I think I'm going to do a 50W, put off on doing the board/camera/chiller mods to begin with, and see if I can get the machine to pay for its own upgrades as I go.",
    "likes": 5,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Looks great! I want one but the site has what looks like disgruntled buyers. Anyone have more info? Thanks.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Can we add with all that upgrades the rotation device attachment!?",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "well done and thanks for the help with the software we can all use to help build project with, that's gold right there.",
    "likes": 0,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "they made you pay for a commercial review, lol cha ching No Sale. -snake oil sales made in America! buyer beware- \nover priced, under performing Marker 20w, £2,876.00",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "This is a great comparison video.  I upgraded a 50W Chinese blue and white to a true 60W, added the meter, exhaust, camera, Lightburn, and a bunch of other upgrades to be still cheaper than the Glowforge Basic:  https://youtu.be/DYepr90JUCg",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Of the laser cutters you have used. Have you tested exposing pre sensitized PCB? If yes, which of them have worked best? Also did you compare results of off the shelf software to proprietary?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "It is not for absolute beginners - but it is EXCELLENT, well done - exactly what I needed, bridged a stack of stuff i learned years ago and had forgotten - the parallel/coincident thing foxed me for half an hour with a constraints error but once i read the comments here no issues.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Hi, thanks for the video. Just wondering where the test file link is? Did I miss it somewhere?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I just ordered this about two hours ago!!  Been looking for \"this video\" for the last 45 minutes, had to call my sister, and she asked \"WHYYYY??  I have it in a corner collecting dust, you could have borrowed it!!\"    But this one is mine, and i won't have to give it back!!",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Im using a K40 unit for about a year, i did chance my glass tube few weeks ago and also all mirrors and now the laser work like a brand new. Im happy about it its a cheep invest and is total worth!",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I went with K40 and modded it a bunch before I even ran it. 6” exhaust fan, lightburn w/ cohesion board, upgraded nozzle with 2 gallon air assist compressor, honey comb bed w/jack, LEDs. My total cost was $1,050 USD including price of EBay k40 laser. I love it.",
    "likes": 10,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Please advise me how the Ortur Laser Master 2 Pro laser could take a photo in black stone.\n\n\nCustomers want to take photos of monuments\n\nThank you",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I didnt hear much about the speed of the glow forge in your review.  Personally, I think it is painfully slow. when I first started looking for a laser, I saw reviews just like this, and got all fired up and excited.  however, after digging deeper, checking out the specs, comparing this to others on the market, and then factoring in the total lack of actual support ( other than the community forums ), having to return the unit to even replace a tube, and for almost every other things, at. great cost - I soon realised, this was actually not a great machine for the money they are demanding for it.  It looks very nice, but, it just doesn't command the price.  \n\nthey do an excellent job of marketing, an immense job, but they they would ( in my opinion ) provide a much better product, with support if they pent less on the advertising and more into the product itself.  Once I made an initial enquiry, I was almost hounded by e-mail after e-mail after e-mail.  however when I replied with questions, their answers were always very vague, or often they would deviate from my question, paying lip service to it only, and trying to big up everything else in an attempt to negate my concerns, and convince me that despite my concern, there were so many other aspects that were simply amazing...anyway... hard pass for me im afraid\n\nI love your reviews in general, but I do have to say, I think this one was probably biased as a result of glow forge sending you the laser and air purifier etc..I know you said it wasn't, but it did sound like it.",
    "likes": 2,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Personally after starting my laser experience with an Orturn 20w diode laser with lightburn, I'm hooked on lightburn. I personally believe it to be better all around then the software you use with the Glowforge. IF the Glowforge used lightburn, I'd save my money and buy one, but lightburn is the tool that tells me it's totally worth buying and upgrading the most expensive chinese laser you/I can afford.  50 or 60 watt IMHO !  Lightburn is just too awesome to not have available.",
    "likes": 6,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I started in March with an Ortur Laser Master 2 Diode machine to dip my toes in and see if I liked laser engraving.\nLast month I had a OmTech 60w CO2 machine with 20\"x28\" build surface delivered (eBay).   Got Lightburn when I had the Ortur and was a simple process to upgrade the license to work with the Ruida controller on the 60w machine.  Makes for an amazingly capable machine with plenty of power for my current goals.\n\nI don't think there's anyway I'd be satisfied with a Glowforge.  Proprietary software, internet connection required, and could become a brick any day if the company ever shut down.\n\nNote: Ortur machine sold on Facebook Marketplace within 24 hours for about what I paid for it (of course I included all my upgrades so it was certainly more valuable than stock).",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I have 2 k40s.  One with cohesion/lightburn and 1 with stock/k40 whisperer both have done many projects but need more work area.  Working on building my own as I want close to a 12x24 work area.",
    "likes": 3,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "OMTech. I currently have the K40. Only upgrades I've done are air assist and added a chiller. I'm hesitant to do anymore upgrades because I want a more powerful/bigger machine within the next year or so! I'm thinking at least a 70W.",
    "likes": 5,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Thank you, I am in the market soon for a K40 but I really wanted to see a \"maxed out\" unit vs a commercial one. I have some electronics knowledge to do all the upgrades so I will still be going that route for now. But I do see where the money goes",
    "likes": 3,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "In my case the glowforge would be better, however if money was not a huge constraint a Thunder Nova 60 beats them both.",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "It looks like the only mid-level OmTech unit that is ready for Lightburn is the 50W. I wish the 55W with larger bed was Lightburn compatible out of the box… unless I’m missing something…?",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I think I would just go with a glowforge.   \n\nBrands have you ever thought of reviewing the Yorahome 6550 ?",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I like this format but I originally subscribed because I really appreciated how you demonstrated while you explained “laser cutting/engraving.”  A+ either way…",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Thank you! This confirmed the research that I’ve done! I’m likely just to go for a 50W unit which saves both money and time. I’m a maker so it’s not a big deal for me to do some DIY adjustments but I don’t want to do a ton. I really don’t like the WiFi locked software idea so that instantly killed the Glowforge for me. 50W is a good compromise.",
    "likes": 10,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Great video. Especially since you ended talking about the 50W. Thank you!",
    "likes": 5,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Very helpful information. I'm considering these very options. You just saved me a ton of work. Thank you!",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Ortur.  Much cheaper.  But it is just a hobby for me.",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "The k40 I purchased was sub $400, had amp gauge and a much bigger fan stock.\nK40 woodwhisper by scorchworks.\nMetal airassist (I've melted a 3d printed)\nAgree with the lenses and mirrors.\nThe other upgrades are negligible.\nFrozen 2litters into a 5gallon bucket keep the heat off the tube.",
    "likes": 14,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Question. Is there an affordable laser welder that will print names on white dental lab stone (gypson) patient diagnostic models. Thanks",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I have been looking for a budget friendly laser cutter that would be capable of cutting thin shell like Abalone. Runs about .006\" thick. Do you know of any of these laser that would be capable of that?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi would this be good to engrave the inside of a ring?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "This was my first attempt at fusion 360\nThank you soo much for making this tutorial \nYour skill level shows \nI probably rewatched parts of this video 100 times \nBut after 2 days and 8 hours total time on the program it's rendering now as we speak\nI wish you had a video of making this table on a cnc for those of us who just got a cnc as well 😅",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "It's better if it's made in the same way as a snake's joint and has a longer usable distance. 로봇팔이 뱀의 관절같은 방식으로 되어서 사용범위가 더 넓어지면 훨씬 좋을 것 같네요",
    "likes": 0,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look"
  },
  {
    "text": "nice review but for the love of heck, it's *Jimi* Hendrix",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Would this be good for engraving plastic? Like hair clipper lids? I’m trying to engrave lettering and fill it with paint and doing it by hand is a little rough",
    "likes": 6,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Long video but worth every minute of watching it...awesome it was a refresher for be I am back on track to sending by GCode to Easel too",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "What plywood do you use and where do you get it? I usually get mine off Amazon but it hasn’t been very flat, leading to more passes necessary to make it through in some areas.",
    "likes": 0,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Don’t buy a glowforge they are absolute junk. Ours showed up didn’t work",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I found this video when looking at how to model furniture specifically- I loved the pace and glossing over some of the basics; the Lars Christensen videos were excellent to find my feet with using Fusion 360. I think this was a great next step. I've found too many tutorials that are more about making a very specific part, this video sets an excellent groundwork/skillset for modelling any type of furniture. Thanks so much!",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Tip from doing laser cut RC planes : Assemble the parts and *then* apply thin CA glue. It will wick in to the joint perfectly !!",
    "likes": 5,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Nice video, well done.  I read on the Glowforge website it can engrave anodized aluminum.  Have you had success with that material?  Also, what is the max height the material can be to engrave?  THANKS, I'm a noob to all this, but fascinated by this tech.",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Nice one Brandon. Do you have a low price source for the plywood? Proofgrade is pretty dang pricey on the Glowforge site.",
    "likes": 1,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Took your furniture Fusion class. Very useful. Have a large CNC. Debating if to get a laser. What do you use for laser vs CNC?",
    "likes": 1,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "This is really nice...do you think the Ortur Laser Pro 2 could cut the 1/8\" plywood? I'm on the fence with the Ortur and this might tip me over.",
    "likes": 1,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Great video and build. I've found drawers are better than those Sortimo type of containers...those are more useful in traveling/off-site jobs. Mahalo for sharing! : )",
    "likes": 2,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Very nice job. I see you really enjoy the glowforge",
    "likes": 4,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Hey Brandon, great video!  I'm interesting in cutting 10mm felt. How much power would I need to accomplish that, and is there anything tricky about cutting felt?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Thanks …great video….I subscribed……looking forward to more.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Do you recommend this over the aeon Mira 7 ? Im able to get the M7 for only $2,000 more, but I’m still not sure because of the different shipment dates",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Please help! ALL I need a laser cutter for is to cut suede leather (colorful/dyed leather) AND acrylic for jewelry making. I don't have much money, but I don't want something that is too hard to learn.",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "I didn't see much comparison of SU vs 360. I've used sketchup for years, but since everything ends up in Revit anyway it really helps to have an Adesk app for it. I'm still not convinced that we get that we get that super fast sketchup usability from 360",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "So with that one work on a black vinyl albums old records LPS?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi, I went to try and order  this laser, but.. when I try to order the laser, it keeps asking for an apartment number. Well, I do not have an apartment number and I can not go forward with the order. I do not see any way to contact Ortur from their website. Do you have any ideas? \nThank you so much..",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "So, is this thing shipping then? I see \"estimated\" shipping June 2021 and only 6/50 sold. Indegogo and KickStarter are notorious for scammy AF business practices... Stall and stall and stall",
    "likes": 1,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Hey, I’ve been watching all your videos since I’m trying to get into very basic laser projects. Just want to make some nice looking business cards out of stainless steel. I know the laser project area doesn’t need to be huge, but also stainless steel isn’t the easiest material to work with. Don’t believe I’d need to cut through it; I’d most likely just use it to etch. Ease of use is pretty important since I’m going to be very new at this. What would be the best (budget) laser you’d recommend?",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Hi, can you help me out. iam doing research on laser.  found one manufacturer from china for a CO2,40w laser. he says it's better to take a 100w laser if I mean to engrave on the beer and vine glass. What do you think about that? is he trying just to take more money for laser or does the quality really depend on the laser power? thanks in advance",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Sounds good for a sub $300 unit.  To bad it is not $450 plus about $100 for shipping.  So we are now at 540 or so",
    "likes": 1,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "It really does seem that with laser engravers, you really do actually get what you pay for.\nEvery cost tier adds significant ease of use or completely new capabilities.\nIs a IS900 from Gravotech $20,000+ yeah. However, it is twice as fast and versatile as anything this guy has, and the software is phenomenal. Buy chinesium, get chinesium. Buy kickstarter, maybe get good hobbyist machine that will run 2-10 jobs a day. Pay double, run 100s of jobs a day.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Can you recommend laser etcher that can do both stainless steel and lamacoid?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Do U have an email or a way 4 me 2 ask other questions 2 U?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Wow, gr8 vdo on the various laser cutters. Thx 4 sharing on Utube.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Using laser safe mdf doing several passes, what is the max depth of carve engraving?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "hello nice video very useful. I wanted to ask at what distance should the laser be positioned from the workpiece? thank you",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Expect it very soon on the torrent network, just like the rest of the very expensive software millions of hobbyists use in order to learn and be able to pay for it one day.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "i want to do on a cricket bat lazer engraver the thickness would be 40mm can you please suggest any nice lazer engraving machine for my professional work. i am just starting this business",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "If I end up having to pay for Fusion 360, then I’m gonna pay for Solidworks.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Can you use this specific laser with fusion 360? I have both fusion 360 and this laser",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Wow you really know your stuff! But I’m confused… not your fault I’m just easily confused lol. \nIs there a list from this video? \nI want to make cut out shapes 1/4 in (at least) ply or mdf. Shapes at least 12 inches sq. \nI’m starting my business with no funding just my own limited cash flow so I want to cut multiple shapes and lettering so need program, wifi is sketchy. \nI know you said everything in the video but which do you think best with limited budget?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Remote software and a subscription service is a deal killer.  I considered buying one during the pre-order period.  I'm glad I didn't.",
    "likes": 3,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "would love to buy it but 3k\nya covid isnt letting that happen",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "WOULD THIS LASER ENGRAVER CAN WORK ON KEYS?, I JUST WANT TO ENGRAVE NUMBERS ON KEYS.\nWILL IT DO THE WORK?, KEYS ARE KIND OF SMALL ITEMS SO THERE IS NOT TOO MUCH ROOM TO\nENGRAVE INTO A KEY HEAD.  CAN YOU MAKE A VIDEO USING KEYS?.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Could it make engraving on a vertical surface by using the tripod ,for fix existing object ?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "So ...in a word , you later engrave paint on a tile , it’s not tile engraving , click bait much?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Can that baby do photographs on metal as in photographs with different shading rather than just blck/white images?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "smaller focal point means faster and stronger right? How much thicker material can the pro cut? Thanks",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Ordered the Muse Titan should arrive in 8 weeks or less!",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "We love Parks and Rec.  I wore my Colts jersey when my wife and I got married.",
    "likes": 1,
    "video": "Building a Picture Frame Ron Swanson Would be Prou"
  },
  {
    "text": "Oh gosh! This is so cleary explained, I appreciate it, type of this quality deserve more attentions!",
    "likes": 1,
    "video": "Turn Real Things into 3D Models with Photogrammetr"
  },
  {
    "text": "Whether it is laser engraving or laser cutting, in fact, the most important thing is two points, one is the laser power and the other is the smoothness of the frame movement.\r\nLaser power not only depends on the input voltage and current, but also depends on the good or bad laser diode, a good diode can make you more quickly into the perfect carving, on the market these products, the laser spot compression is the best, whether you are cutting or carving, despite the product is not good but have as much as possible to Advertisement and make the spot compression of the product is difficult to show the light.https://youtu.be/qAwesZPInhw",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Whether it is laser engraving or laser cutting, in fact, the most important thing is two points, one is the laser power and the other is the smoothness of the frame movement.\nLaser power not only depends on the input voltage and current, but also depends on the good or bad laser diode, a good diode can make you more quickly into the perfect carving, on the market these products, the laser spot compression is the best, whether you are cutting or carving, despite the product is not good but have as much as possible to Advertisement and make the spot compression of the product is difficult to show the light.@",
    "likes": 2,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "🤣 \"this video isn't sponsored, but they sent me this mega expensive 3d laser cutter for nothing\"",
    "likes": 5,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Whether it is laser engraving or laser cutting, in fact, the most important thing is two points, one is the laser power and the other is the smoothness of the frame movement.\r\nLaser power not only depends on the input voltage and current, but also depends on the good or bad laser diode, a good diode can make you more quickly into the perfect carving, on the market these products, the laser spot compression is the best, whether you are cutting or carving, despite the product is not good but have as much as possible to Advertisement and make the spot compression of the product is difficult to show the light.https://youtu.be/qAwesZPInhw",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Whether it is laser engraving or laser cutting, in fact, the most important thing is two points, one is the laser power and the other is the smoothness of the frame movement.\r\nLaser power not only depends on the input voltage and current, but also depends on the good or bad laser diode, a good diode can make you more quickly into the perfect carving, on the market these products, the laser spot compression is the best, whether you are cutting or carving, despite the product is not good but have as much as possible to Advertisement and make the spot compression of the product is difficult to show the light.https://youtu.be/qAwesZPInhw",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I bought the Pro kit with the Y-Axis roller for $500 USD flat w/ free shipping. I’m going to build an enclosure with aluminum rails with black plexi and orange window. Prices appear to have gone up since making this video, probably due from Covid.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I bought one of these for my church to do designs on shirts. The shirts are now holy.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Question for a beginner that knows nothing about the laser,s which is better or easer to learn ortur laser master 2 or ortur laser master 2 pro ?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "A Co2 laser with a galvanometer would be ideal. Did not find any yet. Do you know of a brand that has that type available.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "There is no argument that the fit and finish of the Glowforge is first rate.  But there are too many limiting factors, especially the closed ecosystem, where even if the company does not fold, you are beholden to their marketing changes.  Just ask any Cricket user of the last couple of months.  Yes, Cricket backed out of their proposed changes, but for a while, there was the potential to basically owning a brick..  Should Glowforge find itself in financial difficulties, what is to stop them from charging for functionality that already exists and is part of the package, or jacking up the cost of their subscription service, after people have integrated the glowforge into their process (if commercial).  Sadly, this is a hard pass for me.",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Dude... my Anycubit would have that done in an 1/8the time.. World's easiest maybe.. fastest? Hell no",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "So I’m looking to cut somethings from 3mm plywood do you think this machine would be good? I’m not a fan of the co2 lasers as I don’t have a great deal of space and they look complicated.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Have you tried cutting with chipboard? I will primarily be cutting 1/8\" chipboard and I'm not sure sure if I should upgrade to the bigger wattage one.",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "Can you engrave brass by about 0.7mm to make an embossing block for cardboard? If so, how long would that take on this machine?",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "do you have data on how high it got? That would be interesting.",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "why would I want to watch a video that does not state the xyz volume immediately, if at all!? bye!~",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "i would love to own one, but sadly the wood has gotten so expensive now. ill just stick with my old scroll saw. And Glowforge lost me at \"web based software\" that requires a internet connection to run.",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Glad you did this Glowforge review, which confirm that the Muse 3D or Muse core with your own chiller an inline fan and 45W upgrade, plus interchangeable lenses and rotary tool, still under $6k or even better the Beambox pro with a standard 50W,  integrated chiller, rotary attachment (no interchangeable lenses) still less than $6k both locally operated without internet, are better options for someone looking more for the money. \n\nThanks for the review.",
    "likes": 8,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "There's no way I'd buy a piece of expensive hardware like this, that turns into a brick if/when the company folds or decides not to support it\n\nI had that (company folded) happen to me with a 3d printer. Expensive lesson.",
    "likes": 11,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "yea im not paying thousands to be limited to a website that wont be around in 5 years, with payment teirs and with, the bonus of buying material from them,I know its semi optional but still, greedy much? This entire thing reaks of a future dick move big time leaving users with a 3-5K brick",
    "likes": 3,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "The reviewed equipment adds up to basically $7000. A quick look at OMTech shows you can get 100w, 24x40 (and passthrough), autofocus, a much deeper maximum depth (tumbler engraving anyone?), an actual chiller, two different styles of rotary machines, Corel graphics suite, and Lightburn for $6360. You'll have $640 left to spend on a camera for Lightburn so you'll have the same functionality as SlowForge. You'll also have a much bigger machine with more than twice the power and the ability to fix small things like laser alignment (good luck re-aligning your shiny new Glowforge if it gets bumped during shipping). The only thing you'll be missing is the air purifier and there are plenty of cost effective options out there.\n\nGlowforge shouldn't be compared to a cheap k40; it should be compared to what else you can get for the cost. For the cost, there are much better options.\n\nBtw, their $3000 basic machine gets equally spanked by a 50w OMTech. They do have great advertising though and the entire laser community has benefitted from it.",
    "likes": 9,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Personally for the cost, I would rather a 50w and lightburn, sure you will need a chiller and a bigger extractor, but the inability to be able to use a rotary, or a decent thickness of wood and the low power, the hard to clean, the fact you cant repair anything on it your self... Give me a machine I can work on my self every day of the week. \n\nalso closed ecosysytem for software nope sorry thats where pain comes, give it a few years and when glowforge decide they don't want to support it any more tough! (See Cricut for example of this happening) \n\nHaving a sealed path is a terrible idea in my view, replacing mirrors will be needed in the future and I bet that's a return to glow forge for them to do it and if its not then it will be an expensive option .\n\nA few questions, \n1) How long is the laser tube? cos it doesnt look like a real 40W have they done the trick of saying its peak and using that as a selling point, it looks (to me at least) more like a 35w tube. \n2) What's the fluid used for the cooling? does it have a decent amount of fluid in it? considering the size of most chillers they are bigger than the whole machine so what is it using? \n3) What's the max cutting and engraving speed? \n4) How easy to replace the lens? and how expensive? \n\n\nMy personal opinion is they are over priced and they also could do with someone understanding lasers doing the marketing (its not a printer for example) and to be honest they have a really bad reputation for going wrong due to things like ribbon cables, I guess they are the apple of the laser world, more expensive than a better option and a closed ecosystem .... \n\nNot for me but others might enjoy it.",
    "likes": 5,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "After running a Glowforge pro for a couple hundred hours and while it is a great unit, I have several problems with it. the online software can be a bit finicky. I've had some of the ribbon cables go bad and I wouldn't have made the lid work off a ribbon cable as well. When the lid cable went bad, the unit was useless which IMO is unacceptable. I don't need a camera to run a laser.",
    "likes": 13,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "I think most people watching this are thinking about whether to get a Glowforge or save money and get a K40. Would love to see a little more attention on apples to apples. Also curious on what happens when the Glowforge laser wears out?",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "I love you video, it's clear and and sound is great. I bought the O.M.2 laser. I'm having trouble importing images in light burn. Maybe its my computer, Window 7 ????? I don't know. 😒. I have touched a computer in 25 years. Zip, extract ????????.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Small suggestion: if you can put metric units (SI) in the footage it would be a better review for international viewers.",
    "likes": 20,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Thats a lot of smoke.  In my old 50w co2 laser, it vacuumes the smoke out and my mirrors dont get dirty.",
    "likes": 2,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "How did you get it to record for the entire 3 hours? I'm planning on doing the same thing but none of the cameras are lasting hours and that's with a 128Gb sd card, and a large power bank as an external power source.",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "What is the best laser engraver to buy that you would recommend for under $2000",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "2900? \nno its 2999.99 and if your smart and realize you have to pay tax and shipping its over $3000. US 6% tax is $180\nshipping is either free or $500 for \"white glove service\" so realistically your paying $3180 - $3680 \n\nits a pretty cool laser though. with the different colors and a good art brain you could do some multi colored art engravings.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hello do you know something about the Gweike Cloud ? is it any good ? =)",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Excellent tutorial, Thanks. One question I have is about Fusion 360 itself. When calculating the tool paths it takes a while on my computer which is quite a powerful machine. I7, 16 GB ram, 4 GB dedicated video ram gaming rig running windows 10. I also noticed that Fusion 360 crashes and freezes a lot. Is that normal?",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "thanks for using a real camera and not that fish eye crap.",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Question... over all will a CO2 engrave paint coated yeti cups?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great vid and like your site too.\n\nDo you know of a decent engraver that will do cylindrical objects? I see the Ortur has an attachment for cylinder objects, but it looks a little limited...I'd be looking for one that maybe works vertically, something like would hold a \"not entirely round (cylinder)\" like a cup or glass...??",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Great video, thanks for that! Can you make a video about the safety of these? I thought class 4 lasers had to be enclosed, so would love to learn more about potential safety concerns for open systems. Are safety glasses only really all it takes?",
    "likes": 9,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Now I am 57 years old  not as great with today’s Technology as much as you young guys are but I  do try my best  looking at this unit for $1500.00. Freaks me out  my very first car I purchased was 2 years old from a Used Car Dealership  cost me $2,0000.00  total and I drove that for 14 years  and sold it for a profit  sure I had typical maintenance costs but nothing major in all those years BTW. It was a 2 seater Convertible Sports Car  and I lived in SouthFlorida. For many years",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "need some cross wind that lens is gonnna get smoked to the pt of not burning quik. the auto focus censor is a big contributor here as it blocks the smoke in close to the lens",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Is there a link as to which version of fusion 360 to download?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "I have been watching your videos on the Ortur and I really want to \"downgrade\" to one just to say I have one, I feel like I'm missing out on something lol plus they're so fun to watch.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "best way to protect the colored tiles, spray or paint clear coat on them, and opn the last coat, pop into a toaster oven at 300F for 20 minutes, then turn off said oven and let naturally cool., This will bake on the clear coat",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Can this machine cut stainless steel or just engrave on it?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "\"this is probably one of the hardest most involved projects i've ever done, but let's be honest, my wife has been doing the hard stuff\" instant like on the video right there.",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodwor"
  },
  {
    "text": "What do you think of the AP Lazers?  I am looking at getting one soon to start a small side business.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "The NWT is very simple. Just use Titanium oxide and a bit of water or so. Paint the tile, engrave an boom. U have the look. Dont need white paint for this. Cause it is to much chemicals in there. Only Titanium dioxide and all goes well.",
    "likes": 4,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Great tutorial!  Thank you for taking the time sharing.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Used your referral link for a K40! Thanks for the video.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Fiber lasers don't use \"a bunch of diodes\".  In a fiber laser, the laser light is created inside of a specially \"doped\" fiber.  It's the fiber that provides the light amplification and \"pumps\" the light.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "om tech is one of the worst companies I've ever dealt with.  There customer service is absolutely atrocious.  i received a laser with a massive dent in the side.  it had touch up paint on it.  paint missing, and there was no paint chips inside the container.  They lied multiple times about having a shipping company scheduled to come pick up the laser to ship back.  I wasted multiple days waiting for a shipping company to show up.  it wasn't until i threatened to do a full charge back on my card through my bank that they finally sent a shipping company to pick up the damaged laser.  this company will never get another penny from me.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I'm sure you are using the wrong safety goggles for this laser. This diode laser works with 440-450 nm. The green safety goggles are for 500-570nm.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Do all laser machines need to be connected to a laptop or computer to operate ? Can an ipad be used instead ?\n\nAre all laser machines compatiable with Microsoft Office Word docs ? Or only vector software ?\n\nThanks for your vids.\nThey are very useful !",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Great review. I'm debating btw Mira 7, Thunderlaser Nova 24 or the Muse. There's a $3k difference form the Muse Core (no camera) ...do you recommend having the camera? Thanks for any help.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Should have went with the 50W.  Best starter without upgrading down the road",
    "likes": 3,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hi fellows. I think you need to take some time and take a fast tour on Woodglut website.",
    "likes": 0,
    "video": "Build a Baby Gate (for cheap) // DIY Woodworking"
  },
  {
    "text": "all I see is the ground - its pointing down the whole time",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Will u need a upgrading cooling fan for the laser? I would imagine the motor gets really hot after working @100% for a long time or does it work good for hours with no problems? I’m trying to get started, but I wanna work out the details first",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "You got a really good microphone. Not so much as a minute in and first thing I note is that it's not like you're in my room, it's like you're talking in my ear.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "3:00 the edges will also be slanted if you manage to cut.  Can you cut?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Please give the model, price and where to buy it. Thank you",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Did you purchase directly from the Ortur Website? I bought a Makeblock but it's attachment does not allow for stemware or anything with a handle, also the Ortur has the Lightburn that I hope will be a great addition for picture engraving.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Really helpful to see how to setup these multiple passes. This is what I was still missing.",
    "likes": 5,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "The best paint I've found for NWT is Rustoleum Antique White. I did have trouble finding it at Lowe's and Ace Hardware but Home Depot had it.",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I have a tile I made with the first method that I have been using as my daily coaster for like 6 months. No chipped paint. I just sprayed it with a couple coats of Polycrylic.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Can we add air assist to the pro version or it's only recommended for the master 2 version?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Woodprix is a solid company with solid woodworking plans.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Can this unit be used to engrave metal such as a firearm? Can it etch polymer?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I'm really hype by this kind of laser as i'm making watches, and i think this could be very usefull for the dials, but i'm not sure if the precision of this one is enought.\nIf i send you a dial file, can you try it on another video tu see the result ? (i'm mostyl working on anodysed aluminium)\n\nAlso ... i'll have to find if the deliver in France",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "have you tried Fox Alien laser engraver/cutter yet.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hey, I just picked one up and wanted to know what to do with the ground... doesn't the plug already run a ground? Why would I need to ground it twice?",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "I’m currently trying to save up money for a laser engraver, I entered the giveaway but probs not gonna win, you guys know any sub 300 dollar laser suggestions that ship to the EU let me know 👌",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "i buy thus glasses for the sun.... do they really work for protecting the eyes ??? i thought that only the green ones or orage ones worked.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "6:13 0,079 inches or mm ??? If it´s inches, it would then be 2mm (=0,079inches)... Anyway, can it cut 0,1mm iron-transformator-laminates ???",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Thank you, I've just purchased this item based on this review. I'm going to use it to customize my leather. The code still works but only gives $5 off now.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "It's good to see Woodprix have new instructions to save my money and energy to build it.",
    "likes": 0,
    "video": "Build a Built-In Closet Organizer (Woodworking DIY"
  },
  {
    "text": "Great explain about the fiber laser marking machine.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "You should remove the button stickers and engrave the button text :)",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "The laser looks awesome... .one more thing for the wishlist.  Also - I really hate to be that guy - but that is the Gettysburg Address, not The emancipation proclamation. Love your work!",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "how wide was your recovery radius? intrested in the details..",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Fiber lasers can engrave metal, and more powerful ones can cut up to 3” steel. There’s nothing new about this. There are lots of fiber lasers out there. This is far from the first. There are gantry fiber lasers as well, but they’re big. But they’re expensive. Very expensive. That’s the only problem with them.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Great overview of Fiber Lasers! Fiber is the love of my life <3",
    "likes": 8,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Stunning I'd love to try this man is it hard? I'll have to research..",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I found your your video very interesting and informative, and as a photographer who makes aluminum prints of my photos, I'm curious about the possible applications for this in my work.\n\nDo you have any idea how much heat is generated by engraving onto aluminum? I'm curious whether it can be used on the back side of my prints without damaging the actual print and clear coat on the reverse side.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Literally the only person on YouTube I have come across who has covered this type of laser this way. If you can go in more detail on making actual projects thatd be great.",
    "likes": 6,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hi, I've been looking at getting this unit and had a question. Is there a way to remotely operate the unit like one does with a 3d printer with a USB stick. \n\nI want to have the laser cutter out in my workshop but my PC is inside the house. Do I need a small laptop to run it or can I load files onto a USB stick and run them straight on the machine?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Any ventilation reccomendations for an apartment setting? I'm thinking of using a plywood base as the cutting bed (to engrave a grid for zeroing the work), but the ventilation is eluding me",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "The fiber laser is unique in that the fibet itself is whar creates the laser light  or more specificly the excited ions doped within the lattice of the crystal or glass fiber. Most of the time or at least for consumer focused fiber lasers they are pumped with a powerful    bank  of LEDs which is the excitation source stimulating the emission of radiation. These types of lasers can be significantly less expensive for maintenance as well as initial cost thanks to the more simple beam path. Obviously there are many other factors involved in the cost of the unit and  quality of the beam,  spectrum of the beam , how the beams pulse shape  and duration are controlled ,  or if it has a continuous wave stable  beam... sorry,  i love lasers haha",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "omtech service sucks id never buy from them i call for 3 months to just get info wish i could say better about them but i cant",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Nice review.  Where are those test files that you talked about?  I did not see them in the show notes.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "My adventure with the tree began with projects from Woodglut.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Anyone have any input on co2  glass laser tubes vs metal laser tubes",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hey Brandon, can you recommend me a laser engraver that is fast but good for paper and wood? I love the speed of this one in the video but as you said in the video it's not as good for wood. Is there no machine that meets my requirements? Your reply would mean a lot!",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Would like to see the rotary engrave inside of a ring. The website just says loading blinking for more than a minute when I clicked the link.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "This would actually be decent for marking company computers with computername, location, barcode, anti theft markings and such. But what is the life expectancy compared to a co2 laser?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Gracias por el vídeo.. saludos cordiales desde Santa Fe Argentina!",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "I am Binge watching your videos and I really enjoy the details  you include in them  including even your  corny comments   Yep I was one of those kids in the neighborhorhood watching the others sizzle Ants with Magnifying glasses",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I’m wanting to get a fiber laser to do engravings on guns. Can you do a larger area by doing multiple engravings butted up against each other?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "What solution would you recommend for attaching an air assist, as the new orange cover now makes it fiddly to get an air tube to the lens easily?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "*keeping myself from spending all of my savings from the past few months to get a machine I would use to make nic nacs intensifies* (also doesn't help I don't have the space for it)",
    "likes": 3,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hello, will it continue to cut from the area it stopped if the cut is interrupted?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Thank you for all of the videos. What can it cut...?  Can it score, cut, mark cardboard/thick paper? How does it work with plastics? thanks in advance.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Could I make a customized credit card with this laser?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "0:59 where did you buy this orange protective part?",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Is that test file pre loaded in EZCAD software ? & was the blues shown on black mild steel or stainless ? Thanks & a great video 👍🏽",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Very nice! Too bad the Insta360 One X camera is from FISHEYE.....",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Do you recommend this line for just engraving on leather?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Just wondering what your thoughts were on the tooli G3 and is it possible to get attachments and tools to carry out all the tasks the G3 can do on any of the engravers you have reviewed?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Awesome, been looking at a fibre but cost is prohibitive",
    "likes": 3,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "This is cool! I didn't even know these types of desktop machines existed. Great review Brandon!",
    "likes": 15,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I'm quite happy with my Thunder laser Nova 35 but looking at a Trotec dual laser (CO2 and fibre).",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi Branden, I just get an Engraving machine, I will ask you for help further. nice to meet you good job.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Ortur have to make air assist upgrade. With that i can cut up to 5mm plywood with very good edges, but without - it isn't possible just and you may just burn the material and make small fire.",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Would this be manageable on the ortur laser master 2 (not the pro)",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Selamlar. Ürünün internet sitesinde başka MAKİNA görünmüyor. Eski cihazlar yok. Ben biraz şüphelendim. Sitenin güvenliğinden eminmisiniz?  Ben TÜRKİYE den satın almak istiyorum🤔. Teşekkürler",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Does the machine produce loud noise? I mean I don't want to bother my flat neighbors just incase 😅",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "thing that confuses me is. these run around £200 but for around £300 you can get a K40 which would do a lot more - so is the K40 a better option for a beginner (with a mac LOL)?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I need to cut micro fiber leather, small pieces.  To begin, I cannot spend thousands, what would you buy this or a K40?  I will probably invest in the lightburn software.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "may i get your advise? Do you have idea abaout DAJA j3 10w, can u guide me to engrave with this 10W laser machine to metal item? is it abale to cut or any suggestion?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "THE PLANET IS FLAT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Woodglut comes with very useful plans with all the details you need.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Acetone isn’t alcohol. It’s a ketone. People that fast will actually smell a little like acetone.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Now if they can make one that can cut acrylic and engrave it like a CO2 laser. Also, the laser guard seems like a good idea, but it blocks the fumes from escaping, causing the lens on the laser to get fogged.",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Wait how do they post it on YouTube when it’s up in the sky and it falls down doesn’t it break?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I really like it. Also check out Woodglut and plans.",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodwor"
  },
  {
    "text": "I guess “How to lose your house in a copyright infringement case brought on by Disney” was too long of a title.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Can I use it to engrave metal, like  steel or aluminum discs? Or metal trays?",
    "likes": 3,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "The right paint is so important,  you need one with a high percentage of titanium oxide , also the laser focus is critical and a video would be helpful to users , good video though.",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I bought plans from Woodprix and I did it very quickly.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "I have a question. I want to buy a cheap lazer that I can use to do veneer inlays. Can someone point me in the right direction?",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Would you recommend this pro version if I can find the 20w non-pro version for $200? Worth the upgrade?",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "You probably could get away with just using Rubbing Alcohol rather than Acetone. Just a thought.",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "wow this thing looks so cool seems like i will be getting into this stuff soon",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Oh sir I need this so badly, my unemployment ran out and i'm so stuck. I purchased a Lazer Pecker. Sending it back tommorow. I'm not begging I'm pleading on kness..I need this it's all I ever wanted. When will you choose the winner? Thank you ❣Terri",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "By any chance, are you planning to build a course on laser engraving?",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "the white primer is about the bottom choice, smokey beige from rustoleum, or the 2x paint and primer. work really well. or art paint like kobra white gets deep dark blacks",
    "likes": 14,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "for this to work i can not stress strongly enough how important focus is, and the paint type matters alot.\ni am about 600 etched tiles in to this hobby",
    "likes": 6,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Great video. Very valuable information 👍 - would it matter for the tile to be shiny Vs being matt?",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Brandon, you're the man!! The fact that you don't have a million subs is beyond me! Great video again, informative and interesting! :) (I do the same type of content in French, and you are definitely one on my \"role models\"...!!)",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "https://openbuilds.com/projectresources/laser-shield-box-for-spindle-adapter.285/\n\nGreat DIY laser box.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "would you recommend any 50 W fiber direct diode laser?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I would like to do engraving on the wood bowls and platters I make. They could be 4-8 inches deep and may not be flat surface. Sometimes inside a 2\" recess. Would this type machine do that?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "What laser would you recommend for someone who'd like to start out laser etching as a side business?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I saw a flat horizon all the way up with a local hotspot from the sun. 😒",
    "likes": 5,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "It's possible cut metal like gold 1.2 mm thickness?????(name plate necklaces)",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "concerned about fire.  How cold can it be outside and still run as it should",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Is it possible to cut Leather? Like 1-4mm veg tanned Leather.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Hi sir can sell me the laser you least use😆, brand new ones are  quiet expensive 😅",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "This was one of the best tutorials I've seen on Fusion!  It was some wonderful combination of 'if you're here you're probably not an idiot' and 'this is complicated, let me explain'.  I wouldn't change a thing about the pace at which you do these.  This isn't a live course and you do have the option of rewinding and watching a part you're stuck at repeatedly to get it just right.",
    "likes": 4,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Can the 445nm protective shield \"cover\" be purchased anywhere? I've reached out to Ortur with no reply. I have the \"non pro\" version (LU1-4) and I'd gladly design/3D print a bracket of some sort, if needed, to make it work. Is it \"after-market available\"??? Not seeing it on their site! Please link!",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Im trying to do this as well I wanna start an architecture model making business and sell models and minature furniture. Sadly no money for a laser cutter XD. All my money goes to college too lol.  So fingers crossed I can afford one in the future",
    "likes": 0,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dol"
  },
  {
    "text": "Im thinking of  buying the Neje Master 2 S max  40 watt. Have you reviewed this already? or could you do a review ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi fellows. I think you need to take some time and take a fast tour on Woodprix website.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "No cable chain on X axis NEJE are making this look not good I have the\n ortur M2 nothing but problems glasses that come with this ones and the older one are dangerous \nIf I was buying again NEJE \nTHE Z lift should come with it good video but not really any difference to the old one 40w for cutting NEJE DUEL laser also no air to cool cut also the cover will block all the smoke and make it dirty better steppers on this one 400x430 on old one less on this one. over priced front broad is off a 3d printer you will incounter USB DISCONNECTED half way though your work fan on top of the laser cheap and bearing spline goes off centre and catches outer case earthing problems and static build up you have to add extra grounding wires and even to the earth pole outside no joke the pcb.s are not coated or sealed off so your dust plastic wood just goes right in there you buy it you should be able to plug it in after assemble and work but within an hour your modding adding things just to get it to work\nI'd never buy another one \nAnd if your in the UK like me £80 $100 import fee\nThis one does not look much better than the M2 \nI think the product need more thought.. power supply cable chains better molex connectors to steppers and laser air feed nozzle and pipes free Z axis when you buy \nSorry to go on but people need to know these are the few problems with the M2 and most likely this one to \nIf your cutting co2 if it's tiles etc 20w or neje duel 40w with adjustable lense anyway good luck enjoy all",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "could the k40 cut thin metal?  I am thinking to engrave and cut out pet id tags.",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I'm looking for a laser engraver for doing glass bottles, have any recommendations?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "There is one very important test you either did not do or did and it would have ruined the review and that is durability testing! Probably the single most important test and one most people are going to be wanting to know more than anything (even if it never crossed their mind)! So how about it, how about REALLY putting it to the test and let us know how long we can expect it to survive before it burns out? The biggest issue with these diode lasers is they are weak and have such dismal life expectancies if that was known before the purchase people would not waste their money and it bothers me that someone like you that works with all types of lasers all the time, at least thats what you claim, one would think you are aware of this major issue! Yet its the one thing you make ZERO mention of and I just have to ask, is that because you already know it sucks?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  }
]