[
  {
    "text": "What is the cheapest laser you can get to engrave a pumpkin?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Great video! We tried a lot with the Xbox Sensor in the past / my son and me. This is way better!",
    "likes": 1,
    "video": "A.I. Sucks, This Method is WAY Better"
  },
  {
    "text": "Xtool ist just one big hype nothing quality or special.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Does the xtool m1 ultra 4 in 1 come with a year warranty, or do you have to buy it separately?",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I don't think it is the best around 5K.  If you look at the price paid.  I just paid a little over 5K for my Xtool P2, and that included rotary, riser base, and the conveyor attachment that lets you do really long items (I think around 10 feet).  Also came with a fire safety set (don't know what that exactly is yet), and materials kit.    I have to unbox yet, so we will see how it goes.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "How many have named your laser.  I just had an Xtool P2 delivered.  Its name is Homelander.",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "It had me until I looked at the pricing plans. Maybe if all I did was make maps for a living, it would be nice. But, for someone who makes one every few months, no matter how good it is, it's not worth it. On the upside, this a very good, produced and edited video.",
    "likes": 11,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Is 20W enough if most of you engraving is done on stone?",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Price difference does not make it a good comparison",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Setting up my atomstack a70 max now. So ready to get started.",
    "likes": 0,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "Setting up my atomstack a70 max now. So ready to get started.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "is this creative space just for S1  I have an M1 and My creative Space looks different. do i need to upgrade software?",
    "likes": 1,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "Thank you so much!! If (unless you already have?), can you explain all the processing options? Stuki, Bayer, Jarvis, etc...",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "how did i not know XCS had snapping. im so slow. thanks man. great video",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "This will never replace the circuit because of the price. That is crazy charging that much",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Im researching now and really appreciate this video so much knowledge  i want a enclosure and cameras on. I am probably spending $5k+ on myne honestly",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "This is really helpful information. Thanks for taking the time to put this together. The only addition I’ve  made in the spreadsheet is to account for my design time. Using your example of map making, I might invest 2 hours of design time. Rather than just calling that sunk cost, I allocate those 2 hours over the first 10 copies that are sold as a way to recoup that design time. Thanks again for the great content! Much appreciated.",
    "likes": 2,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "The little window, next to Framing, only has speed for the M1 Ultra and D1.  Still have to \"Go to process\" for jog controls.",
    "likes": 1,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "I think the cost for this item is insane and you would need to make, then sell a lot of crafts to justify buying it.  It’s for professional craft designers.",
    "likes": 2,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "A nice video for all of us new to graphic design as well as lasers. How can you change text in XCS without starting over?",
    "likes": 2,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "You have made a wonderful presentation of this unit. My requirements are to make pad printing cliche in my office. Maximum size would be 60mmx60mm. The steel has to be removed at a depth of .0015\" . Also,  what resolution can I expect? Thank you very much. William Wall twp, NJ",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "it is not a cricut killer... simply put cricut is more affordable and more accessible; that does impact rather a tool will be used by hobby crafters that make up most of a market for a item like this.",
    "likes": 2,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Everyone forgets that the CREALITY 40watt can also be switched to 20(22?) watt as well.  Why is this feature always overlooked???",
    "likes": 1,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "How do I engrave multiple dog tags with different names all at once using the S1 2W IR whilst ensuring every dog tag is perfectly lines up and they all look the same once done. Thanks for all your great vids! Cheers from New Zealand",
    "likes": 1,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "Still gonna need my silhouette, i often cut vinyl longer than 300mm",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "A laser / cutter-potter combo?!? Seriously?!?\nWhat an exceptionally stupid idea. I have both a 20w Diode laser and a brother scan&cut cutter. I do a lot of laser cutting of plywood and it is so messy: the Wood „leaks“ and my honeycomb is really sticky and dirty so often.\nIt works with wood, but combining that with clean paper and the cricut sticky mats… what a dumb idea.\nThere are things that just don’t match.",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I just got the K40+ from omtech and I really need help with setup. I'm new to the laser world and and while watching set up videos I'm stuck between just plugging in my laser and fire it up or should I set up a separate grounds or is a chiller mandatory etc. I only purchased the k40+ with lightburn. Help",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Hey maybe I can get an answer from you Mb , I have the old m1 and keep getting an error code q14x 2 I’ve followed every step in order to fix the problem and nothing has change I think the photoelectric y sensor is damaged unfortunately, do you have any advice or knowledge in order to fix it ? Thanks and great review",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "For all print and cuts projects, do you have to both 1) switch modules from print module to cut module and 2) switch out base between print and cut jobs? Are you able to have multiple modules in at one time, or not switch out bases, specifically for printing/cutting sticker paper which is thinner than wood? The switching of modules and bases would throw off indexing for the job. I understand there is a framing function for alignment. How accurate is framing function, how long does it take, how does its alignment compare to cricut/cameo which uses registration marks for alignment? Curious if the machine could print/cut decals well with good alignment and repeatability.  Lots of questions, but appreciate the response -- thanks!",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "If this had the camera built in it would be perfect!",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I enjoyed the review.  No manual is complete and I appreciated you pointing out some of the shortcomings and fixes.  Clarity of the video was good and your pacing was also easy to follow.  Thank you.",
    "likes": 14,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Nice video. I operate a fiber laser for work, cutting mostly 5’ x 10’ sheets of 1/8” aluminum. Every once in a while I get this feeling that it would be nice to have a really small scale machine at home for hobby stuff, but I’m not in a place where I could drop $1000+ for just a hobby machine. Maybe the pricing will get more accessible as the technology matures, like it has for 3d printers (one can hope).",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Im just about to get into this....I'm in ohio and now that weed is legal here and half of the rest of the country is as well, I'm gonna lean hard into that space..",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Can you do more tests on the print quality on different papers and materials, especially sticker paper and card stock?",
    "likes": 19,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Nerd fact: The letter rating is also used in rating dungeons.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "I'm trying to find a new laser printer I make jewelry and my glowforge stopped working after 3 years and customer support won't help sooo I'm think maybe the xtool  might be good",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I clicked on the video thinking this was a murder mystery.",
    "likes": 3,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "A jack of all trades is usually good at none. Why have one machine to do it all? You're stuck doing one thing at a time. Cricuts only cost a few hundred bucks and they've got it down pretty good now.",
    "likes": 2,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Sorry, not gonna kill the cricut unless it gets a much cuter name than xTool M1 :-).",
    "likes": 2,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I like XTOOL - I own myself a M1 and a F1. Both bought as an \"Early Adopter\" - and thats exactly what pisses me off ^^\nYou always had that feeling, that everonye else who buy later gets the better deal, because they sell things to early in the process. After a few weeks/months they came up with \"addons\" they should have been part of the machine from the start on. \n\nHoneycomb on the M1, the Extension for the M1, the rotary tool 2, after you recently bought der v1 that was not that long on the market, ...\n\nAnd shortly after you bought a machine, they release the next one and \"forget\" about the old one ... to this day there is no fucking posibility to use Lightburn with the M1 (just with the Laser, i know that the cutting will not work with Lightburn). With the build in camera you're fucked if it comes to Precision. That Fisheye Lense didn't give you a chance if you try to engrave precicley. So let me use coordinates instead for god sake ...\n\nWith these Earley Adopter Machines we have financed all the \"ultra\" machines. Fine. They could make also an Pen-Holder, Embossing-Tool or something for the M1 - but ... I understand, that they want to make money. \n\nBut in the future, i'll wait and think twice about any buying decision.",
    "likes": 31,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I definitely need to look back at Xtool. It has been awhile since i have got anything from them.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "My issue is scaling. Im looking to move into this market as well. I currently run a 3d print farm and its necessary to have at least 2 machines in case one breaks. How is the reliability with mass producing? \n\nI spent 3k for 3 machines initially with my print farm and this market is signicantly more expensive at first.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "To me, this M1 Ultra seems like a jack of all trades, master of none.",
    "likes": 28,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "the whole deposit thing from xTool was pure false advertising, for the advertised price you dont get the advertised 4-in-1 machine because you have to pay extra to get the print module",
    "likes": 31,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "As much as I love my last year M1... I have to confess I want to have this new love, but, oh, that is so unfaithful",
    "likes": 2,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "XTool did say in their live that the print quality wasn't going to be as good as your usual domestic printer. Vinyl cutters may need to consider that they would not have the capacity for larger projects. The actual cut size is, I believe 11.8 inches by 11.8 inches. I love my S1 20W and I would say I think it worth paying the extra to get the 20W version if you are going to buy an M1 Ultra.",
    "likes": 9,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Will this be able to print and cut stickers? What would be the highest quality sticker material with this machine ?",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Another amazing bit of kit from XTool.\nMaybe I am missing something but…..\nIf you are moving between functions, specifically going from the laser to any of the other functions, will you have to perform a deep clean of the bed area to get rid of any of the residue/resins/ cut pieces etc produced by the laser cutting before placing the mat for blade cutting? \nAs I see it, if you don’t, the mat will be likely to pick up any of the by products of cutting and it may be difficult to ensure the smooth surface required.\nPerhaps they will include a cutting bed and a crafting bed as a simple solution?",
    "likes": 5,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Interested in getting this for my wife. She uses a cricut, but since I got my S1 Laser, now she’s also interested in lasering as well. \n\nAlso should I upgrade my 20w S1 to a 40w or just get a P2? Cost isn’t a massive factor for me, although it is a consideration.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "PLEASE! PLEASE! DO NOT BUY - I have spent about $3000 with Xtool - I purchased the D1Pro and some other stuff almost a year ago and I have had nothing but issues. Trying to work with Customer Service is INSANITY! I also purchased the Infrared, and it has never worked. I was told by Xtool \"Regarding the problem of the infrared laser head, many customers will not be able to use it successfully due to improper operation.\" So even if you follow their instructions and use the samples they sent, you still maybe doing something wrong. What are you doing wrong?--- you don't know, and they don't either, so you end up with a $500 paper weight. I watched tons of Youtube reviews on the D1Pro and they all gave glowing reviews; so, I went with it. Unfortunately, I and many others have not had the same success with Xtool as indicated in the Youtube reviews. After so many issues I decided to invest in another laser and speaking to some of Xtool competitors I asked question in hope that I don't end up with $3000 paper weights. The most chilling thing discovered was they are aware of Xtool and the issues the customers face. I noticed that a lot of the issues I've had with Xtool out the gate without me asking any questions they spell out what the machine can and can't do, their customer service and support. One guy said their Support Agents respond with 4 to 9 minutes and they quickly resolve your issue because they understand many of their customer use it for business purposes. Better than the 24 to 72 hours waiting for Xtool to respond and two weeks later you are still no where close to a resolution. OH, and those that have State side support definitely let you know that.\r\n\r\n I really don't want anyone to encounter this; because when you are not a wealthy person $3000 is a huge investment for you. PLEASE when researching for purchase do more than watch YouTube videos; it could save you time, money and peace of mind. PLEASE be sure to ask about customer service\\support, warranty, replacement parts. A big one would be \"What issues are commonly encountered by customers and how do you work to resolve those issues? \r\n\r\nI saw a post on Facebook asking, \"Why are so many people selling their Xtool?\" I laughed because I was looking to see how easy it would be to sell it. RFLOL \r\n\r\nWhen you have a quality product it is GREAT! I really enjoy engraving, cutting and making things it is so therapeutic. DON\"T FORGET to be diligent in your research.",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "The one I got I have to assemble it myself 😭 the box is so big but well packaged",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Nice vid and the files look great. Any chance you can do files for the F1 and F1 ultra in the future?",
    "likes": 4,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "The same set of ppl get all the machines to review. What do you usually do with all these machines after?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "As someone who is just getting into the laser hobby, and does not own an xTool laser, I am anxiously awaiting those Lightburn files!",
    "likes": 3,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "Will these work on other lasers, like fiber and such? Or are these ONLY for the xtool?",
    "likes": 1,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "I really like the look of their machines but they don’t use Lightburn. Until then …",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Really hope they can keep upping the wattage for their fiber lineup! I love the form factor but 20W is still pretty low-end, especially for this price. 50W would make deep engraving jobs so much faster and open up much more cutting possibilities.",
    "likes": 2,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Good grief - you ever count how many words you say in a video?  And not miss a beat.  Truly amazing.",
    "likes": 6,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "with the conveyer, air purifier and rotary its over $5,000.  I ordered mine yesterday.  Sad I have to wait until the end of July for it to ship.  I have a lot of plans for this machine.",
    "likes": 3,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "can u please suggest the best suited one for stone engraving of 5mm depth",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I’d be interested to see how well registered the tools are to each other. For example, if you print an image on vinyl and then cut out complex shapes then how closely do the cuts and image align?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Would the F1 Ultra be good for engraving rocks, stones and woods too?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Amazing breakdown of something that's very complex! Thanks",
    "likes": 2,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "$500 off and the fact that I can't see the actual price of the machine are enough for me to know that I am not the target market. Thanks for keeping us abreast of what's out there, though.",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Flux Lasers released their Ador machine about 4 months ago that also has colour printing and swapable laser heads. They even have a 2W IR Laser for engraving precious metals like gold, silver and titanium. I'd like to see a comparison between the M1 Ultra and the Ador on the printing side.",
    "likes": 2,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "They cannibalized the OG version with this. I wanted the OG version but i didnt want to pay nearly 3x for the OG",
    "likes": 0,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "xTool's constant push for these teaser videos is only degrading and cheapening the quality of content for the product as a whole. Prospective customers want to be educated, not teased. That's why I refuse to make them any longer and wish others would too. Our viewers deserve it.",
    "likes": 6,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "I'm curious to know if there's an air assist with this machine",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Comment obtenir les recharges de cartouche d'encre et à quel coût ? coût de revient \" à la page\" ? quelle est la qualité d'impression en ppm ? l'assistance d'air de la M1 est il compatible ? les autres accessoires de la M1 aussi ? est elle plus rapide en gravure que la M1 ? quelle est la surface maximum de gravure/impression ? quelles différences avec une S1 de 20W au niveau de la gravure ?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "What’s the speed of this device and how does it compare to the s1?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "I don’t understand XTool sometimes. How easy it would have been to add the camera. I believe the M1 has the camera. So my question/s 1) Can a riser be installed like on the M1 for a rotary attachment. 2) Is there a pass through or is it limited to just one size. 3) what is the max working area? 4) Have you received any information about an IR module option. 5) Does this work through the XTool Creative Space Software and Lightburn 6) Which Filter is needed to run indoors, is it the same as the F1 or does it require the large 699.00 model. 7) what type of ink cartridge is used for the printing and what type of ink is used. 8) What modules come with the base product. 9) Will it work with the screen printer.  10) If no camera will it use the iPhone option like the S1 can do now because the teaser ad shows batch printing so curious how that works. Ok so lots of questions I know but trying to decide do I pass this up and just get the S1. I hate that neither have the camera yet they installed the camera on the M1. I sometimes wonder what they are thinking when designing these machines. For a few bucks more it would be a real game changer had they added it. It looks similar to the Glowforge Aura but that does have the camera and pass through, but no rotary.",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Hi, Can it be compared with the falcon 2 22w (in laser cutting of course)?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "It feeling the love, it’s interesting but it sounds as if they added a lot of capability but not much power",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Awesome preview I still have mine in the box didn't know what to expect haha",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "They are paying you, they PAID for your flight and room.",
    "likes": 0,
    "video": "This is the World's Fastest Laser"
  },
  {
    "text": "Are the laser modules the same ones used by their other machines, like the S1? So like, could I use the 40W laser module from that on this machine?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "They must think they are Adobe with the pricing structure.",
    "likes": 1,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Problem is. Usually, things that do many things, do none of them that great.",
    "likes": 6,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "No camera?  So no way to align cuts to something printed elsewhere?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Interesting machine! Which ink is used (UV, eco-solvent, any other?) and on which material it can print? Is there also white ink available?",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "They need these cool modules for the S1 as well, since it is modular.",
    "likes": 4,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "The Flux Ador has the printing module as well, wonder how many watts this M1 Ultra has.",
    "likes": 0,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "The color print is the same concept on Flux Ador. Flux introduced Ador 7 months ago.",
    "likes": 2,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Jack of all trades becomes the master of none! 😂 \n\nThe heat press equipment is what I’m more curious about. Also does the new screen printing tool work with the M1 Ultra?",
    "likes": 3,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "Okay… first xTool never sent me the RA2-pro “plus” now they are keeping this one from me too. I am beginning to think xTool’s marketing department has decided I am too big of a liability 😅\n\nThis one looks cool. I am most curious about that printer Brandon can you try to show us what all it can print on. Can it do metals, or even vinyl sticker paper and then cut them out?",
    "likes": 6,
    "video": "The Ultimate Hobby Machine? - xTool M1 Ultra Previ"
  },
  {
    "text": "do either of these have a pass through for longer items?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Hey Brandon, what size is the exhaust outlet on the back of the machine please?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Thanks for this interesting vid. What is your recommendation for handheld options (for pipe engraving scope) ?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "The F1 uses 2watt infrared not a fiber laser only the F1 ultra uses a fiber laser",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "hope you respond , after watching this video i learn more, and more for the past 10 days , but still i dont know what machine , i need to engrave on ,men leather wallet and leather belt , i hope you can tell me , or send link that i can figure this out , thanks",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Can this laser cutter cleanly cut through 2mm of clear acrylic?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "What software are you using to burn 3D-Laser files?",
    "likes": 0,
    "video": "Using a laser to make a 3D coin!  #fiberlaser #xto"
  },
  {
    "text": "Hey Brandon great video, just a correction to note at 12:40 it does have a door safety switch and you can toggle it off or on inside the settings.",
    "likes": 4,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Hi @makeorbreakshop , when can you review Monport GI60 laser?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "There is a software toggle in XCS to turn on and off the shield safety. So if the shield is up it will turn the laser off.",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "No air assist, then you immediately put the plate on the ultra the wrong way. 🤦",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "There’s another machine coming from Xtool soon and I’m excited to see what their multifunctional craft machine is like. I don’t feel I have come across a machine for my craft needs so 🤞🏾🤞🏾🤞🏾",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "This is just another Xtool laser designed for uninformed buyers. They inundate the market with flashy marketing videos in an attempt to make their lasers look better than they really are. This F1 Ultra is ridiculously overpriced compared to \"real\" Fiber lasers.",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Had no idea you could do that type of relief on slate! 🤯\n\nIs that using the fiber or blue diode?\n\nI just bought a 30w LaserMatic mk2, would love to be able to do something like those reliefs, even if not as deep",
    "likes": 4,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "I want to get a co2 laser but am put off by the size for engraving metal cards. would this be a better alternative?",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Would like to see you compare this to a standard fiber laser.",
    "likes": 4,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "$4K is a bit much. Don't hear much positive comments about xTool customer service.",
    "likes": 16,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Interested to hear your take on the Ultra. Also, do you think its worth it for xTool to keep the F1 Prime when the Ultra Exists?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Check out the xTool F1 Ultra (and save a little money) with my link -> https://geni.us/xtoolf1ultra",
    "likes": 2,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Do you know of a company that offers training - hands on training?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Does the m5 have auto resume function in case of power outage",
    "likes": 0,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "I think manufacturers aren’t going to stop until they hit at least 100W.",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "At 7:42 you mentioned the frequency range of \"20 to 60 Hertz\"....  TRY 20 to 60 kHz  idiot....  Never showing the engraving \"results\" for more than .5 seconds definitely indicates a piss-poor result - something to NOT be proud about....",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Should probably finish watching the video before asking this but....\n\nGiven that the tray can be removed, does the Z have enough adjustment to make it possible to have a long piece of material inserted in it's place, with the cutting capacity of this larger(stronger more functional) multi-piece projects can be done and you will get a LOT of waste if you have to cut pieces short enough to fit in the machine rather than just feeding in and positioning/flipping(if necessary) a longer piece to maximize material usage and minimize waste?\n\nBasically every 'tool made from plywood' vid on youtube with parts small enough........................",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "I have a problem, I do not have the word edit on my wecreat top left corner. How do I get that",
    "likes": 0,
    "video": "The Features all Laser Software Should Have - WeCr"
  },
  {
    "text": "Yes please can you do a comparison of a ~60W CO2 machine to 60W diode.  I'm torn between getting the P2 with all the bells and whistles and the Falcon2 Pro 60W.",
    "likes": 2,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "That’s a lot of money to spend on something that can’t cut clear acrylic. I’d rather spend that sort of cash on a CO2 laser that gives me the ability to cut materials outside the scope of a diode laser. I own a diode laser. So, this comment isn’t to beat up on them. They have their place in my maker space. You can’t ignore their limitations.",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "love to see a 60W side by side, speed and materials please...",
    "likes": 1,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "It's great that these companies are getting more and more serious about security and protection, Acmer P3, xtool s1 are very good!",
    "likes": 2,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "From the parameter test values, I feel that the engraving function of this machine is average, and I can't see a suitable engraving parameter. And the wood board has traces of yellowing.",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "I suspect the limiting factor in how many laser LEDs they can cram in these things is thermal.  If they can dissipate the heat there's no reason they can't put 20 of them in there.",
    "likes": 1,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "Roly Automation is at least 1-year behind these guys, their 40W MK3 is not scheduled till 1-Qtr. 2025. Nice job Creality!",
    "likes": 2,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "A comparison between a 60W CO2 and a Diode laser would be awesome!",
    "likes": 24,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "Check out it here!\nCreality Falcon2 Pro 60W - https://geni.us/creality_falcon2pro_60\nCreality Store Link - https://geni.us/creality_falcon2pro2",
    "likes": 1,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "Hello Brandon, I am new to laser engraving, and need advice to decide which laser engraver is right for me.  I would like to focus on acrylic and glass item for engraving, but not sure on which laser engraver is the best pick for me.  Any ideas!",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "First off, really want to thank you for taking the time to put this video together. This is really good information. I know this almost a year old, but I hope you still get notifications about comments. What would you suggest for engraving leather and metal? I’m looking to offer custom engraving on handmade leather goods either directly or with metal plates that could be silver or gold even. Any suggestions would be appreciated.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Very nice system! -What is the license of the files you sell? Am i allowed to make the products, and sell those to the local hobbyists in my area, or is it personal use only? Thanks!",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "Great video. Personally I would leave out packaging cost because that can be put into your shipping price, that the customer pays. \n\nI would add in misc business costs as a % on top - rent, supplies, kitchen, cleaning, insurance, registrations, safety equipment etc.\n\nAs for laser time, i've found that it is unrealistic unless it is the ONLY factor in pricing a custom one off job. A lot of people online use laser time but if you're also factoring machine cost, maintenance and labour, then counting laser time is basically double charging (in terms of working out your costs). \n\nHowever it does work in figuring out how to price a custom jobs on the fly, where you aren't making the same kind of item hundreds of times.\n\nUltimately if you are making at least 3-4x the cost of materials then you're doing alright.",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "I cut 5mm plywood 2 passes, using air assist, with very smooth edges, and very little burn marks on the back side, top side, has no burn marks whatsoever.",
    "likes": 4,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "I''d love to see a video on deep engraving brass with this machine for coins. It would be perfect for taking to markets an customization wooden projects. but I'd also like to make coins at home to add a makers mark.",
    "likes": 0,
    "video": "The xTool F1 Is Actually Pretty Awesome!"
  },
  {
    "text": "One massive issue for me is I need to be able to free hand cut. The parts I;m doing it;s not practical to program the cuts so I want to use it like a scroll saw. Is that even possible? I checked and there is what's called a \"fire\" button in Lightburn. It;s meant to be a low power mode but can I use this to turn it into a scroll saw?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hey man. Do you know if you can buy these anywhere, if you aren't from US or UK? :-/ Can't find anywhere to buy from (i'm from Denmark)",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Does it allow you to specify the depth of the engraving? I need to engrave 0.03” not any deeper.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Loogs great. Would the standard setup handle a Life Tree 40W power wise? (5mm acrylic and MDF planned)",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "I have to disagree on the D1 Pro being ranked low. I own the D1 Pro, F1, and S1. They all have their merits, but the D1 does something that my S1 cannot realistically achieve.... I can place it on any flat surface and engrave whatever I want. With that said, the F1 is still my overall favorite due to my own personal use case, but the D1 Pro is versatile... it has the room underneath for me to insert a full length baseball bat and use the rotary tool to engrave it. That wont fit on my others!",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "I wanna work with this on a very small scale for making jewelry. How precise is it?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I'm new to this and I am curious you mentioned that the xTool F1 can do metal engraving are none of the other units really designed for metal engraving? I am looking for a solution to do custom challenge coins. Thanks in advance.",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "When you said IKIER, I thought IKEA made a laser cutter and you suddenly turned British.",
    "likes": 12,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "thanks for making this!  ( also i did get an xTool ad before your video started lol )",
    "likes": 1,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Hi! Great review, thanks for sharing. I'm considering buying a Sculpfun S9, but I'm concerned about its long-term durability. Since your video was made a while ago, could you please share your experience regarding its performance over time? Has it held up well, and have you encountered any significant issues? Any insights would be greatly appreciated. Thank you!",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "If there was a way that this could also be adapted to engrave on larger curved / irregular pieces like tote bottles, golf clubs, etc, that would make it the only machine needed.",
    "likes": 1,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "In the end. How many coats of pre stain conditioner did you apply? And how many coats of stain was applied?",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "please donate a old laser engraver to Cape Town please",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "your list link doesn't work for me for some reason.",
    "likes": 0,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "I work with a pair of real industrial lasers, 3k and 8k watt ; C02 and fiber, respectively. Both of which cost just over a million last I checked, but were purchased 15 years apart. What's funny, is that that our new 8k fiber laser is TOO fast now, so we invested in hundreds of thousands worth of loading/unloading to keep up with it. Now we simply don't have enough business to keep it running all the time.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I am so new and green but I enjoyed your video, I would like to do acrylic or glass 2D photos mainly, can I do this with the 40w laser capable to do use and can I use the recommended software whisper or what it's called.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "can you engraving on acrylic or glass such as photos",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I just purchased a use k40+ compatible with lightburn when I try to make cuts it burns a straight line to the next cut laser stays on the whole time how do I fix that",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "For the space used, this looks like exactly what I need. Between this and a cricket, the possibilities are endless. On my way to buy one now.",
    "likes": 8,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Very cool design. Looks like it could be a option however the price IMO is way too high. Maybe if they succeed and grow that will change but for now it is a deal breaker for me to buy one.",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "GreatvideobrolotsofgreatinformationIwatchedthewholethingyourveryinformativeandeverythingiswelllaidouttheonlyissueIhaveistheeditingstylewhichI'msureisobservedasthestandardwayofdoingthingslikeeverboyelsebutstyleoverintelligabilityandconversationalpacingisreallyuncoolbutunfortunatelyitactuallycomesacrossslikethis.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "I see 2-3 slight “problems”:\n\n1.) It is slightly more difficult to figure out/see exactly where it will engrave, especially when not using the matt.\n\n2.) The hight of materials, as well as potential waviness, seem very restricted! Many other cheaper diode lasers have auto leveling via stepper motor and height detection DURING engraving, and don’t rely on a roller in a specific location.\n\n3.) The overall concept saves storage and transportation space, but is very limiting otherwise. Including (inexpensive) expansion kits, higher power laser modules etc.\n\nInteresting product (for specific applications)!\n\nBest wishes",
    "likes": 1,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Are you still recommending the polar?  I watched the video but noticed that it is over a year old. Looking to add a Co2 desktop laser to my shop.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I'm so confused why all the haters in the comments are trying to compare this to a co2  laser. Most diode laser companies will advertise the input wattage for marketing, and typically, they have a power output of around 10w. Rendyr is advertising their actual OUTPUT power of 12w. I think this is a very well thought out machine, not to mention manufactured and supported right here in the USA.🇺🇸",
    "likes": 18,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Nice idea but 3k for a 10wlaser   sorry thatsnot going to sell. Small portable 10w much cheaper",
    "likes": 1,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Surely if you cut something the laser is going to ruin the bed",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "How much is a replacement filter? Considering something like the xtool f1 filter is like £90 to replace, and lasts 6 months maybe",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Laser cutting requires space for safety, exhaust, stocking material, assembly, sanding, laptop rerunning jobs... \nI cut 95% of the time so this is not for me. While cool, it is not solving my problems.\nBetter exhaust, quieter operation, faster job, camera (to avoid the very problem that occured in the demo of overlapping jobs), less soot on the cut, dealing with non perfectly flat materials, auto focus are features I am in the market for.",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "This is a great concept. I wish the laser module is 20 watts instead of 12 watts.",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Hmmmm that sure is different and very expensive, ok about the cutting board, I see two open lines (the fold lines) so when cutting, if the material is over one or both of the fold lines, I guess it would cut into the felt backing? I can't really tell from the video if it has some kind of protection or not, but as it has to fold at that point, I will guess not.\nThanks, and please keep making more video's.",
    "likes": 2,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Its a really cool idea and seems to be well thought out too.",
    "likes": 7,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "I honestly think that this laser will not make into the die hard hobbyist world,at least not for people like me.$3000.00 for that, nope!",
    "likes": 2,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "do you know anyone who would talk to me on the phone about laser engravers? I am a leather hobbyist who wants a laser engravers, i think? so far the two lasers i want to check out are both made in China, and i don't want to call china. i believe talking to someone more local, i have learned that even Youtuber want to say the right things to get hit. that that they are lying, just not saying all of the con's about a laser. i get it , everyone had to make money to keep going. Like is lasers only good on Veg tan leather and not  on chrome tan leather. things like that. i have seen a lot of lasers on leather, but there a big different between Veg tan and chrome tan leather.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Interesting concept.  Would be great for customizations at a craft show.  Curious at to speed as is it limited at all my the cantilever design, flashback if cutting, accuracy of the X axis i.e. if the movement in the Y axis twists the x gantry at all.",
    "likes": 1,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Brilliant design. Especially for crafters with limited space like me. The only drawback - I'm in South Africa... 🙄",
    "likes": 10,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Very interesting and innovative design that I think would be great for a lot of products. But a couple of questions:\nNow does cutting work on that flat matt without a honeycomb bed does it leave marks?\nIt would be interesting to see how the risers work and is it compatible with a rotary?\nDo they have plans for other heads like maybe a IR module?",
    "likes": 1,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "I'm always happy to see a kickstarter project reach completion. The built in filtration is a great idea, and the form factor is cool. I just do more cutting than engraving, so it's not really for me.",
    "likes": 6,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Can you do a tutorial cutting Acrylic?    I am looking for a machine to make Acrylic jewelry. Ty",
    "likes": 2,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Assume they will ship with a metric grid outside the USA?\n\nEdit: just saw the price, $3,000.- ? Seriously?",
    "likes": 8,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "11:10 - \"it has a flame sensor, and if there is a fire or flare up , it is going to cut out the power to the sensor\" - brilliant mistake : kill the messenger approach :)",
    "likes": 4,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Normally you should NOT talk about this laser, as it is a confidential model.",
    "likes": 0,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "Let me know what you think of this design!  Save $1000 with promo code MOB24 (Limited to first 24) here: https://geni.us/rendyr",
    "likes": 8,
    "video": "No Other Laser Can Do This - Rendyr Optic Overview"
  },
  {
    "text": "If I just want to cut fabrics such as cordura, I don’t need large format (for example 8x11” fabric materials), what’s a good laser cutter?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I saw couple of comments mentioning $2k price, but I only could find a whopping 5,699 figure! Gee..",
    "likes": 0,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "Good information. However that's quite a bit of work over the month I think. Wouldn't digital products, like pdf leather patterns be easier?",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "ok sooo im struggling to figure out how to connect my d1 to  lightburn and the lightburn youtube tutorial doesnt really help i am very much doing something wrong please help",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "I like the probe leveling and PCB prototyping. So that build volume fits perfectly for my use case. Thought about the cheaper mills, but the tutorials online for those beasts make the level setup sound time consuming and unreliable.",
    "likes": 0,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "Nice job on the video! I would get a Thunder Bolt in a heartbeat if it did better at cutting material that is around 1/4”(6mm). At that thickness, I swear a 30W+ diode would cut faster. And the next stronger Bolt is ridiculously expensive. Bummer! I’ll wait for the Roly MK3 40W extra wide model that is coming towards the end of the year.",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "i do laser cutting machine  side work can i contact you through whatsapp",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "This 3d printer is a huge flop! Lack of a good slicer is a big shot in the foot. There is no offline anything with the m5c which is a joke.The app is completely useless and the files on the app are very few and arent all stl files so you cant directly print 90 percent of those files.. The slicer will tell you 10 hour print and turn into 15 hour print somehow while printing. The fact that the company's on website lies about its own features should be enough to scare anyone away from buying this. And for the price, you can get many different 3d printers that utilize more types of filaments and have some sort of upgrade so your printer can do all the things you want with 10x better slicer. And the m5 is an even bigger joke with a camera that does nothing... I wouldnt recommend this to any entry-level person either because that's just predatory to suggest a bad product to someone who doesn't know any better.",
    "likes": 0,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "I want a laser cutter for small leather and grave. And I want it on a budget",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "So cool I got one gifted from a amazing family member!! So informative!",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "That is a very visually pleasing CNC! I especially like the full enclosure to keep everything clean and quieter (maybe) as you mill about. Great video as always Brandon!",
    "likes": 3,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "What’s the cheapest laser that will cut acrylic for making earrings?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Does this printer have the M600 filament change feature?  I do a lot of 2 color printing. thanks",
    "likes": 0,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "Cool list thank you... Subscribing and looking forward to more content :)",
    "likes": 1,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "I would totally love for you to sell these and tell us how that goes. I need confidence :-) Also, is there a program to make maps??",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Best budget laser for mainly doing leather patches for hats? I saw a video using the Gweike Cloud Pro but can't afford that right now.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "So if I’m reading the pricing right. If I purchase the hobby plan I get 18 layers of download a month? So if I theoretically have 2 projects that have 9 layers a piece, that’s all I get?",
    "likes": 3,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "I’m looking for a lazer that can engrave and cut acrylic and engrave metal",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Can you please let me know if with any of those machines you can Cut posterboard",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Anyone’s that have a camera and auto focus with easy software that can also do leather and cups and plastic plaques ?",
    "likes": 1,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "hey...that's us! Thanks for including us in your video. We're honored! 🧡",
    "likes": 4,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Translate this to chinese and hope they read it. Should be a wake up to what they are doing wrong. I just suffered thru a warranty claim with xtool - a very trying experience. It was an obvious game and they thought I would give up. At least a dozen emails over as many days asking repeatedly for info I had already supplied. The word 'sorry' does not fix it. After 2 1/2 weeks, I did finally receive replacement laser head. Now setting up new Roly that just arrived. If you have two lasers you have one.If you have one laser you have none.",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Nice front-end to OpenMaps.  You get the same output ( well almost ) as QGIS without the learning curve.  But, I will stick with QGIS.  Thanks for the video.",
    "likes": 2,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "The thing i notice is that you do not make a difference yet between the kind of laser\nglowforge for example is a CO2 laser , Creality is a Diode Laser , Xtools got Diode and Co2 depending on what one you choose\n\ni can not say if it would make any big difference, but i can imaging that some people are less happy with a 5K printer that get outperformed by a sub 500 printer because of diode vs co2\n\nso if enough data is present, can we get a quick breakdown of the co2 / fiber / diode classes so they stay equal to a certain point ?\n\nalso i love the video, it is well done and it was interesting, i expected way more of sculptfun but seems people thinks otherwise\nthis also makes me wonder, atomstack for example (if i am not mistaken )  is just a offbrand ( or premium brand ) of a other laser company, so maybe those can be split up to ?",
    "likes": 2,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Holy crap, what a joke.  Xtool is the perfect example of people flocking to the thing most advertised despite how stupid ridiculous the price is.  Charging what xtool does for a fricken diode laser is insane and people don't have the common sense to know any better.",
    "likes": 2,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "what do you think about the Neje Max 4 E80. It looks like a very interesting machine with the motorized z axis. A review would be cool ^^. Thank you !",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I’ll stick with snazzy maps and affinity designer. No monthly cost. I don’t like subscriptions.",
    "likes": 2,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "I am surprised on some of the stuff on the list.  As someone who buys alot of lasers just to try out on my channel; many other brands that people need to check out.  \"I do want to try a Aeon in person as well.  Have only seen at trade shows\" But at same time so many new brands hitting the market daily.  Me personally I would have omtech at bottom of list as worst brand to deal with.  They have the worst customer service I have seen.  Ive open 3 tickets with them and yet to get one problem solved from them.  Luckily youtube has a great community.",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I just want to engrave name badges.\nHelp. Which machine is good for this.\nMetal and plastic tags",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "My full spectrum laser fell apart and rusted. The support was awful, they lied to me at purchase about upgrades and then went on a twitter tirade that I was an unreasonable customer.  Absolutely would never recommend full spectrum to anyone!",
    "likes": 2,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Check out all the best and worst parts of every laser brand here: https://pages.makeorbreakshop.com/laser-company-survey-results",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "link for the laser resources?  I dont see anything pinned or in the description",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Excellent video. Love it. That's the spirit of community",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "This video is a gold mine of information for someone looking to get into laser cutting, thanks!! 💪",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I’d like to know why so many don’t like Ortur. I’ve had great luck with mine. Such a simple machine. Got my feet wet with CNCing with them.",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I’ve had a glowforge since day 1.  I give the machine a 2 and the company a 0.",
    "likes": 2,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "There is no free lunch with lasers.  If it is underpowered it will cut in a more shallow way and it will require lower speeds for engraving deeper.   \n\nFor laser work, remember the price, quality, and speed triangle:\n\nFast!\nCheap!\nGood!\n\nNow pick two options but only two options. \nRemember this triangle because it rules your world.  You might want to reach an economy of scale, but for that you need a lot of capital.",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I just dropped $18k on the Redline order so we shall see if that comment at the beginning of the video holds up lol 😅",
    "likes": 2,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I can find the link for that survey to save my life trying to do this on the phone which is not the best thing for me…",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Odd about the ortur.   I have 3 and they are great!",
    "likes": 0,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I have owned several lasers over time. From my first Laser Master 2, to the Xtool S1 and P2. I wish I had known about the survey, I would have contributed. I actually sold my P2 because it was just way too cumbersome. The Xtool machines are a good bang for your buck, but there are two things I absolutely HATE about them. 1st, the hose size for the exhaust tubing is 3 inch. This means it won't fit most standard duct tubing which is 4 inches or more. I had to print adapters for the S1 and P2. There is no good reason for them not to use the most common size. Though I guess this could be some attempt at proprietary BS so that you have to buy tubing and exhaust accessories from them. 2nd, the implementation of lightburn compatibility is terrible. It's janky as all hell and badly thought out. Plus the camera functions of the P2 never worked in lightburn for me. If I could do it again, I would go with a company like Thunder Laser. They are also Chinese, but they have USA based support and sales people. So my issues are never brushed aside and the BS claims are less.",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "interesting. where is the link to the document you mentioned at the end? thanks",
    "likes": 1,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Etsy has many laser patterns. As a full time pattern designer I need to say that many pattern sellers are selling copyrighted patterns. Many of my designs are being sold without my permission. Etsy will not help with this and all of the sellers of my patterns are overseas so I am not able to do much.",
    "likes": 6,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "I was very surprised by your findings on the different lasers... Good to know..",
    "likes": 2,
    "video": "This is The Best Laser Cutter and Engraver"
  },
  {
    "text": "Thanks for the video. Do you know if they plan to us some of the new technology in some of their bigger lasers?",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "I wasn't aware of Roly machines. I will be buying one in a couple of weeks. This one is now my pick. Thanks!",
    "likes": 6,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "One of the best fusion tutorials — if not the best  — I have watched so far.",
    "likes": 1,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "I would definitely have to make 100K/year in order to go fully on my own (live in SoCal). Right now I am just starting my own business as side hustle. My regular 9-5 is also engraving for a pet keepsakes company. I do not plan on running online stores as I would rather gain clients organically via craft fairs and word of mouth (social media). Great informative vid as always,  the spreadsheet breakdown of costs is a great idea, Thx!",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Strongly considering the S1, but I would really have preferred a camera. It seems conspicuous in its absence. I may wait for a camera model. I donno how much I need CO2 and it is so much larger and more expensive. Plus I don't have the option of the IR module if I got a P2",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Bantam Tools were not started by Bre Pettis, he bought \"Other Machine Company\" that made the \"Othermill\" and renamed it to \"Bantam Tools\" in 2017.\nThe Othermill was launched on Kickstarter back in 2013.",
    "likes": 1,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "This might not be the right video to ask this one but as someone who's trying to get into laser engravers as a hobby/potentionally starting a business, any recommendations regarding workspace? I personally dont have a lot of room to work with and would probably end up having to use a bedroom for the laser I'd end up purchasing, do you think it'd be fine to have a smaller C02 laser or a bigger diode in bedroom on a desk or something? Kinda concerned with needing stuff like chillers or other bits alongside something like a C02 laser.",
    "likes": 1,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "You forgot to remove the aluminum bar across the front.  It’s only there for shipping.",
    "likes": 5,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Could anyone could recommed a cheap metal engraver for metal business cards? thanks",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Credits that expire and a subscription is a rip-off, like gift cards that expire, they get my money and if I don't use it I lose it. Wouldn't deal with this type of model. It's not like its cheap to start with",
    "likes": 1,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "What is the deal with the credits I see on the pricing page? Also do you have a twin or did I just see you on a tv show I am watching?",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Would have been interesting to compare it to the Nomad 3 from Carbide3d",
    "likes": 1,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "I make and sell laser engraved wooden and color printed maps, major cities, towns even area and streets, so they sell well. I have used quite a few different software programs to accomplish my goals. I used QGIS for when I needed buildings, Snazzy Maps for streets, roads and highways, finally Open Street Map for a little bit of both. Snazzy is the easiest but you can’t export SVG files for editing, nor does it do buildings at the resolution I need. QGIS and Open Street Map both do buildings but have Steeper leaning curves with multiple steps and that slows down my workflow. I would love to offer custom maps, but the time it takes me to design one map, to sell that one map, makes it a poor financial decision (time is money). I have other products that are far easier to make, and therefore more profitable. If Laser Map Maker is easier to use and can draw up buildings and exports SVG files, then I can make custom maps faster and make more money, then it is a good deal to me.",
    "likes": 2,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "I'd be willing to pay for this cause it seems great.  A subscription that pays for credits that expire is where I have a problem.  I get busy and focus on things for chunks of time.  I'd be more excited if it were just a pure credit play, a subscription with credits that don't expire at the end of the month, or credits that maybe expire but after a couple months after they are received.  Regardless I may give it a try.",
    "likes": 3,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Knowing the dev is watching this, quick question, is it USA only?",
    "likes": 3,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Are you able to choose specific roads to highlight or is it just all or nothing with main roads and secondary roads etc",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "hello! what would you recommend for the budget 200mm work area fiber play? i want do engrave golf clubs!! any guidance appreciated!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I would be happier if you talked about Acrylic and ABS type plastics too. Anyway thanks fir the video",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "If you're a small business owner selling laser maps, this would save a ton of time. Will check it out for sure.",
    "likes": 4,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Nice Video!  Take care, laser is addiction!  I got two fiber marking machines; a 50W to normal marking and medium deep marking, and a 100W to deep making and cutting .",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "looks like they're just using snazzy maps on the backend. anyone with a decent tech knowledge should be able to get this for free.",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Pretty expensive. At four layers a map you get about 5 maps in a month. Sure you could export combined layers but then that’s the best thing about the app without that it’s not worth much at all.",
    "likes": 4,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Very cool. But a one time fee would have been far more preferred. A subscription with a cap on usage is kind of predatory. Very sad. Maybe someone will make a better version.",
    "likes": 30,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Nope. The subscription cost doesn’t make sense for a hobbyist, and is expensive for someone trying to make these to sell.",
    "likes": 4,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Very expensive and yet another subscription based program!",
    "likes": 22,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "This looks very handy and user friendly. Im not a biiiiiig fan of a ‘credits’ system though",
    "likes": 15,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "PLEASE stop the ads, and go back to normal videos.....until then, im getting enough other trash-ads, i dont need yours....",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Thank you for comparing to other CNC. Can't wait for Carvera",
    "likes": 0,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "My boys went and got this for my birthday.  Can't wait to get printing!!!",
    "likes": 0,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "Maybe suggest to listeners and describe how to turn playback speed to .75.  Purrrfect for me. \nValuable information.  Ty!!",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "This is unprecedented in my view.  I've waited years for someone to do this with a stabilizing system.  I didn't even know the 360 pan from a Youtube vid screen was even possible.  I was just happy to have a stable view.  The only thing I have to nit pick about was that payload that kep careening into the field of view.  Also, wasn't it kind of dangerous to fly in occupied air space?  I thought the routes were always cleared through permitting.  Outstanding new take on the whole weather balloon adventure.",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Well, you can export sketchup files as STL (even in the free online edition). But it's not under \"export\". You need to click \"download\", which is a bit confusing indeed.\nThen to actually generate G-code, I use the slicer of my Bambu printer, which has presets and is probably more tailored to my printer than Fusion360 is, I assume.\nGreat video though !",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Makera has already said that prototype’s open loop stepper motor will be changed to closed loop (servos?) for the production model.  They also said something about an upgrade to the door-cover though it is less clear what that is about.",
    "likes": 10,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "Hi guys , what's the best setting (speed) , to avoid fire and get the best result",
    "likes": 1,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "I see too many comments in lasering groups asking:  \"OK, I got my new laser, how do I make it work?\"",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Just so everyone knows this product is only in China.  There is no way to get any parts or get it fixed under warranty unless you send it back to China.  Mine has issues and they send me parts to fix it myself. This will shut your business down during the months it takes to get it back.  If you have critical failure they will replace once you send yours back and get the replacement.  This will take several more months.  They will let you give them $2500.00 refundable deposit if you have a spare $2500.00 to give them for several months.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I started with an xTool S1 40watt and when I made the move to get a Co2...AEON MIRA 7 60watt. Freaking love the tool, no regrets, and yes, the support team is fantastic even on their Facebook page.",
    "likes": 0,
    "video": "This is the World's Fastest Laser"
  },
  {
    "text": "I watch laser reviews not for the reviewers opinions, but rather to see what the laser can do. If it can engrave and cut well and the speeds are good, and it meets my requirements, that's what I care about.",
    "likes": 0,
    "video": "Can You Trust Product Reviews?"
  },
  {
    "text": "you forgot to mention a quite nice feature of the enclosure : you can open rear to mill into long piece of wood for instances.",
    "likes": 9,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  }
]