[
  {
    "text": "@13.19 \"...still limited to 1000mm width\" \nIs that for the speed or something? 1000mm is one meter.",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Really seems like a fiber laser. Galvanometer (fiber laser), Speed, (fiber laser).......",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Can you do a video on how this laser does when engraving metals? Please!!!...thanks!!!",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I can easily see this being useful for quick turnover/ on the spot/on demand personalization in a retail setting.",
    "likes": 22,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "The Galvo Speed is nice, but at the end of the day, the power is weak and the image quality is awful. The other add-ons seem like an identity crisis for compact and mobile unit. Just got the D1, and quite frankly its pretty mobile should I find the need to move it. The D1 has a slightly smaller list price for 10w vs 1.5w at the laser, and has half the light beam diameter. I think anybody who dropped bank on this wizard gadgetry would be buying on impulse, but quickly have buyers remorse after the low quality results become the apparent norm.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Wow, that's really cool.  It would be great for engraving a maker's mark on completed projects.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hmm, by now you will know I don't kill closed eco systems but this seems to work. However costing the sane as a k40? I dunno, temping for craft shows maybe",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "What do you think of the different rotary modes, useful or gimmick? Here is a link to the Kickstarter: https://geni.us/laserpecker2",
    "likes": 11,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Before we get all excited about running out and printing images on tile. You should realize that those images belong to someone else they are copyrighted and using them is against the law you are essentially stealing someone else's property",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I do leather tooling and was wondering how well it would cut out pieces. Are the edges crisp or does it leave snags?",
    "likes": 2,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I need wood engraver to engrave 6inch by 6inch detailed pictures. What do you recommend?  Thanks",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Thank you for taking the time to make this video! You have helped me with the decision making process in purchasing our first laser for my company!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "6:30- it's not UV light, it's blue light around 540nm wavelength. This doesn't mean you should be looking at it, but since it's visible light you have a pretty good indication of your exposure level.",
    "likes": 4,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "omg pls help.. they have killed all my designs.. its all gone. totally gone. cant use the program unless I pay them over $1000... I spend around $200 on my designs, getting them made and I make zero money from it.. faaaaak",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "What about the xtool M1 that is on kickstarter right now? Any opinion about it?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks for this!  Can you do a demo of how to hook up the air compressor to this setup?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I received this laser this week and I have to say it is a sexy POS.  They say it works now with lightburn, well it does not.    I have had nothing but problems with it.  It crashes into the wall all the time.  When you tell it to home, it crashes into the wall.  If you try to frame your work to tell where you need to put you material, it crashes into the wall.  There are no limit switches on this laser so it has no idea where it is.  If you want to put your work in the middle of the field, well good luck.  I tried everything and it would only work in the upper left corner.  There is no emergency stop switch, so if you have a problem you have to fumble  around for the power switch.  Not something you want to do if you have a real problem.  I ordered the rotary with this laser but did not get it.  I had to contact support to find out that it was on backorder, and they never even thought to email me to let me know.  There is no factory air assist with this laser, and that would defiantly come in handy.  Their setup video is horrible.  It moves so fast that you can't really tell what they are doing and what part that are using.  I have to say DON'T buy this if you are new to laser engraving, and even if you are a seasoned  person it will be hard to get it to work properly.  Do yourself a favor and stay away from this laser.  Sorry to put this up but I think it will help a lot of people.  This is not a well thought out machine. Yeah it looks sexy and well built but it's not worth the price at all.  I will be getting an Ortur for sure.\nI do think that you can learn a lot from this channel though.  He really seems to know his stuff.  Keep the videos coming, and thank you for all you do for this hobby.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hopefully safety features can be disabled. On some lasers they seem to hinder the use with false shutdowns.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Dude where you from?! lol I hear the country boy within. TN?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Have you ever reviewed the Sculpfun S9 laser engraver? I would like to cut 1/4\" black acrylic. Some of the reviews say this is possible. I would also like to work with laminated sign material. I would really appreciate your opinion on this. Always informative fun videos. Thanks.",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Great detailed review. Will this etch drinking glasses as well.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "The slant engraving;  any chance that the jittering could be caused by the focus detecting the smoke?",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Do you have any recommendations for a deep engrave on carbon steel?",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Really wish I had found your channel before I spent the money on a Snapmaker 2.0.  With years of 3D printing experience, I figured the Snapmaker would be a low risk stepping stone into the laser world.  (If I didn't use Laser, I still have \na 3D printer).  The problem is, so far I don't have a laser. The one in the box was broken, and support is lacking, to say the least.  They're on replacement laser module #3.",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "For anyone who has this and can't figure where the clamp is, it's located just under the center plate in the bed. You have to remove the 4 screws and then remove the plate.",
    "likes": 2,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "Hey, thanks for the tutorial. I've been able to get most of it to work, but I haven't been able to get clipping masks to work within lightburn. Might there be any key steps I'm missing? \nThanks!",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Firstly thank you for your videos, you have really helped me make a decision on purchasing my first laser engraver. Starting small with a diode to learn the ropes.\n\nIn a lot of your videos you run a test setup to showcase the speed/power results. Have you made a video on how you set that up in Light Burn - it seems like a very good place to start to get the best results.\n\nCheers\n\nAndy",
    "likes": 3,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "One question.  Why...in every video...when you are doing a review....does it appear that you are just burning the hell out of your wood like you have no idea how to actually use any of these lasers?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "What is the best laser for engraving mugs and tumblers?  Could the Glowforge engrave mugs like any other machine?",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Could you engrave it into a tabletop instead of a piece of ply?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Thank you!  So what difference would I notice with a 5W vs 10W. How does the lower power play out in use? It is speed or thickness of material it can cut? And, how hard is it to make a 2nd pass at a material to cut it? Does it still cut pretty clean?",
    "likes": 6,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I'm looking to spend in the range of $4-6K on a floor-standing laser. My big concern is software. I want to be able to print/cut directly over USB or WiFi from CorelDraw like any normal printer. Software like RDWork does a poor job of importing drawings and most need lots of rework to make them useable. What laser can I buy that I don't have to rip the guts out of the minute I get it? Thanks for the help.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thank you for posting this - VASTLY informative - but I have a very basic newbie question: why can these not-as-expensive lasers NOT cut or engrave CLEAR acrylic? It seems to be a running theme with all of my research so far in potentially buying a hobby laser…",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "What settings should I use to engrave ceramic tiles? Or does it not work on ceramic? I tried it and it didn’t even leave a mark.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "My wife is wanting a glowforge. They are too expensive and I've read bad things about them. Other suggestions OMTECH K40. I've seen that OMTECH has 2 different models. My wife is a crafter and I'd like a entry level but maybe that could be expandable.  I like the prices of the two K40s but don't know the difference between the two or why she needs either one. I hate that there is so little work area inside the printer. I need this now for Christmas. Please help",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Great video as always. Quick question.... What is the least expensive model that will actually etch metal?",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Good to know! I have the XTool D1 and I use the stock stainless steel setting and it has no problem \nEngraving into tile then I just fill in with paint",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Can you engrave bottle of wine using calligraphy using this laser engraving D1. Please need some advice!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Looks good but refuse to be locked into proprietary software.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Great videos with a lot of information! Would this laser engrave my tools?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "@05:53 _Oof..._ 😱\n*OSHA* would have a word with you about light _refraction_ and its dangers... Just because the Laser isn't _reflecting_ doesn't mean the harm has gone out of the window.\nYour wood is clearly refracting the laser light making it visible to you! You ( and anyone else in the room ) _should_ be wearing safety glasses while this machine is operating! 😑",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "It is now possible to run LightBurn on the xtool D1. I've been using it for a few days and it is a big improvement. That along with an air assist modification, a honeycomb bed and an inexpensive exhaust system it's an amazing set up.",
    "likes": 12,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "A year later do you still stand behind what you said? What would you change about set up now if you could?",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "Dear Abby\nAfter about a month of research on Youtube I decided on the A7 Pro after watching your video several times. It arrived in days, was easy to assemble and looks great. Unfortunately I can't make it work. It turns on, lights up but will not connect and Lightburn and Lasergrbl won't recognize it. There apparently is no warranty, customer service or way to return it. At my wits end.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Which laser do you feel is the best for glass both flat and water glasses, also include ceramic material like cups ?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I got a little diode cnc laser like this a few years back I had fun with it then I got the K40 Co2 laser  and its not only the power but you can move mirrors a lot faster than large diode lasers with heat sinks and fans. High power fast movement you get wood to vaporize no ash nothing turning black just the wood gets engraved. What you got here is a wood Burning tool sure you can burn patterns with it but its not an engraving.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can you cut plastics like\nPlexiglass or acrylic with this?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I’m looking for a simple system, that I can etch a simple name on hair stylists scissors…any thoughts? Thanks!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "You say that it is 1.6 watt. Internet says 7 watts. What is the right wattage of the lu 2-2 laser?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Need to engrave 10” wide by 24” long hardwood. Wolill this work? Suggestions? Thx",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "@ 17:12 it shows a half done test? Im guessing because it stopped where it is really charred? I have tried to run this 4 times with it stopping around there can you confirm this and do you know why ? Thank you",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can any of the desktop C02 laser cutters etch brass or aluminum?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "How deep would this laser engrave aluminum? Can I get .003 inch or greater?",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I believe the xtool D1 10w can use Lightburn.  Am I mistaken?  If not,  would you still choose the atomstack x7 over the xtool D1 10w?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hey Brandon\nWill you ever try testing out a J Tech 7W PRO Laser for the XCarve? \nWould love to see you test one of those out and hear your opinion on it.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Has anyone had any luck / experience permanently marking chrome plated sockets or wrenches?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Wonderful video for newbies like myself who are looking to dip their toe into laser cutting.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Nice, but I just got used to my Ortur so this one is not in the cards. There are a lot of accessories for the Laser Master Pro 2 also. Good review.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Is there a certain room temperature that you need to work this machine?",
    "likes": 0,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "Do we need a laptop to use with these? Is it possible to control with an iPad or iPhone?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Laserpecker company or someone should make a laserpecker community chart. For the different settings. And types of material for each size. So if u want to print something out of wood. It  would say material. Then the best height and width for a small print. Then do for a medium print. Then a big print. Have that listed on the websites. And other pecker uses can community their projects. Discord or something.",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I would love to hear your advice actually\r\nI've been looking at your videos now for quite a while because I am getting more and more interested in buying my own laser cutter. I have a lot of experience with MDF as well as resin printers. Even before I used to go to the city workshop where I operated with their CO2 Laser (HyperCUT 6090 PRO).\r\n I can print a lot of things with my printers but still I would love to be able to cut and engrave stuff.. + with wood you get that warmer feeling if you give some sort of gift. I would love to have a machine that is capable of cutting good as well as engraving. Mostly I would cut some sort of stands and smaller chests or boxes for storage or decoration. material wise; Foam, MDF, acrylic and vinyl. So with this cutter it's really, really tempting. Price is fair, even though I was always in love with Co2 lasers and dreaming about getting one because of speed and enclosure and everything else. I also looked at some of your other videos like OM Tech K40 and its bigger 50w brother but with K40 the problem is cut volume and with 50w machines the problem is price. So if you were in my position, which machine would you recommend me getting? Should I save up the money and buy bigger CO2 for like 1500 - 2000€ or should these smaller diode machines work well enough for me? Thank you for your answer!!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Would love this but the link for the plans is non existent. Do you have an updated link?",
    "likes": 1,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Pl"
  },
  {
    "text": "Please take a look at the tempo of your cadence! Geez!!!",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Download my Lightburn test files to find the best settings for you: https://pages.makeorbreakshop.com/laser-test-file",
    "likes": 8,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I'd also like to see the Sculpfun S9 and NEJE comparisons to this . \nI like the amount of details you included.Thanks!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "For the cooling machine could you replace the water with coolant?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "tell us about your bed? is that aluminum honeycomb?",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I really just want a opensource software for lasers that works on Linux, and Raspberry pi's, I should have an air assist on this in the coming weeks when mine gets here",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Those engravings are awesome!!!!! Can you share what settings you use for your engravings? I know you said to test it out but a video explaining how to interpret the test results and how to translate them to engraving would be beautiful. Even easier would be you put the settings on screen so we can have a baseline.",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "As soon as you said that it does not have air assist, I went back to the reviews of the others.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "The Neje 40w uses 2 ea 7.5 watt beams, is more powerful and less expensive than the Atomstack.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I’m doing a new drinking game, where we take a shot every time you say the word, “actually”. We ran out of booze at 7:50.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "You said you were going to put a link to your test file in the comments, I don't see it.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Mine arrived yesterday and today I had time to install it. I did not manage to get lightburn finding / connecting to my Atomstak X7 on my MacBook Pro (2013, macOS Big Sur). After many tries and adding the cutter manually (choosing GRBL), I tried lightburn again on my pc laptop. This also didn't work initially, until I choose GRBL. Now it works. Anyway, thanks for your review - I checked this video with the hope of seeing how you connected lightburn on your Mac to your X7. :)",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Do you play with larger bed lasers? like 2440x1220 kinda size?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Having a huge problem centering the blue dot to get my Center point for engraving please help\nRegards, Rick",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "have you heard of the gweike cloud c02 laser. its very much like the glowforge but much cheaper and run either their cloud base software and lightburn too",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "what about the sculpfun s9 its pretty powerful and cheap too",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hi what do you think about yora laser 40watt thanks",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "You kept saying  mm/s and you should of been saying mm/m. 180 mm/s is 10,600 mm/minute...edit... i own a xtool D1.",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Is the website provided in your description real and secured to oder the machine?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Thank you for this video ,,this  machine I'm for sure going oder it , what program should I use ?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "The CW-3000 is not chilling the water. It has no compressor. You need to get the CW-5000 instead.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "What video microscope are you using? The on-screen scale is very cool.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "It would appear from watching this lackluster review that this machine can only engrave (dorky) pictures on wrinkled paper. Not exactly the King of anything......",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Have you , or are you planning on reviewing the LaserPecker 2 ?...I trust your honest opinion, and will wait to decide weather or not to buy one...I want to do mostly engraving metal, glass and plastic..not so much cutting. Thanks and have a great weekend!...from Tucson, Az.",
    "likes": 2,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I want to add propellers to it like the Ninja Turtle blimp and fly it over Antarctica and be like \"SEE, it's a continent!\" to the FE community.",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "You say that this is the most powerful Diode laser module in a system sold on the market right now but there's NEJE A40640 15W optical output laser listed for $239 (Shipping not included). They also have a complete system NEJE Master 2S Max with the A40640 module with a working area of 460×810mm listed for $579 (Shipping not included).\n\nThey have a claimed laser spot dimension of 0.04×0.04 mm and they sell a manual air assist addon for under $20.\n\nWhich is objectively a better deal than any of the systems you mention here.",
    "likes": 3,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Please answer back would you go with this or the omtech k40",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can you review the Neje with their 15w optical output  module ?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Question , I want to purchase neje 40w in / 15w out laser will it be able to do this or I need a smaller wattage?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Will this machine do cylindrical items or only flat surfaces",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "You mentioned cutting wood, but I'm curious about cardboard.  I want to make custom dividers for cardboard boxes, and that's pretty much it.  The larger work area that this has over the similar priced c02 laser is pretty much required, but is this going to be frustrating and tediously slow cutting cardboard, or is this a feasible use case?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Dear Make or Break, I watched some of your videos and probably you already answered to a question like that ;-)\nI am pretty familiar with vinyl cutting plotters, I had few ages ago.\nI was wondering if there is a machine where I can buy the main frame and then use a laser and a router.\nBasically I would like to be able to use only one machine with different heads( to cut & engrave different materials )  Is this possible ?\nMany thanks",
    "likes": 2,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "What type laser  printer would you recommend to do the cups with powder coating and etch it?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi Brandon,  Thank you so much for the great info. I'm in the wine business and want to occasionally engrave glasses and wine bottles. I would say about 100 individual bottles or glasses a month. The engraving is not the business. I would also like to do some 3d printing, but not necessary. Glowforge would be ideal except it won't fit anything taller than 2 inches high. Wine bottles are at least 3 inches laying down. I have a $3,000 budget. can I get your thoughts?\nThank You,\nAndrew",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Can this cut thin clear acrylic sheets? I want to make display boxes",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Good day! Great review of the D1, awesome machine. \nWill you be doing a review of the M1? I would like to purchase one of these two to start a home business, however I can't make a decision. I am hoping your review will assist me with a final decision. \n\nThank you",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "If you’re ever in NYC, happy to show you my Trotec speedy 400, and explain why it’s a much better machine than the comparable epilog!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "0:25 [pauses video to look at the \"parts\" pictured, top-left]  ...... That's a Settlers of Catan board!  :D",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "And Look!  No curvature to the earth ....because the earth is FLAT, not a ball spinning in space.",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "This is a great video for \"name brands\". Don't sell the K40 short.   If you don't have $2,500 for a laser cutter just get a K40, Glow forge is way over priced!  Inkscape and Whisper is all the software you need(both safe free downloads) to run a K40 laser.",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "The price of laser cutter are stupid, it was like how much 3D cost. I like making single item for personal use. Having it be little in term of quality of build is fine with me...i'm making a cup hold for my bike or a coin stacker. $200 for a 3D printer was perfect for me and a perfect prince for a home use. A $3k glowforge is stupid for home use, I'm gonna just cute paper or something that i'll be using it once a week. It's cheaper just to buy the product. But that $500 K40 is nice...can't wait until I have more room hopefully the price will cut in half. Maybe creaty will get into laser cutter.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Download test files dont have helmet test ;(  can you share ?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "But what keeps me from engraving metal with a co2 laser?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Hi! I've been looking for a laser module capable of etching pcb and engraving anodized aluminum. The thinner the beam spot, the better. Any recommendations???\nThanks, Excellent channel!!!⚡🤖⚡",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Sorry this is just a toy, what a load of rubbish. Buy a proper laser - Trotec!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Thanks a lot for sharing your experiences to the comunity and make us discover new laser cuters. This LaserPro seems amazing compared to Ortur! One question : do you think it would be possible and not too complicated to change the laser for a more powerful one if needed? Thanks again !",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Thank you for your video and your research on several of the lasers",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I know you said it would engrave on stainless steel, however would it engrave on Sterling silver?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I need a laser to permanently apply text to stainless steel and brass coupons, none larger than 100mm. There will be hundreds of them, each different. The stainless will need to withstand permanent exposure to the harshest sun and wind for years at a time. When you say this machine will mark metal, does that mean it will be satisfactory for my needs or do I need to think fiber lasers?",
    "likes": 4,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "To review then put a regular camera on it. To get rid of all the curve",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "$th. Nov. 2020 $300, 17th. Nov. 2021 $610.  If materials were sourced in 2020 and item sold for $300, one year later the item is sold at $610, that's one massive profit margin.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "LOL I love the 'Vice President Dan Quayle' spelling of \"potato\" at 9:54. Was that an intentional Easter egg to catch us out?",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "0:39 While the double-glasses may not accomplish the most polished look, the way the laster looks on video peaking out behind that sheild is pretty cool.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "The software is very poor and limits your abilities to use this to its fullest capacity.  I bought it for the 10w laser, but had I known it would not use industry standard software, I would have made a different choice.\nBy the way, do not upgrade from laserbox basic 1.1.0 to 1.0.1 it breaks the positioning ability on the burn screen.  The earlier version works when you try to position the laser using the buttons to go left, right, up or down.  On the new release, it seems to be very harsh on the motors and the laser starts moving diagonally (not in a straight line) as intended.  Again, the software is beta release at best.",
    "likes": 2,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Who are these people that can drop 6k to use a laser on the weekend?!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Hi, you mentioned that you would list the sample burn matrix thingie files, i didnt see them in the description, are they still avalible thx?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Wow! What a video... most excellent, at least for my purposes. I saved, liked, and subscribed. Thanks.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Can I cut a 2x4. I  would like to make toys to send to kids",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hello,  I'm wondering if I need a special computer (specks) for this Xtool  D1",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Can't wait to hear your thoughts on that Atomstack M50...supposedly backwards compatible with the Orturs???",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "have you heard/tested the GWEIKE laser? I dont have the space and was looking for something like the glowforge. Great channel...You have been very helpful..thank you",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I want a laser capable of cutting a paint film off a copper PCB with really high resolution, cutting lines of 0.005\" (5 thou) wide for making PCBs. Note the laser cuts the film off so it can be etched in the usual way. What's the best choice. I have an Atomstak 50 watt model and it is useless as the beam width is 0.015\" in one plane and 0.025 in the other.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks for the review, very helpful. I was looking into these just to maybe engrave an image into wood, not needing to do any cutting. Would you say the \"15W\" version is good? Because it jumps in price by like $70 from the 15W to the 20W...",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Do you become instantanly blind without the glasses?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "🔥🔥🔥Great news,  \r\nOrtur Flash deal and Discount promotion will start on Nov. 25. !!! \r\n#blackfriday2021 #ortur #flashsale #orturlasermaster2pro #laserengraving #Orturlaser #promotion #CyberMonday",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "🔥🔥🔥Great news,  \r\nOrtur Flash deal and Discount promotion will start on Nov. 25. !!! \r\n#blackfriday2021 #ortur #flashsale #orturlasermaster2pro #laserengraving #Orturlaser #promotion #CyberMonday",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "where did the random cap screw come from that appears around 9:19 ?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "This is great. Now I can make some hardwood shims rather than use those soft ones from the store! Definitely going to try the table saw jig.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "Looking to engrave my Custom design(s) at a minimum depth of .50mm onto a 16 gauge alum sheet, which will be exposed into a outdoor environment. After engraving, I want to polish the whole aluminum body to a high reflective sheen. What do you recommend?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I’m looking for a laser machine that can ingrave and cut any suggestions laser community?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I can't get to your webpage shop for the review list",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thank you for your concise and to the point practical presentations which are so valuable in choosing a “no unpleasant surprises” laser cutter/engraver. \nGetting a well informed cost - benefit trade off perspective is so useful 👍🏻😁",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Did you ever get the frosted look you was after mate?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I like your videos! I just ordered the new 40w dual laser 460*810mm unit. I read a comment saying that it's technically an 80w with each a laser being 40wX2=80w... I was thinking it's more along the line of two 20w lasers equaling 40w... What do you think?\n\nOne another note I saw the video of the big machine you bought from China and my wife and I agree it's a good option. We were just curious how much was your shipping and freight once it got to a US port?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "So I’ve read a ton of negative reviews on full spectrum laser. Anyone have an opinion on this brand?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "When you have a larger object is it best to etch with a mill or is there a way to increase the work area with these devices?",
    "likes": 4,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "What do you think about the m1 coming out on kickstarter?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "What GPH would you recommend for the Air Pump?\nYour link leads to one that ranges from 600GPH to 1750GPH.\nI went ahead and purchased this Laser with the LU2-2 7W and the LU2-4 LF and am just trying to figure out which pump you link to would be more appropriate for the Long Focus Laser.\nThe Ortur Site just says a flow rate of >40ml/min which converts to 0.6 gal/hour. If what Ortur listed is correct, would that mean any pump would work and be overkill?",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Can I import illustrator files into this software? So do all the editing in illustrator, import, then print as is?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Just curious, for non-US customer( with 230AC) where would you buy a K40-like?",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Cool Laser. I just built a Diode laser and am enjoying learning it. This one will be the next laser for other things. I like the speed.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Full Spectrum has horrible support. I ordered a new tube and it had a bad seal and filled with coolant, which shorted out my power supply. Took almost a year to get it up and running again (Mailing parts to them and using Google Wallet to pay really) and then it died again. I gave up and went with Rabbit on my second laser and am extremely happy. When I had a problem I was able to get a replacement part in a week. (Not 3 months) We now have 7 Rabbit laser and they all work well. You can have Rabbit come and set up the laser and make sure it work too.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I just noticed that on the Ortur site they do not sell the LU2-2 or the LU2-4 SF module by themself.\nThey have a regular LU2-4 but it does not say SF. They also have a LU2-4 for the Master 2 but it is 12v and does not support the Master 2 Pro or the Aufero Laser 1 and it is sold out anyways. They only sell the LU2-4 LF by itself.\n\nIt would be nice if they sold the machine with the option to get all three modules with it, which is what I want. As of now I would have to choose between LU2-2 or LU2-2 SF and then buy the LU2-4 LF by itself. I would basically be missing out on one of the other modules which sort of sucks if you want all three.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "So for a budget laser  that can do everything including metal , what do you recommend?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "What is your view on the xTool M1 Laser & Blade Cutter currently being crowdfunded on Kickstarter? Thank you.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "what is the cheapest laser for engraving names on small signs",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I'm curious to know if I'm using this 2-3 hours a day, how much will my electric bill go up? Also, can you engrave and cut in the same pass, or do you have to set it to engrave and then reset it to cut in a separate pass?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi there...GR8 videos 👍 If U could only buy 1, would U buy this or the Ortur LM2 Pro? Where did U hear about Ortur bringin out a 10w laser please?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Such a great presentation from a great presenter: Comprehensive yet concise overviews, specs and comparisons with clear, easily accessible language and delivery.",
    "likes": 14,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "thanks for the great video! would laser engraving on stainless steel cause rusting later on? trying to find a way to engrave stainless steel that doesn't lead to rusting.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "looking at xtool and muse, would you recommend 1 over the other?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Very interesting info. Been in the market for a diode laser and may have to go back & look into this one again.\nI hope you get a chance to talk about the Sculpfun S9 that is being released soon. It looks promising but would love to know if it actually is.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "If it was $250 in 2019, and the inflation rate is about 8% since then, the price should be about $270 to keep up with inflation.  However, the price in the link is $353, nearly 30% higher than what is quoted in the video title.  Not sayin' the title is a lie, but that that the current price is a HUGE ripoff. 🤬",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Wonder if this works with mirrored metallic gold paint.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "could you do a review on UV galvo lasers? and also compair the results on wood? is the fiber loosing details and so on.. because its possible to engrave with fiber on wood.. uv would be the best but they are even more expensive.. gantry co2 are much slower it would guess..",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Congratulations on your channel, what you know about  sculfun machines (s9  , s6), do you have any opinion on those.?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I've been fusion for a few months now. One thing I cant figure out is how to model doors and drawers on my projects. Can you help with this?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "For tiles, dye sublimation is faster, less expensive, and more durable.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Can I use it to cut GOLD. I mean I'm going to loose so much of Gold powder while cutting or engraving? How can I check that.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Does anybody know if you can use this laser for adding names and line art to a AR-15 mags? I've used paint and what not doesn't last a long time.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I've used Epilog and Trotec lasers and prefer the Trotec. They are just more... industrial for a lack of a better word. For my home shop I'm thinking of getting a 100w Omtech. Omtech looks to be a great value.\nI'd really recommend staying away from the devices that lock you into their software; especially if web based (wtf!). Sure they make things easier initially out of the box, but serviceability will be a hassle down the road. Better to tackle that learning curve head on and have more control over your production machines.",
    "likes": 6,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Do the CO2 type use CO2 gas?  If so, what for.  I'm just starting to look into this.  I've got twenty years experience with plasma cutters.  Are there a lot of similarities?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "If i want to engrave inside a crystal cube, can i do it with this MUSE machine?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Your key light link is brokens btw.. or at least broken for me.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Sketchup had some dimensioning issues, especially when working with very small objects. Fusion isn't perfect, but it's better than sketchup.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "hello. should I choose this machine or neje 2s max? what do you recommend?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I lost my laserpecker charger, do u know where i can buy one or if another charger will work?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Is there any way to add air assist to x-tools d110 Watt laser",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "hello. I want to order one for myself, I don't know which one to choose ortur 80w or neje 80w? what do you advise ?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Great video. First point. Most K40s come with kill switch on the lid now. Second, Meerk4t will allow a lot more flexibility to your laser power, I think it does fast switching rather than varying the power.. It's not in Lightburn territory but it's way better than Whisperer and it's free.\nThird, the fan is upgraded, most now come with a perfectly adequate fan, rather than that dire fan on earlier models. Remove the internal ducting and you have really good extraction.\nThis means that you will only be spending around $100 for air assist and mirrors to get a very workable machine that competes with the Glowforge on most jobs.",
    "likes": 5,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Any thoughts about sculpfun?\nSpecially about the S6, S6 pro and S9...",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Does the software allow upload of preexisting files you've made on other software?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Nice review! You may want to look at squaring the acrylic bases if you are getting to much wobble. Best thing to do like you said would be to screw it down though. Good job!",
    "likes": 5,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Alright so I’m brand new to this. Excited and want to get a machine. What would you suggest for a brand new user but can learn quickly. Been looking at the xtool d1 as my first choice but honestly looking for a true professional’s opinion. Looking for engraving and cutting. Hope to do some tumblers, ornaments, signs, etc.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I don't see the link for the compressor in the description. Any chance you can let us know what compressor you used for air assist on this machine?",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Have you already tried if it REALLY cuts the power to the laser beam when you bump into it?\nMine does NOT stop the laser, even if I start shaking the machine.",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Picked up the 10W xTool D1 after another one of your videos. I'm curious if you have any recommendations on protective eye ware for these type of diode machines. While it came with one set, I'd like to have additional sets in the shop. Didn't see any in your affiliate links.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Great review but the proprietary software is absolutely a no go for me. Same reason I didnt go for a Glowforge because none of the software is better than Lightburn!",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I have one of these on order, I have 3D printed the Z height adjuster, I have ordered an air pump for air assist, which nozzle arrangement design do think is best? thank you.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "the only good point of this engraver is that finally someone starts selling these diode lasers with the predisposition for air assist; for the rest it has a ridiculous working area (18x18) and a certainly not budget price (345 €, for the 20W version of such a machine, are a very high cost.)",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "As far as budget lasers go. What are your thoughts on the sainsmart Jinsoku LC-60A? Sainsmart have a good reputation in the budget cnc field for quality and support. Although there are no reviews: For the size, and the included air assist it seems like a great deal at $499 USD. It's hard for me  not to consider it based on the positive reviews of there similar scaled down model LE5040.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I have a question - I need to know if this unit would engrave a wooden pen that has multiple coats of C.A. glue finish on it. Thanks!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Glowforge sells people a dangerous lie. Lasers make smoke and people have died not properly venting a laser cutter. All their marketing gives a very false impression of what it’s like to cut.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "EXCELENT Video, thanks, that´s the way it should be, perfectly explained every detail, you deserve a lot of likes & your subscription",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "I think the title should read \"The Best Laser Cutter*S* for any Budget?\" as it is, is missleading.👎",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Was that two coats of gel stain? I thought it would be much darker.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "Great review, thanks so much!  I'm new to this, and just discovered your channel, and plan to be a regular viewer here.  Already ordered a 10 watt D1, and hope it'll be a good unit to learn on.  I was thinking about using this to cut vinyl for decals and stickers, like the vinyl cutters, and hope there's a way to do that with this machine, so I won't have to buy a cutter as well.  Any advice would be appreciated, happy cutting and engraving to everyone!!",
    "likes": 2,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Very informative reviews. One note: You have the endemic YouTuber problem. Not as bad as most but still pretty irritation. You wave and flail things you are holding as if we should look at them, but we can't. Check when you \"show\" the piece of basswood. You would not flip and wave it in the face of a friend would you? Part of this is also the wild arm wavings and gesticulations like you are doing a rap concert. I bet you do not do that in person either, or maybe people just stand well back to avoid injury. This breaks the personal experience of the video and gives some \"This Old House\" vibe (meaning poorly scripted, over acted). Basically you act like you are speaking to an audience, but you are not. On YouTube you are speaking one-on-one. Just my 2 cents. Keep up the good work.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Anyone ever tell you that you spelled Potato wrong! Unless of course your name is Dan Quayle😃",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Is this the one to buy? So many of them. \nwhich would you suggest",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "i wanted that for ages i'm gona asc papa to build that",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Pl"
  },
  {
    "text": "a'm gona build that to😍😍😍😍😍💖💖💖💖💖💖😘😘😘😘😍😍😍😍",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Pl"
  },
  {
    "text": "I would like to see if you can engrave key caps for a keyboard with it :)",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "The only big point against the Glowforge in any configuration is that it is now and always be dependent on the company servers and steady internet access.",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Hello, can I use a fiber label to cut through metal to make custom jewelry?!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks for the review.  I am waiting for mine to be delivered and I was a little worried of the quality, so you straightened me out.  I did accidentally buy the 5W version but hopefully it'll do what I need, which is just destroy my enemies through engraving and cutting paper and cardboard.",
    "likes": 5,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "\"my shop's a mess right now\" \n If your shop isn't a mess, you're not working enough lol",
    "likes": 1,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "You might want to test the Sculpfun S9, which is supposed to be equivalent to a 90 watt CO2 laser.",
    "likes": 1,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "Nice review, but  the current price is 490 USD, not really sub 300 in my eyes.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I'm trying to engrave some flask, which machine would you recommend?",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "any european alternatives ? Something made in Germany ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello Dear Brandon, and thank for this awesome videos, i want to buy a large chinese  fiber laser machine (3mx1,5m), do you know some good brands to consider ? thanks :)",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Which would you pick for making 3D sculptures?  Like using Photo V Carve software to create the sculpture itself from standard photographs or image files.  And for Terminators are there any in the 40 MegaWatt range?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I need to know, can this cut metal? Or mill out a block of aluminum to a lower?",
    "likes": 3,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Does this have capabilities of engraving glass/round glass cups?  Does it have an option to attach a rotary piece?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "So if  you were going to buy a machine next week, would you get this or the ortur LM2 pro. Thanks for all the great videos.",
    "likes": 9,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Ffs dude you take ages to get to the point, stop going around touring other stuff snd go straight to the point mother of god so annoying trying to find where's the actual part of assembly/setting and run Fe machine for almost one houre, between two videos. I quite now.",
    "likes": 3,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "So is the Ortur Laser Master Engraver 2 Pro still better than the xTool D1 for a beginner in lasers with years of design experience using Corel Draw?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "What about the tilting of the legs? You didn’t do that, but how would you?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "I'll bet you are hearing a lot of \"Let's Go Brandon!\" nowadays. :)",
    "likes": 17,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Hey, have you had a chance to evaluate the new Sculpfun S9?  I've heard great things about it.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Love Mancy? 😂  Oh never mind.. that was on the laser engraver ad that come on before this video.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Have you seen the Oku Desk yet? If so any thoughts? It seems a bit too good to be true but I'm  also very new to lasers",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I received my first laser a few days ago, the NEJE Master 2s plus. It seems like a solid machine for the money, but still a steep learning curve. So far I rigged up my own pen engraving jig (video coming soon) and had a few successful burns... and a few more not so successful, what I call lessons. You pack a lot of excellent info here. I'll have to watch a couple more times. :)",
    "likes": 6,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "which one has a very high resolution? i want to engrave small text on a the case of a chip. speed is not relevant. cheap would be great.\nthanks for your work!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "anyone know if the app is released yet for this machine?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I am looking for a laser first time, I would like to cut a glitter cardstock for a birthday cake topper. I just wonder which one is for me?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "This is a very good video. All the machine components are showed detailedly.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hi. Thanks for the superb and very useful video. I'm about to buy a Chinese 50W machine from OM Tech (or at least I currently think I am!). Could someone please advise me on the laser control software? My drawings are being done in Inkscape and that's coming out fine but I'm a bit unsure as to what laser control software I ought to be thinking about. For example, I don't know whether \"K40 Whisperer\" (which seems like it would meet my needs) can be used with these larger machines. Any advice that gets me from Inkscape drawings to the cut would be greatly appreciated! Thanks in advance :o)",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I think you are the coolest!! 😎 Thank you so very much for all that you do! 😊 Thank you for creating videos sharing everything that you know, or learned thru trial, and error. It will definitely help a new beginner like me.",
    "likes": 2,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Hey can this laser handle slate tile coasters? Thanks in advance",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Lightburn is really good. Well worth the not much money.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Did yours come with any software or instructions mine didn't and I have no idea on how to get it to work.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "It would be awesome if you could make a new video comparing your results with the new “Object capture” feature that comes included on MacOs Monterey.",
    "likes": 0,
    "video": "Turn Real Things into 3D Models with Photogrammetr"
  },
  {
    "text": "Are there any other lasers in this price range with a similar auto focus &  a camera? I'm a little concerned over delivery times?",
    "likes": 1,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Very cool.  Thanks for a great introductory video.  It's appreciated.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "They seem to be upgrading on this one, as they get feedback.. I just bought one for 330$ with upgraded Metal extruder and also added \"New Dual Blower Kit\" to the cart on their website. Since i can see most reviewers agree that the cooling is lacking. This will be my first 3D printer, seems like you get pretty decent build volume for the money, other competitors seem to charge at least 100$ more for the same volume, and still dont give you a touch screen.",
    "likes": 17,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "5:41 $20 marked down from $549 seems a little suspicious...",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Do you think this is a good engraver for hardwoods?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Do you think you could cut 1/8 ply with the 10w D1 by makeblock?\n\nYour videos are super well edited BTW. Good job mate",
    "likes": 2,
    "video": "How to organize a Messy Drawer with a Laser Cutter"
  },
  {
    "text": "Nice and somehow funny, I am just installing pro, industrial CO2 laser with working area about 11' by 5' (3.5m by 1.5m) with 20kW high voltage power supply. (overall consumption of that machine is around 3phase /400V/ 150Amps).  \n\nBut, thank for nice compact informative video.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Would you say that the Hepa filter box actually works well enough that you could take it to a craft  show and not worry about setting off a smoke detector (sprinklers) or causing others to complain about smell when running the laser?  Thanks for the videos!",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "will this be able to cut 10mm wood / acrylic like the atomstack x7 pro?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Good job Brandon! This or ORTUR Laser Master 2 Pro???",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I’m wanting to start and I need to engrave metal drinking cups ets. I’m going to sign up for the class but it states August of 2021. Will you having another one? The class is it still going to be available? I read we can talk about my personal needs correct? I’m just wanting help in the engraving of small things.\nThank you\nDan",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great video for potential K40 owners. And thank goodness YouTube allows me to set playback speed to 0.75% or else I would have missed half of what was said.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Good info, thanks. I built my own laser cutter/engraver using a 15W (optical power) diode laser. The gantry is made using 3D printed parts and 2040 aluminum extrusions. Will need to install an air assist system to improve deep cuts. The only thing missed in this video is discussing how some sellers of diode lasers mislead buyers by specifying the power used by the diode rather than it's actual optical (cutting/engraving) power. As an example, I have another diode laser that is sold as a \"15W\" laser but actually puts out around 4.5 watts of cutting/engraving power. 15 watts is the amount of power it requires from a power supply.",
    "likes": 9,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "In your opinion what would be a good laser cutter that handles a decent size piece of wood or acrylic.  Most of these co2 lasers seem to handle 20x8  . I read your reviews on glowforge and muse.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Nice review man! I have the D1 coming next week with the rotary tool.  Gonna put it through its paces!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Is this more powerful that the new LU2-4 laser from Ortur? How much more would I be able to cut with one vs the other?\nThank you!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Any link to metal engravers? Or a review for metal laser",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can this machine cut out thinner acrylic? I make jewelry with shrinky dinks but I've been thinking about upgrading to acrylic and getting this machine.",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Boy are you off on the asking price looked up as I was watching. 10w $809 suggested $1031.99 which is ridiculous!  It would have to be  gold plated before I could recomend any one trying it out.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Could this cut shapes out of 2mm wood, plastic and acrylic ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "minute 5:41,, easy.. thats to comb your hair dude !!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Kinda wish someone ( or even better a brainstorming community ) would put out a DIY Solution with a BOM one can spec to their needs like the Voron 2.4 3D Printer I just recently built 🤔\n\nI really want a CO² Laser for various projects but the affordable ones either won't fit the size criteria, or the safety standards and the rest is either loaded with crap I don't need and just hiking up the price or even worse not controllable without a connection to a cloud service - Fuck _that_ in particular.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I'm really interested in the 40w laser from the budget section. Would you recommend it for a small business. I have the ortur but it's not giving me the quality i would like (it's my dad's but I mainly use it) so would you recommend it? I use it for leather engraving btw",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  }
]