[
  {
    "text": "Bought a Full Spectrum 18 x 24 machine 3-1/2 years ago at approx. $9,000. Had to replace laser 8 month later. ($600) 2-1/2 years old and Main processor and power supply failed. Called F.S. and got nothing. They had stopped making the main control board and offered NO assistance. Bought a new power supply and Main processor from Light Object and got machine back up and running. Quite different software to learn, but, now I prefer it. I CAN'T recommend F.S. for their customer service or warranty. Just had to replace an axis driver. Another $50 gone! Please do your OWN research!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What would you charge to generate a vector file of Lake Jackson in Georgia and send to me for my laser?",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Welcome back! It's been too long and I'm reall glad to see you haven't abandoned the channel.",
    "likes": 1,
    "video": "Welded DIY Metal Bed, This is What I MESSED Up"
  },
  {
    "text": "Hello, how long continuous work can this machine work, for example only engraving in 3mm comparison?",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Hi great video. I maybe missed it but what Laser watt did you use for Jimmy? thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Here’s a real one. No fish eyed lenses https://youtu.be/WwimocU0IIc",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "there are a bunch of fiber lasers around 2k  usd , just have to ship them from china, i know a good one that i have shipped to the us before.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Would this laser be able to fit a tumbler spinner inside to engrave?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "is it possible to change the engraver laser for a stronger one?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "CO2 laser is ironically the treatment I get for my face/skin lol!\nThanks for the information! Are the first China lasers good for acrylic blanks? Thanks",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "is this machine can laser mark in to metal like alloy or stainless?........ thanks",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Our company's products are mainly laser machines. Those who are interested can visit our website:www.danuomachinery.com",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Felt like you went through my garage and stole all my tools! your miter saw, router, drill press, tape measure are same as mine 😁👍🏼",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "I tried to buy from GearBest and they asked for a copy of a utility bill to \"verify\" my identity. I didn't send a copy of my personal information because that seemed sketchy/scammish and they cancelled my order. I would like to buy one of these but is GearBest the only place to buy it?",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Wow 🤩 how the heck do u know computers and woodwork geez!",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  /"
  },
  {
    "text": "How much this machine l want once where l can buy it please ?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Is there a way to engrave on the leather and metals like copper and silver?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Do you sell this machine? I need another one like this",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Can you leave this machine doing its work while away from home unsupervised? Like, any risk it might cause a fire?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I have been watching your videos with growing interest and some hope in my creative heart! I do have one burning (pun not entirely intended) question. With enough passes, will this machine cut through  0.3 mm hardwood veneer? If so, will it leave discolouration around the edges? And finally, if the answer to my initial question is no, can I purchase upgrades for it that can cut through 0.3 mm hardwood veneer?\n\nThank you for your time in answering this for me. A lot, creatively speaking, is riding on any answer you can give. So no pressure, then! 😜",
    "likes": 3,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hello I’m having trouble linking my same laser to light burn can you explain your settings? Please!",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I haven't been able to find a video of it rastering, outlining, and cutting. Can you demonstrate more how that works?",
    "likes": 2,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Great video!! Helped make my final decision. The 1 thing I did not see covered is on the Chinese 50 watt, some of those models come with a pass through slot. No one seems to know how tall the pass through is. It's frustrating. Will a baseball bat fit through it? Also, Where can I find info on these sprays and powders I keep seeing?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Do you have any knowledge of this being able to engrave denim ?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I would like a review to tell me the differences between the DREMEL DIGILAB, GLOWFORGE & MUSE",
    "likes": 2,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Very new to Lazer printing/engraving. Would you be able to take handwriting and print it into a wood plaque? not really interested in font printing as much as I am transferring my grandmother's actual handwriting to a wooden plaque. She passed away last month and I have a idea of what I want to do for Christmas gifts but the more I watch the more I want to do it myself. I originally found the glowforge but can't justify the price tag at this point. 😬",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great video I’m just starting out with fusion 360 seems a little overwhelming and complicated I’m going to check out your free course",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "It’s all about the time you spend sanding the hardwood...and sanding it correctly, and you my friend did NOT sand that wood correctly. You have to start the sanding process at about a 60 grit and work your way all the way to at least 320 or even finer. 60, 80, 120, 180, 220, 320...in that order. It’s a pain in the ass but if you want a hard wood like maple to look the way it’s should then that’s the way you gotta do it...otherwise leave it raw or lime wax it.",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "Hello, Great video!!!  I‘M new to the engraving world and looking for suggestions on a machine that engraves glass? Picture and/or words??",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great video man! I feel silly for still using Sketchup! It seems so clunky and annoying (web) compared to how you made Fusion look. Definitely jumping ship today!",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Can any of these be used for metal cutting and engraving?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Circle of light from the Sun. Not curvature. Earth is tilted toward the Sun... HOW??? Hahhahahaha!!",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Hey, if you have a tutorial for light burn or laser garble could you link them to check out, thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great video, thanks.  I just want a basic laser which will engrave fonts onto aluminium (doesnt need to cut) I’m in the UK.  Can anyone in the know advise please.  I know a couple of people have asked the same sort of question.  Many thanks.👍🏼",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What are the dimensions, or a building plan? It look great.",
    "likes": 0,
    "video": "How to Make a Kids Play Kitchen: The Frame/Doors/D"
  },
  {
    "text": "Maybe you can guide me a little. I am looking for something that can do designs on polymer pistols (think heavy duty plastic). I would be looking at cutting in maybe 2 to 3 mm in depth max with an average of 1 to 2mm. It would be to adding custom design texture for enhanced grip. Any advice would be appriciated.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great video, didn't quite see which one I should look into though. What would you (or anyone) recommend for burning onto chocolate or pies? Home use, something to spice up parties around here.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Anyone tried to engrave acrylic or glass ? Does it work i should I look for more powerful laser for that?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Nice design... I am thinking of building my own storage bed too...",
    "likes": 1,
    "video": "This is Why I Use Fusion 360 to Make a Bed."
  },
  {
    "text": "Hi, great video - really useful and informative, thanks so much! I'm interested in creating steel cliches for pad printing (for Lego minifigures). Presumably I'd only need a small desktop machine? Also, would I need a FIBER laser for engraving on steel plates or would CO2 / Diode suffice if only engraving???",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great video! LightBurn is seriously the best! I love how they are constantly improving the software to make like easier for users. <3",
    "likes": 5,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Excellent! I've watched probably 15 videos about this machine (I'm considering buying it) and yours is the first one that confirms I can actually cut 1/4\" plywood with it. Thanks.",
    "likes": 4,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "Would the Oturo diode laser cut cotton fabric?   Or even other fabrics?  We have a quilt store and would like to use it to cut out the shapes of fabric needed for kits.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I really like your vid. Please make a vid oon how u make that Catan game tiles. Thanks",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Would this be a good machine to laser flag unions? I obviously don't want to spend a fortune asa beginner to laser work haha",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can i make same detail (9:18) with 5500mw laser head ? Because I love the detail, and i want to use my 5500 mw laser head",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "We have the weirdly similar internet brands. That is all.",
    "likes": 2,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Small note: The laser is still only about 4-5 watts.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I was considering purchase of one of these a while back. I see prices have come down considerably,as they should have!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hey, awesome video!\n\nAre there any 'how to put this thing together/set it up' videos for this specific machine?",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "What is the best laser cutter  to vector cut aluminum foils?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Does is fit good to engrave (not cut) leather ? I really want to buy one but if it is good for, I don't know what laser power will be the best to make fine engraving on leather. If you can help me you'll be the best ^^ (sorry for my english) Regards",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Says in teh video everyone asks about laser cutting metal, addresses this question in reasonable depth in video.\nComments section: \"What laser would you recommend for metal?\"\n\nSeriously guys? xD",
    "likes": 29,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great primer on the basics of laser engraving and the machines available. Thanks!",
    "likes": 7,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "If you like woodworking plans, you'll love woodprix. Get inspired by the endless possibilities of furniture plans and other buildable wood projects, both for indoor and outdoor.",
    "likes": 0,
    "video": "Carving a Baby Groot Planter out of Wood"
  },
  {
    "text": "What kind of laser for cutting and engraving steel and aluminum?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Do any diode laser like the Ortur have a camera option for placement? What do you recommend? I am a beginner.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Where you aware how you said, “looks like Jesus” then said, “Hulk Smash” referring to his discontent of Jesus?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "they don't make 15 watt blue laser diodes , it has a 5 watt , they list the in put power  ( current ) of the laser NOT the optical output .",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Wow this was legendary. I’ve watched a lot of Fusion 360 training material, and this clears up a ton of things that had been confusing before. Well done! This is going to make a huge difference in how productive I am with this tool. Thank you!",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Thank you so much for this, it's a great to see a project from start to finish. It might help to pre-plan these \"tutorials\", you jump around so much, it's difficult to follow along. This would be for someone that has some experience with Fusion 360. Constraints are great, but not really beginner friendly, it would be useful to set dimensions at design time.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Curious why the bottom and drainage holes alignment matters at all - not sure you need a full bottom.  Couldn't you just have a few crossbars that support the internal plants rather than a solid bottom?  Especially if the planter box can't be seen from below.  Just a thought.",
    "likes": 1,
    "video": "How to Make a Cedar Window Planter Box"
  },
  {
    "text": "Great job! I'd love to see a follow up with drawers if you ever got around to it. I love the drill press idea. I was watching Mortgage & Miter, he did a flip top for his drill press but I like the sunken one you did a little more. Easier than a flip top and you can fit more drawers/shelves under it. :-)",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "I need an engraver to cut and engrave metal. Looking for stuff that would work for engraving guns. Any that u would recommend?",
    "likes": 2,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Have you tried the AP Lazer?  They make 4 different sizes, and with a life time of support.  Look they up at aplazer.com.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "tried to watch your video but got annoyed with how many ads youtube stuffed in there when I hit the 3rd ad before 8 minutes of video i gave up will just read the info on your site instead",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I truly enjoyed this video- Im still undecided on either the GF or MUSE 3D, only reason GF is because they offer the discount code and free shipping. But thanks for the videos!",
    "likes": 2,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "the site to get them shows they sell it also for 20watt laser as well right?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Thanks for the review, I am glad I found out that FSL is manufacturing for Dremmel before I make my purchase.",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "great job ! The quality of the videos is awesome. Hope it will work for u ;)",
    "likes": 0,
    "video": "This is Why I Use Fusion 360 to Make a Bed."
  },
  {
    "text": "Does this model etch black anodized Aluminium ? I want to make small nameplates occasionally for the electric motors I build but don't wanna spend thousands for a fiber laser marking machine - eBay is confusing, the seller's of some of the 7 - 15 watt machines say that they can etch anodized aluminium whilst some of the 20 watt machines say that they can't etch anodized aluminium ? - Do you have a video or any info on which budget laser engraver would work to etch anodized aluminium without costing thousands to buy ?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I liked your review of the Ortur. You touched on all the subjects that mattered to me besides $$price",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Dude I’m loving your videos! Great stuff. Is there a laser you can recommend for use with an iPad? I’m a graphics designer and want to maybe engrave wood",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "everything is an import from china, dont matter what brand label is on it",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "TO EXPENSIVE THIS MACHINES............. THESE THINGS SHOULD NOT COST MORE THAN 1,000 DOLLARS THEY ARE ABNORMAL CRAZY .... THAT'S WHY THEY DO NOT PROGRESS ... THE APPLE SELL THEM BEFORE AT 10 THOUSAND DOLLARS THAT DOESN'T HAVE LOGIC I DON'T KNOW WHO IS CRAZY WHAT THEY DO PUT THESE PRICES.    I HOPE IN THE FUTURE THE LASER MACHINES WILL BE SOLD AT LOGICAL PRICES.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "So you set the parameters in your base project, and then they were available in all the subcomponents? That's not the case for me - what did you do to make them inherit the params? Btw the other Beginners videos I watched didn't highlight parameters like your video does - seems like a major feature, so good job with that.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Ortur can certainly cut. But it requires multiple passes. \nI got the snapmaker, and it does a great job cutting, mainly because it has a Z-axis. You do have to calibrate the Z-axis height for whatever material you use.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I wonder if I can put my router shanks and make it work with those ones. I have a small manual router (those 300 watts sold everywhere) and came with a 6mm straight, which I think could use it.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "ZAR stain is a surface stain from Ben Moore, I use that for finished pine and maple. Also, I wipe denatured alcohol with some water on the wood before staining.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "Super useful video, probably the best one i found. I've been getting into PC Modding and looking for a Laser that I can use for etching/engraving logos into Tempered Glass. Not entirely sure what the best ones would be for this kinda work? Would a Ortur get the job done?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Could I use this to add a logo on an aluminium can?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "just curiosity....how did you get that scar on your face?",
    "likes": 1,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "It’s amazing I also had a glow Forge ad in the middle of this video. Never had one before",
    "likes": 14,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Absolutely off topic, but that water is bottled not to far from where I’m from. Lol",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Would this be able to cut vinyl stickers . Trying to avoid having a seperate vinyl cutter",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I'm building my own skateboards and hoping to engrave small pictures on the boards. will this work for that?",
    "likes": 4,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Houston we have a problem. \nThere is a ballon flying over the earth.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I’m trying to really primitive designs, cutting through thin sheet aluminum, but at most 20x20 inch. Would those Chinese laser printers be good for that? If not which one would be?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I need something that can cut between 4mm-6mm clear acrylic sheet. Looking for something that can cut 18”x11” sheet. Any recommendations?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I just bought this laser.  I'm having trouble burning through acrylic paint down to the wood and having it look clean.  It looks distorted and doesn't burn clean down to the wood.  What other lasers does the Ortur accommodate that also accommodates lightburn?  Any ideas?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "You do go quite fast for beginners - I had to pause and rewind several times - BUT the information is very good, I was able to follow along (with a little extra effort), and I appreciate you putting this together :-) I especially appreciate you including parameters from the start; that's a very handy feature I'd not seen in other beginner tutorials, probably one I will use in every single project.",
    "likes": 7,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Hi.. which laser machine do you suggest to cut sterling silver sheets for jewelry making??  I read that 50 watts is enough, but i'm torn on which laser machine is best for it.  Please advise!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Do you think this would work on leather for monograms and small logos?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "This here a real big, injun checkup. Yale have the devil's workshop instead o some needy van home scorner of the west.",
    "likes": 0,
    "video": "Build a Rubber Stamp with a Removable Handle // DI"
  },
  {
    "text": "So I have a question?  how does this laser gets delivered ?  is it UPS, FEDEX? and does driver call you before arriving with your laser?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Will this work on leather? The website also looks like it's an extension of alibaba or aliexpress. Is it made good, not cheap made? How long do you think it would last?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Branden, will you last engrave or etch brass key blanks?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I can't tell you how useful this has been for me right now.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Nice , I need A4 size Cutter & Engraver , it's it available in India",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "great video!!  quick question, i want to do some light cutting up to 1/4 of an inch and need some very find detail engraving on anodized surfaces.  I make yoyo's so the engraving would be in the bottom of a yoyo cup.   I was thinking about the machine you talked about at 3:32 mark of your video.   Thanks.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi how are you,, thanks for share..with you recommend for graving Stone ...Gracias",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Question....\nCan i engrave metal with this? \nSteel \nStainless steel \nPolymer \n\nI dont need deep cutting, just on the top engraving.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Beautiful work. My favourite herb is basil. About 3 minutes 28 seconds you have your head so close to the blade. Please be careful!",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box"
  },
  {
    "text": "Hello! Asked this in your review video for different lasers, but I wanted to comment on your most recent video so you can see it! Love your content, I want to laser rubber stamps. Most stamps require about 1 to 1.5mm of depth in cutting to differentiate the printable area from the not printable. I saw your review of the Ortur, and I can get one with a little more powerful laser. (20W instead of the 15W, which as you pointed out is really like 6 watts vs. 4 watts) Do you think that will do the job? Thank so much!",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Great vid! I was hoping to make rubber stamps, usually the lasered ones go tops 2mm deep, probably 1 to 1.5 max on average. Will a Diode laser do it? Or do you think I need something bigger? Thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great video and explanation.  Curious to hear your thoughts on a Thunder Laser Nova 24 60 watt?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Do you know a good CNC machine, bit or laser engraver that would be good to engrave smaller pieces of acrylic?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Funny story... the ad that popped up at the end of this was for the glowforge laser engraver LOL",
    "likes": 9,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Totally impressive with the 360 view.  Very steady photography. Thanks for sharing.",
    "likes": 9,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Have you tried cutting vinyl stencils or masks or removing anodized aluminium?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi good day. Thank you for your reviews. After watching all the lasers covered in this video, I'm not certain which laser is best to get. \n\nI want to make greeting cards and other paper related products. Which laser would you recommend?\nI would prefer if the software is not mainly on the net, already assembled and I wish to buy via Amazon. Thanks in advance for responding.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What do you recommend for simply engraving names and time on finishers marathon medals??? Im thinking about getting a 20/30w laser.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Have you heard if the 45w is not a true 45w tube but a 40w pushed by an inadequate power unit?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Who would have thought a free 7k machine would be good.",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "What do you recommend to engrave polymer firearm grips and metal magazines?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "i wanna get the glowforge but hydroflask doesnt really fit in it... for engraving which one would u recommend?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "what’s the best and cheapest laser to use for clothing such as jeans and jackets?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Want to get into laser stippling polymer gun frames and engraving and etching gun parts. I'm too old to understand all this tech. Most confusing thing I've ever looked into.",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "That laser is actually a 4.5 watt, the input is 15 watt, little deceptive but nevertheless it's still awesome.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "You should Review Gcc, Epilog and Trotec as these machines you have reviewed are basic ones",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What bit did you use to carve the rubber stamp? The size and name would be great! And what was the speed, depth you used? Thank you",
    "likes": 0,
    "video": "Build a Rubber Stamp with a Removable Handle // DI"
  },
  {
    "text": "I need to engrave a bunch of plastic key fobs with sequential numbering. I would like to line the bed alright a bunch and fobs and have it jump from one to another engraving the  numbers. I am thinking this might be a good time to get a laser. Can you recommend software and a laser that would be good to consider?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "$325 is not very close to $200 - the 7W is under $200",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Awesome project! I do not have those tools so if you were to sell one, what would it go for?",
    "likes": 2,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Looks great!  BTW.. Lightburn also works on Linux, which is where I use it...",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Looking to get a laser primarily for engraving glassware etc. using a rotary attachment. Watched your videos on laser comparisons but wanted your opinion on a few with this capability. Is the K40 suitable or any of the Chinese lasers? Should I skip the Chinese route and pull the trigger on a machine better designed for this application? Your advice is much appreciated.",
    "likes": 2,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "I just need to burn an outline of a dragon onto plywood. Do you think I can get away with the cheaper cutter? I dont need to cut out only burn a outline",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi, what would be an economical options to engrave on wood cutting boards ?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I have one question though, when I try to merge my road data in illustrator, all roads inside my frame (white artboard?) disappear. What could I be doing wrong?",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Hey dude, I don't normally comment, but I just wanted to say that this is an excellent turorial! Big thanks to you lad. This is exactly what I am looking for!",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "I'm just starting out and learning some things and I had my brother give me a miter saw. So I'm trying to change around my garage/shop and have been looking for ideas. Pretty good video. Got any pointers for me, I would appreciate it. Thanks.",
    "likes": 1,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "Table looks cool. Gave up repeatedly trying to see what you did that I missed .  Moving way to quick and clicking on stuff without saying you are.  Still as I’m brand new I still learnt some things.  Any lesson is still a good lesson I guess",
    "likes": 3,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Wait why you dissing lightsaber pikes  out of nowhere literally Jedi temple guards’ lightsabers are some of the coolest sabers ever. Plus Pong Krells great sabers but The Temple guards’ are personally my favorite",
    "likes": 2,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "What laser would you recommend for etching on jewelry wax? I do lost wax casting of bronze bells and want to be able to decorate them with very elaborate designs",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "If I want to print onto leather whats best the first one you reviewed",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Brandon you skimmed over how to engrave metal and never really said it was possible, it is we hire someone to do it now.  I need to engrave aluminum lids for our Candle line, 3.5\" x 3.5\". How can I best put our logo on the aluminum lids?  Quality is not the issue but speed and volume is the issue.  Which unit would be best.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I want to make jewlery, I want to be able to cut through 10k,14,18k gold, silver and other metals. Do you have any laser recommendation for this?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I Like To Make Stuff made this same thing a while ago like the exact same design",
    "likes": 1,
    "video": "Building a Simple (and Cheap!) Miter Station + Sto"
  },
  {
    "text": "Which one is the best to make for custom necklaces . ? 😭😭",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What would I want to look at to cut 16 gauge copper sheets? Great informative video",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Any idea if laserpecker is any good? Costs around $300 and software looks easy to use.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi Would you recommend this laser for Denim Jean engraving?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great video. Have you filmed you doing any tests with the free software?",
    "likes": 9,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "If I'm just looking to use this laser for custom denim work, should I even justify spending the extra money getting the 20W or should I just stay at 7W? I wouldn't mind using it for other things in the future possibly but if it doesn't change much I don't think spending the extra money is worth it, please lmk!",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Could anybody give me a good suggestion on what engraver I should get for creating custom jeans? That's really all I'm interested in using it for! Please lmk! Would really appreciate any insight",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello! I was wondering if you would suggest this unit for engraving the exterior side of bracelet's ?",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "When attaching a laser to an existing cnc machine how hard is the wiring side of things?  I have zero experience with laser engraving but have been using a cnc for about 6 months now would be nice to have the 2ft by 2ft area my cnc offers by adding a laser to it.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi there, I have just send you an email, can you help please? i need to buy a laser and engraver machine whith a good price 300$ tops",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "im looking to create my own line of bullion silver rounds 1 oz silver anny somting small requirements engreive and mark and eable to engrebe de rings in te coins can you help me pick a machine?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What are your thoughts about the Kickstarter Wainlux K6?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What the big difference between buying a 50W Lazer or  100w Lazer? Trying to decide if I should spend the extra $1000",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "A little hyperactive maybe?  Slow the f down with the pointless edits.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Hi it’s really great to see comparisons of laser and engraving printer but am not in to these things so I really need advice to buy one which I’ll use for cutting and engraving but am confused and i want to start learning so what do advice me bro",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello. What is he lifespan of the laser tube? How many hours of use you can  get out if it using properly?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Building high tech rockets no\nAttaching a camera to a balloon yes",
    "likes": 0,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Can you pass through a piece on the x axis longer than the unit such as a longboard? and can the 20w version handle engraving on acrylic sheet/plexiglass?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can I etch glass with all of these?  Looking to replace having to screen print on glasses.  Thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Where can you test your material with a laser cutter? I have some plastic pieces <40 mil (3/64\") I want to cut. Plus some thicker pieces ~1/2\" made out of a foam plastic.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What's your opinion on the Cubiio 2 running on Kickstarter?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "know of any good ways to aline/square the piece to the laser? Thanks for posting these videos.",
    "likes": 7,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Good timing finding this video. I am currently getting quotes from Chinese manufactuers on Alibaba and Aliexpress to buy a CO2 laser engraver/cutter. For what I am looking to do and for the tiny budget I have it will be the right way to go. I'm upgrading it to a 150w and it's a good size (900x600mm) cutting area. I would love to get into cutting metal but will have to wait until I can afford a fiber cutter I guess. Thanks for the video, helped heaps!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Awesome video thanks! I am struggling with my birch butcher block, omg what a nightmare, i am having to remove all the poly and stain right now. I am worried about making the same mistake. The poly looked horrible, i think we used a minwax Oil based poly, on top of my Kona Gel stain .. .I think we did the same thing with the stain i didnt let it sit long enough and wiped to much off. it looked nice in the begging but the next day it was faded quit a bit. But it wasn't that bad., WE covered it with some poly and it was horrible looking made it look faded even more??? no idea why? I put down a the butcher block oil on the butcher block before staining not a oil based pre stain. I have no idea but i am looking for idea on what to cover my stain with, i do NOT LIKE POLY at all. It was so plastic looking and showed so much flaws along with looking cloudy. .",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "Thanks for sharing this technigue!  I'm framing a picture for my oldest son and plan on using this style.  \n\nHow did you plan your cuts to ensure the artwork fit inside the rabbet?",
    "likes": 1,
    "video": "Building a Picture Frame Ron Swanson Would be Prou"
  },
  {
    "text": "Great vid, \n\nHowever, if i wanna get atleast 24\" x 12\" bed size, which one would you recommend? The chinese laser, that you meantioned and linked, only has a 20x12 :(",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hey cool video man. Can you tell me what you would recommend if I wanted to engrave flat faced juice bottles at a high volume? Like about 300?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "nice review....when $ is no object....My advice for anyone is read reviews and watch a lot...a lot of videos. Then so you dont throw your $ in the ocean....buy a K40 laser. Ya i know, its chinese, its unsafe, etc, etc..... you dont have to be a rocket scientist with these....i bought one on amazon, did a tweek here and there. I use inkscape (free)....and scorchworks (free) to use this K40 laser, and it works great....dont have to deal with chinese software.... you learn alot, the cost is super minumum.... if you dont like it, or you get bored with it, sell it on craigslist for  $200....lesson learned.\nsooooo. to wrap things up.....Couple years ago, i built my own. bigger and better c02 laser and still using free software. Cost me $1500 to make, and i have more than made up the cost to make it.....life treating me fine right now....retired. Learned off the K40, reading reviews, watching you-tube videos......then make your own.....cant tell you how many people have made their own.....a ton.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi!  Great video. I have a question as to the name of the laser the Orturo comes with?  Is it \"something\" grbl?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Wow so elegant! Done watching till the end my friend😊 waiting for ur hugback 😊 lets support each other till the end ❤",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "I'm seriously considering the furniture Fusion 360 class however is these any cross over to cnc router use?? Plus is there any live interaction with the class??",
    "likes": 1,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "Super helpful video thanks!  Toying with a free kitchen island butcher block on wheels I came across and trying to stain and turn into a work bench of sorts... eh- in any case- Does the pre-stain step help with the tacky shenanigans I am dealing now from my stain? Clearly my rookie skills has missed a step it seems-  start over and pre-stain to gel?",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "thanks for this great video - so many types, it's definitely hard to decide - I am totally a newbie just looking to get started - I want to be able to engrave wine glasses and tumblers - what would you recommend?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "The off gassing from laser engraving is a serious health risk and kind of my biggest worry.  Everywhere I've read, just piping it out the window is no different than pumping it into the room since you're not filtering through a carbon filter.  What are your experiences / knowledgebase on that topic?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Hello Sir, I must say this is a really great video. Thank you for sharing. I have about 4g to spend on a unit. Not saying I will, but I am lost. I want something for my logo design and coffee shop. What is the best machine to cut glassware, engrave ceramic or porcelain (Hot cups), and logo stuff (computer tops, rocks, wood, leather) please help, or is there a breakdown list I can refer too, for example strength of lasers to what it can do. Been looking for weeks and still confused. I was going to go with that Chinese version, but then I saw your video.. Thanks for any help.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi  great video, can i make cardboard puzzles with this laser cutter?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "High extreme noob question, but do most of this laser engravers work on glass or metal too?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "i was never told the earth warps up & down ok it is fish-eye lens. i just need someone to debunk flat earth but using fish-eye lens will not work on me.",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "New sub awesome videos. One question are you able to engrave a firearm slide. Curious cause I’m looking for one tht can also do tht",
    "likes": 2,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Literally had a real glow forge ad cut in right after you finished talking about it 🤣🤣🤣",
    "likes": 66,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I want to start  a little  business  with this works well let me know  i  love this",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great job sir!!\n\nWant to use:\n\"Acrylic cuts & engrave , wood cuts & engraving also on coffee mugs engrave\"\n\nHello, I want to do Laser work and I was looking at the Glowforge but it cost so much for me at start-up and I'm new to using Lasers.\n\nYou talked about Ortur and Snapmaker 2 as low cost.\n\nI must say I don't know anything about running graphic programs so that's why I was looking at Glowforge push and cut type of system.\n\nI was to make my own Christian product line.\n\nPlease help me\nThx",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Leather and steel, does it engrave on these surfaces?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I bought excellent handbook from woodprix website. Just google woodprix and make some dust.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "real good tutorial, but a lil too fast for non nativ english speaking like me (im from germany). 👍",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Im looking to customize firearms so there will be some polymer and metal etching. Will this wattage do the job?",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Do the plans use mortise and tenon joints, or dowels? great work on this!",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodwor"
  },
  {
    "text": "could you upgrade the laser with something aftermarket",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Would the diode laser be strong enough  to engrave on granite?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hey dude. Love your video. I am new to laser engraving. I need to engrave faux leather, ALUMINIUM, plastic and bamboo. Will this machine work ? Pls advise. Thanks for the video again. Cheers",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "wow this was such an informative video. well done sir",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "apparently everybody can figure out where's the camera except for me. The more I pan the more confuse I get.",
    "likes": 2,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "nice video , now how can i switch my drawings from sketchup to fusion 360 ?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "can you please try it on key board dose it work \r\nhttps://www.youtube.com/watch?v=6aH5imXGlHA&list=LLetBZwlr0h_p6U9bTNqkcQg&index=3&t=0s",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I have a table leg with a square at one end and a circle on the other. I have tried extruding and tapering with a plane in the middle but it just extrude the square to the circle and doesn't morph the shapes.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "I was looking at the 20w version but you said something that made me confused. Its advertised as a 20w but you said sense its diode it's more like a 4w. Do you have a video or an article that goes into more detail?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can you do a video using the pass-through plz...great video BTW.",
    "likes": 4,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Sir can you give a suggestion what laser cut machine I need to cut a 3mm acryluc and engrave it?  Working area is at least 50cm × 50cm and budget 1500 to 2000$",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Nice video. Wish you focused more on the higher end lasers but not really your target audience and not something you have in the shop. I wouldn't put boss anywhere near epilog. \nFor general use CO2 lasers I would do a list like this:\n- K40 + upgrades\n- 50W ebay/ali chinese\n- 80W ebay/ai chinese\n- All in ones or what you call kickstarter lasers (including the more expensive dremel brand one)\n- Branded chinese lasers with local support (boss, thunder, aeon etc)\n- Finally top tier RF lasers (epilog, trotec, ULS etc)\nThere's plenty of specific machines that fall outside those categories. Like aeon having an 'all in one' style series and thunder laser having RF source lasers.",
    "likes": 4,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I want to cut out mother of pearl to do guitar inlay into a fretboard, can a laser do this?  Would the 50watt one do this?  Thank you. dan@wemorph.com",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Well i debated whether or not to even take the time to learn sketchup and i finally did. I use it for plans to accompany my videos and for client pitches to give everyone a clear understanding of exactly what will be produced. Now that I’m somewhat proficient in sketchup, of course, they make the announcement that it will no longer be free in the near future, so it seems like Fusion will be the way to go. I’ve heard a few folks plugging your new 360 course and since folks who get my plans won’t even be able to view the models for free, it’s looking like I’ll be making the switch in the near future.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Thank you for review . I need a good laser engraver for 35 cm acrylic . What do you suggest not more than of 1500$?",
    "likes": 3,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What happens when you force a larger \"print area\" by putting the item to engrave further away?  Would it take longer to produce an image or no image at all?",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "that laser is expensive and is it really worth it so over a k40?  I cannot see why I would buy this and not one off the others lasers to be honest, is it really that much better?",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "the channel i was looking for so long, you are doing a great job",
    "likes": 2,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "Hey question, I have a 3W laser and it's pretty small working space and can't do much with high quality images. It's a lot of tinkering and very poor resolution diode laser. I'm thinking about getting the Ortur 20W with the bigger working space. Do you think that would be able to give me better resolution? I like the larger working area with that one but I need something that would cut thin pieces as well as engrave photographs. Can you help me ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "As others have said, there were a lot of skipped details for true beginners. Not necessarily a bad thing, but it was a little frustrating. I still watched it and appreciated it. Thanks!",
    "likes": 5,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "I'm glad you mentioned a fire extinguisher, as my first attempt, I set fire to the board, with having the goggles on didn't see the flames, but the smell got my attention quite fast.  \nlaser ok, flat ok, cat left home!",
    "likes": 3,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Does the cheapest one cut plexiglas or acrylic sheet? To what depth? Thanks.",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "It would be really nice to see how exactly you made the topographic map. Start with getting the data to setting it up in QGIS to burning it in Lightburn. I would like to make topographic map that incorporates land and sea if you could show how to do that I think alot of people would really appreciate it. I can't find alot of good information on setting this up. Thanks in advance",
    "likes": 12,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Hi I ‘m very interesting in your videos and machine, could tell me your contact info?",
    "likes": 0,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "if you are going to make a engrave for a  larger photo do you need to adjust the size in your computer or it will adjust automatically, thank you in advance .. watching from Philippines",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great video! I was wondering if you took the bottom off and tried engraving something. I would really appreciate a video on how that works!",
    "likes": 3,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "which is better for cutting and engraving leather?  Muse 3d or Beambox Pro?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "BEST have biggest what can buy and cheapen what have world, less than 100$ and 40-100W power",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi there! can you tell me what kind of air exhaust / fan you use? Is it one from FSLaser? I'm debating between the Muse 3D and a Glowforge, do you know if I could use the AC Infinity 6 fan (same fan that many Glowforge users use)? I'm not sure which fan to pick if I go with the Muse. Thanks!",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Sketchup has never adapted to 3D printing and struggles with small objects. This has some work arounds but the program is basically for architectural design. Maintaining solid mesh and other objects is often difficult with Sketchup.\nFusion 360 isn't perfect either but it has so many builtin functions that most things seem to be possible. \nBlender has so many modes it's frustrating for 3D printing and engineering design. It's so hard to get into I gave up.",
    "likes": 2,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "5:15 Maybe you can pretend the Death Start was still under construction. ;)",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Hey I would like to cut wooden letter in cursive what laser u think would be good for me",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Would this work well on a silicone watch strap for initials? Thanks.",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I noted that you never mentioned if this laser would would on leather...I'm assuming that it will. Can you comment on this? thank you.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "They look awesome! Quick question. What size boards did you use for these?",
    "likes": 0,
    "video": "Simple Wooden Book Shelves (for a nursery!)"
  },
  {
    "text": "Hi , we are manufacturer of laser machine and cnc router from China, I can give you more detail and quotation, my whatsapp:+ 86 13539465576; our web: www.sequoyatec.com",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Snapmaker is the best i think\nThank u for the video",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Thanks for making the video, is it good to cut through 2mm thick arcylic? Also let me know about which files fomats this can run, like .svg, .dxf",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What do you think of the LaserPecker laser engraver? Is it worth getting?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi sir. I'm from India. I interested in laser engraving small scale business. Plzz suggest me. Which one best engraving small scale business for machine.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "We have been looking for a larger footprint laser to cut some foam board for making RC airplanes.  Would this machine work for a good entry level cutter/engrave for foam board?  Thanks for the video.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Which laser engraver would you recommend for a barrel head?  Thanks 🙏",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I was in a hurry and didn't add dowels to the table slats.  Not sure how to ensure I don't get warpage that will ruin the table and the effort i went thru to build it.  I used a combination of wood screws and 2.5 finish nails with nail gun to join the wood.  Can I add wood glue as a last step before staining and sealing?",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "What kind of wood are you using for the street map example?",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "02:48:33 passes by again (rotate your focus to the sun)",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "great video, just a tip, it would be good to see less face and more woodworking.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Great video! Thanks for the information. I also took a look at your full review. I am just starting to dabble in the world of laser engraving. My question is can you buy a more powerful laser for this unit later(forgive my ignorance)?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "someone actually made this lightsaber out of aluminum and has his own youtube channel his name is VICTEC INDUSTRIES.",
    "likes": 1,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "Really awesome man. I hope this'll get much much more viewers",
    "likes": 5,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Hey you mentioned that you were using Lightburn in the video. I was just wondering which version should I buy for this specific use case. Is it the DSP License or the GCode License?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Well this allow me 2 engrave onto a AR lower receiver? Not trying to cut anything out just trying to catch a few patterns into the T-7071  aluminum",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "The Earth is flat.\nTake out the Bible and thank God for creating beautiful things for us.\nAnd ask him to forgive you for going wrong.\nHe is waiting for you, he is waiting for everyone.",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Could you program a design onto a glock plastic pistol lower",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I would like to see a test on clear acrylic it said with craft paper in the listing. Been looking no one seems to show it done except with big lasers.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "YOu may know this by now but clear acrylic does NOT filter out laser light.....",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Lightburn is hands down THE best laser software out there. I've tried em all. (their nomenclature is a little odd but still the best). \nNote: scan = fill  and cut = outline only",
    "likes": 8,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I see in the links that you link to a rotary attachment.  I did a search on the video's but did not see one where you had tested it out.  Have you used it on the Ortur 2?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "can you tell what type of laser  head, is being used",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "Watching for the F-16 flybys really gives you an appreciation of how crazy sharp the eyesight of fighter pilots has to be, to spot and track threats. I know they have radar, but in a dogfight, tracking the other guy is still mostly done done by keeping their head on a swivel. And trying to discern which way he’s facing, whether that’s his canopy or a false one painted under the nose. Sometimes even watching for the movement of control surfaces to telegraph a roll or a turn.",
    "likes": 15,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Jimi Hendrix is spelled Jimi not Jimmy, great video though. Very informative!",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "can it engrave on metals like aluminium, brass, etc.",
    "likes": 3,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Doesit work on metals like aluminium etc. Could you please send some of videos that works on metals using small leters.,, i am interested on this item.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "General finish recommends wiping it down with mineral spirits right before applying the stain on raw wood.",
    "likes": 8,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "I am thinking about getting into Engraving. Question what would you recommend for Engraving on aluminum and Metal? This will be more of a little Hobby not something to make money off. also wanted to be versatile enough in order to do other material paper wood leather stuff like that",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "This is quite advanced stuff, and the pace is quick and a lot of the steps are simply skipped. Great stuff, but this is not for \"absolute beginners\", don't get frustrated if this is too hard to follow.",
    "likes": 3,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  }
]