[
  {
    "text": "Just stay away from cheap gantry lasers. I believe their ad of being great for beginner but it burnt in a month. Then I got mad and bought a professional commarker fiber laser. Finally satisfied. You get what you pay for.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Gonna say AI make it much faster to find new ideas for my commarker omni to engrave. Especially wood puzzles.",
    "likes": 0,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "I would like to know if xtool has 3D subsurface crystal engraving laser",
    "likes": 0,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "Is that truth that this kind of device cannot stay unused for longer than a day or two because the ink is getting dry and may damage the printer?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "300 usd for set of 700 ml ink in total? price for ink is actually not that terrrible. That price is going to the way it is right now but in time it will drop a bit.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I'm really interested in the xtool ps2. The biggest question I have is about their customer service. I've seen some reviews that speak very badly about results and responsiveness. Can you give thoughts on your experience? I do worry about them being based in China, and if there would be issues, how quickly issues would be resolved.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi Hi, Is the file still available for download? Thank you",
    "likes": 0,
    "video": "I Made This Book Nook With A Laser, Can You Tell?"
  },
  {
    "text": "Wow! I can’t imagine my self doing all of this process with every picture etc. So difficult",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "Well this is exciting. Now we just have to wait for costs to go down.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "less than $5k but the UK branch is charging nearly £7k, around $9.3k. Almost twice the price which is less than nice.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "When you back this kick starter,, does it come with one full set of inks or 2 ? or just the one they're saying its a bonus but actually only 1 set",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Hi do you have any ideas can we use laser to do 2.5d wood engraving? I saw someone did a rough test with commarker omni but wonder could we do something better.  I do have an omni uv.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Could you look at one of the ink cartridges and see if there is an expiration date on them?  If so, how far away is it?   And, if there is an expiration date, will the printer be able to use the ink, after said date?   Especially for low volume printing  (just a few pieces here and there), this could significantly drive up the cost of ink.   Could you check on this for us please?  If you have any clarifying questions, just let me know.    On my printer (not this one), the ink has a \"chip\" that communicates with the printer-- the type of ink, the color, and.... the expiration date.   It will cease printing, if expired for more than 2 months.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Meanwhile all we have in Brazil is a bunch of nasty clueless importer andys trying to sell overpriced K40 clones with a logo stamped on. We are cooked.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "The estimation of Epson and Roland ink costs and ink usage is way too high. From personal experience those printers use much less ink and cost per print is much lower. However the units are higher and units are configured for daily production printing. Do you feel that the Euffy is set-up for occasional or low-volume users?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "What is the best of these fiber lasers for engraving on gun steel such as Color Case Hardened Steel and other hardened steel used in firearm receivers and barrels?",
    "likes": 1,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Can it print on like, not flat glasses? Like win glass?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I would say make sure why you are  buying a laser. Laser business is not something money just run into ones door.",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "So if we were to sell aftermarket uv resin ink for half what they are charging would there be enough demand?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I have a 4 colour laser printer a set of toner cartridges are more than that.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Forgive me if it was mentioned in the video, what are the maintenance/repair costs besides ink? Does Eufy offer a maintenance/repair plan?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thank you for the super helpful video where ink price has been my biggest concern.\nAt 5:21, it was a cartoon image of you. Does Eufy provide the software/app to convert a regular photograph into something like that? I thought that was really unique.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I use Lightburn with my OMTech 20w fiber laser. You can cut/engrave pretty much anything (metal, ceramic, stone, metal, etc) so long as you're patient and willing to wait. Works fine, but I wish I had 80 watts.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "12:24 how do you not print Han Solo in carbonite? 😅",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Is it somehow possible to print transparent colors, basically RGBA?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "17OO bucks! for printing a picture/s on a piece of wood??? - are you stupid for real or ...?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "It costs me $500 to replace 4 toner cartridges (CMYK) in my Canon imageclass colour laser printer.\n\n$300 sounds like a bargain for 7 cartridges considering the yield—for a UV printer I mean.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "the Kickstarter page says that it has a one year warranty.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "The best laser engraver on a budget is one that offers good power, ease of use, and safety features without breaking the bank. I use the Monport Mega and love it because it has autofocus, a safety enclosure, and delivers great results for its price.",
    "likes": 0,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "Can you tell me if the app is downloadable to a desktop computer?  Just ordered this from your link :)",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I noticed the mug is the same in all video review of this printer, was it given to you by Oufy make ?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "How much ink does it use when it sits there cleaning itself? This was the biggest ink use on an Epson.",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Looks pretty cool for what will be nothing more than e-waste in the near future. Proprietary ink cartridges and the subscription means that the backers have to pray the company stays in business forever - which won't happen as it has an overall tiny customer base. Prices will increase and lower tier subscriptions will be nerfed to support the business. If you can't own it outright and buy replacement parts freely from competing vendors, it's not worth the novelty.",
    "likes": 10,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "It's cool that you can misalign the material and print & cut still works.  I assume when you say laser you mean the red dot pointer, mine always seems to be slightly off.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I wonder if you can use the 3d depth map of modern phone cameras to instantly have a 3d printable image without having to use AI to generate the depth. I imagine this would be extremely popular and enormously make a viral hit with a much larger consumer base. Imagine instant accurate 3d image capture that we already own translated into a 3d print with perfect color. I wouldn't be on the fence of backing the kickstarter if this already exists or had a real potential for being a thing.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I've been dealing with UV printers for a few years now. I can see this printer turning into a $1600 paperweight after a few months of use. At least with current UV DTF printers you can take the whole thing apart, replace the printhead, lines, dampers, fill it up with cheap non OEM ink etc. There is too much proprietary tech with this one.",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This is going to become a money pit. having to pay to be able to clean the machine, is a red flag. Plus a subscription based software plan is also a huge red flag. Trust me, eventually the free version will do less and less, and the subscription costs will rise as will the ink prices. Everything could be a little cheaper, but the paying customers are paying for all the free machines and ink the send out to all the internet shills.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thank you for all this information that you gave us about all the lasers you got so many of them. I was thinking about the craft cutting fabric would leather vinyl and metal any kind of metal PVC which Lazar would you recommend?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Offset Fill and Fill what an absolute brilliant tip. I was just setting up my first real test job and that tip shaved 4 minutes off a 6 minute task... thanks",
    "likes": 0,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "ink cost and a subscription are deal breakers for me.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "until they fix their bidirection firing will not be looking at it.",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Seeing your 3d printers in the background, I wonder if you can print on PLA or PETG.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I have seen screenshot that showed three subscription levels in the software. Something like \"Personal\", \"Business\", \"Professional\" or similar? Does that mean you can't use the Personal edition to make sellable items?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Would this work for printing waterslide decals on clear waterslide decal paper? is the ink opaque or would you have to print the white and then the color? I'm guessing on small fonts there could be registration issues?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Why am I getting vertical line artifacts on the brass for the 3D image ? Is it a frequency problem or power or more powerful cleaning step settings ?",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "Printer ink per liquid oz is more expensive than gold.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Also, can you upload more cost per print via bigger prints. Like a4/5",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Is it safe to print in apparent room that children live next rooms? Room with windows.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Where I can find informations about the ink price ? and how to order it extra ? I didn't  found any infos on kickstarter page ? I mean how can I order extra set ?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "What would be the best laser metal engraver for around the $3000 range?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Thanks for the great video. It gave a LOT of information on the various categories of laser cutters/engravers. Really appreciated. One thing, though: if you could speed up your speech a little more you might be able to actually use your voice as a cutter/engraver! Ha Ha just kidding, but you do speak rapidly (though in sections you slow down so I know you CAN do it).",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "YOU MUST say to people that if you do engraving on glass with a CO2 you could crack or damage the glass. And a UV laser will NOT and the finish will look like was sand blasted, a gorgeous finish with uv , and a not so good finish with a CO2",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "This was very helpful.  Thanks for answering all the questions and working with EufyMake to get answers to ones directed at them.   Looking forward to your next video!",
    "likes": 6,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Better consider the cost of the consumables, any potential subscription and the quality of after sale support service. \n\nThis video seems like hiding all these on purpose. Good luck.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Hi there! I am going to be buying two machines very soon, the business I work for is closing down and I need to find alternative work. Looking at the Thunder Bolt with the necessary accessories I have it at 6,530.00, the xTool P2S with necessary accessories is right about the same at 6,560. Any recommendations on which one I should get? And for a second machine would it be best to get a xTool F1 Ultra or an Apparel Printer that does Print To Bake? which do you think would give me a better spread to cover more ground? and any suggestions on one? I am very new to the field, watching your videos and motivated to get my feet wet and start working hard! I appreciate any advice you can give me. Thank you.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "my guy, you don't need.....ai to remove a backround. lmao love your grift thoe",
    "likes": 0,
    "video": "Create Pro Product Photos Instantly (No Fancy Setu"
  },
  {
    "text": "Do you even know how to pronounce a period at the end of a sentence?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "out of curiosity, is there a way to use that printers color, paint with it like you would with oil or acrylic and then cure it with uv light?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I would like to paint fill lines or logos/lettering on a piece of aluminum. Can you line this machine incredibly accurate so the print stays within the lasered area.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I own an 8' UV printer from Agfa along with several Roland printers.  My Agfa has a white tank which is always circulating as the white pigments tend to clog.  It will be interesting to see how they handle white ink.  Other printers without a circulating tank require daily cleanings which wastes a lot of ink.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Just read comments and agree with all, great vid, been using the stunning Lightburn program more or less continuously for 8 years, I guess we get stuck using the program the same way, Videos like this remind us there are better ways to do things and reveal the amazing progression of Lightburn. Thanks.",
    "likes": 1,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "$49 for 100ml🤣. i pay $27 for 1000ml on my uv printer",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Hey, is it possible to rotate the laser head by 90 degrees in order to engrave on vertical or upright objects?",
    "likes": 1,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Are you able to provide a review of the software used for the printer? Can i do Spot UVs? Can you control the translucency? I want to print on glass but i want certain areas to be see through and other areas not see through",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Yes, it’s the inkjet printer model. Give the printer away for next to nothing and pay 5x that for ink.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "very helpful video, just noticed the link for budget planning is broken. would mean a lot if I can gain access to the spreadsheet.",
    "likes": 2,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "I have a hat company.  Would this be cost/time effective for providing color patches to put on hats for my customers?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Do you think i could print 1,3 mm height text on alluminium watch plates with this?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "You mentioned something about six months storing the printer, but do you know how much time could one store unopened inks?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thanks for this great review! It gives great insights and answers a lot of questions! \nWould you mind sharing the outer dimensions of the actual machine and the print area?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Trying to sell ink cartridges in 2025?? LOL. I've been using ink tank inkjet printers and have never looked back... this is so 2000s. You can buy UV ink in 1kg bottles if you own a regular UV printer... the inks expire quite fast, and you have to constantly clean/cycle the printer. If you think your dead inkjet printheads were bad, UV is infinitely worse and requires a lot of maintenance. I can definitely see people with dried up print heads if they just do this for fun once in a while. \n\nThat said, this is a really interesting and unique take on a UV printer but just the ink cartridges is an instant no for me. Bad to say, but I really hope someone else takes this idea and makes a ink tank version that works with regular UV ink on the market. lol.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Hi Diana, I’m a newbie and I’m waiting for my l8 40 watt engraver, one thing I noticed is with the 40 watt laser they say your work area is 39000 by 39000, vs 40000 on the 20 watt engraver, may be adjust your work area settings on light burn to 39000 to fix your alignment issue, hope this helps.\nThanks Gill",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Question can a 20 oz skinny sublimation tumbler fit in the rotary i now i have alot of messed up sublimation tumblers i want to print over next Question how long and how much ink to print a full wrap on a 20 oz skinny tumbler",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Did you print R2D2 directly onto the metal that you quickly showed, or was that a DTF process?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I don't think Eufy response to the tariff question is meaningful. The reality is unless Eufy is shipping to a warehouse in the US and then redistributing it from there. There is no way for them to know how much the tariffs will affect the final price. The importer on record for the parcel is the one paying the tariffs unless the exporter precollects it and then pays customs. So it could mean that Eufy pays the tariff or it could mean that Eufy is not collecting the tariff, and it's your problem when it arrives.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thank you for the information and the tool. This is so awesome!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "What laser are you using in this video, and would you recommend another?",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "Very good job, Thank you, If i will buy the printer basic plan to start. it will be good with me in ink ?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I know that the E1 is not meant for fabric shirts, but i am curious what happens if you did print on a shirt? Does fade or crack is it just too thick? Just curious",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Something I've wanted to start recently would be Wax seal engravings, which is usually done on Brass. I understand it would take more passes to get a deeper cut on the seal, but would a fiber laser be good for multiple passes? Or should I get a CnC machine instead?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "I think what you said about not seeing anymore (new) open frame machines by next year will be accurate - A couple of months after this video the Creality A1 was announced, £500 got a fully enclosed 10w diode with a decent camera is probably going to have the same affect on the market that the X1 from Bambu had on the 3D printer market - all diode lasers will look like the creality A1 by next year",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "An almost perfect device but not for long term production machine... Unless you priced your products 2-5 times more expensive than any other competitors",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Is it possible to print multiple small images at once? Say you want to do 10 2x2 magnets or tiles?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I just want to engrave some plexiglass. What is the best machine to do that. Ive watched this video twice and am still lost. Please, i need some help.   The peace i need to put in the machine sometimes are large. 20x 36",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I use the Monport Mega and highly recommend it—it works seamlessly with LightBurn, which makes engraving super easy with its user-friendly interface, layer controls, and preview mode. For beginners in 2025, LightBurn has only gotten better with more intuitive tools, so pairing it with a reliable machine like the Monport Mega (auto-focus, safety enclosure, flame detection) is a win.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "We have a weidmüller printer for labeling industrial cabinets. The ink for this printer is around 450 euros. And this includes just CMYK. And the ink lasts Max a year before it expires.\n\nWe have been thinking of trying out the new eufy printer. We just need to know if the Software is able to Label these plastic sheets.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Hey Brandon thank you very much for making this video. Very professional and though explanation. I would like to ask you, im thinking about purchasing one of these machines on kickstarter. I would like to ask something perhaps you did not cover in your video. Are the end products particularly phone cases scratch resistant? or is there a need for an additional coating? For Mugs and Tumblers, are those dishwasher safe, or is post processing needed as well? Thank you very much",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Flatbed Uv printers have been about for a long time.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I think that warrantee is illegal in the EU but don't quote me on that I think the EU requires a 5 year minimum warrantee but again I'm not 100% sure.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Sucks inks soo crazy expensive. I pay 300 per color cartridges for my current Epson sure color wide format.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I have always been more of a longer format video fan.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "🙋‍♂️ Warranty’s don’t cover everything. This machine has proprietary parts like a Glowforge, so when it breaks, you’ll likely have to pay to ship it to China for repairs, covering shipping and tariffs both ways, which could get pricey fast. The ink is already overpriced at $299 for 600ml, and with tariffs, it jumps to $477 to ship to you—that’s $12.50–$23.50 for just 100 small prints, compared to the 3060UV-V2’s $0.13 (one of many uv desktops) eufyMake’s lack of transparency on ink usage and support is a red flag, and they’ve already abandoned their 3D printer backers in the past, leaving them with nothing. They’re promising free shipping on 6,437 units, but that’s $7.9 million in shipping and tariffs they might not handle. If they do, this risks delays or hidden fees. You’ll also have to raise your prices much higher than expected to recoup costs on this toss-away machine. Also, could you please provide precise ml/print data for different print types (e.g., small prints, 3D textures, A4 prints) to help us calculate true costs Also, are there plans to ship from the United States for us to avoid tariffs? Or is this printer going to collect dust from customers that can’t afford the now higher cost for the ink?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Have done a lot of research on UV printing. This printer is cool and yes, it is compact, but I do have some concerns, and you hit the nail on the head.  The cost of the ink, and the volume of objects that can be printed before you would need to replace.  There is very little to go on for me to commit to purchase this.  So I called EufyMake and not impressed.  Going to look for another printer.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "It takes 30 minutes to print one label, and 3 labels can be printed at a time. That means it will take 8.5 hours to print 50 labels. What a long time!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Have you got an approximate ink cost for a relief print?  I didn't notice that (sorry if I missed it).  Also do you know if the individual kin colours will be sold separately or will they have to be bought together after the kickstarter has finished?  Thanks.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Excellent review and the tool to work out costs is invaluable!",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Can you tell me the max height for different products?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Awesome! Question! I’m using my iPhone app for the laser engraving. Question is there any way to use or do the same thing with the iPhone app MKSlaser  app ?",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "\"real world cost\" is not discount days, it's the sale price on an average day, not a special day or discount codes being handed out.  it also make more sense to, instead of calculating \"245 prints of a certain thing\" go a step further and reduce it to an average of \"cost per square inch\"..  and then people can calculate the cost of coasters, posters, keychains, whatnot, this is more functional for most people than trying to measure their thing in fractions of your poster print.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Awesome! Question! I’m using my phone app and what do you use for the contrast and brightness. The app I’m using is MKSLASER",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "While I think this will be a great option for some people.   For me the consumables are just too expensive and the lack of refillable ink.  I don't like the idea that if I keep the printer on it will use a cleaning cartridge in a month.  Not to mention they only have a 3 month warranty which is short for a brand new product.",
    "likes": 4,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thanks you answered several of the questions I had concerns about compare to the other videos. What is the cost of the subscription though especially if I have to print several 3D?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Could diffraction gratings be made with this? Maybe even holograms? 😮",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What is the volume/cost of the colour inks purged out while cleaning.",
    "likes": 3,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "High ink cost, and you need to pay credits to get the 3d effect, locked in inks. .This seems like the old scam - sell the printer low, and the inks high.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Make a video to show UV print pattern on Leatherette then laser engrave and cut shape.  Designs for hats is the goal.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "There are so many people that got one of these UV printers free, and their videos all seem to be sales videos.\nThe only channel that seems to be asking the tough questions is Ogrinz Labs, who did not get a free printer.\nWill people pay for an imposto (raised/textured) painting? Where the cost is $22 in ink, and 7 hours to print. And when so many people buy these UV printers, the market will be flooded with people selling raised prints. The tumbler and mug markets are already saturated with sublimated items. The flat metal market, and sticker market the same. With heat transfers, sublimation, vinyl, direct to film (dtf), white toner laser, and other uv printers, the market is saturated with sellers using these technologies. This printer looks so cool, but that's also its problem ... when tons of people buy them, the market will be oversupplied with sellers. That's not a market I want in on. Etsy and eBay will be flooded with AI, raised/textured prints within days. And it will be a race to the bottom.\nI have been turned off by so many other youtube channels that seem to be just shills for this printer.\nThank you for pointing out some of the cons, and holding off your review until you get a production unit.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I pre-ordered a OneLaser XRF in December and lots of people complained about how long it took to get it. At that time they were a start-up company just finishing the final design phase and told me I’d have my unit in late March or early April. I got it the last week of April.  The shipper called me and said it would be here Tuesday and they would call 30 minutes out.  Well, my wife was home all day because she is a kept woman 😜but they never called and just dropped it in the driveway… My wife called and said your laser is here but I can’t move it! lol So delivery is not the best. It sat in my driveway until I got home. Just know, no porch pirate is going to snatch it off your property.  It weighs 179 pounds! This is not your parents’ xTool  Laser!! It is a quality built Professional engraver. I am using the included exhaust system and it works pretty good. But I may upgrade it in the future. My xTool D1 20 is a great machine but it did not come with an enclosure or vent system. Is it fast? Yes. Yes! Can you get a darker image than he did? Yes. If you are just a hobbyist I would stick with the xTool brand. They are the best bang for the buck. But if you are a semi-pro or are looking for a side gig this machine is a no brainer. Just make sure your cousin Eddie is around to help you get it up on your work bench because my little 5 foot wife was useless when it came to that!",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Great video again, I have been following on since your last video. \nWhat is the price of the cleaning cartridge? I think I missed that info, anyone know?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Will wait until someone hack the cartridge chips 😅",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Expected price for ink cart. 43-ish $. Each.  For 500 ml. 43$ for cleaning cartridge.\nPlus Shipping.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Nah... most of us that are deep into printing, know that there's only a handful of chemical ink producers, and it's no longer the 90s, and basically everyone follows very similar formulas and pigment densities. UV ink is only special in it's resin binder that's activated by very specific wavelength of UV light. The most common is 395um. But even still many commercial UV inks will cure within a range of 385um to 405um.\n\nThat being said... if I bought this printer, the first thing I would do is learn the cartridge system, and see if they are chip coding them or not. And secondly, if there was a way to non-destructively refill them. BECAUSE, even really good 3rd party UV ink should only cost you between $15-20 per liter. There might be some variance on the white, it's particle size and what specific inkjet heads they are using. Again, this is a start-up, so I promise you they aren't designing their own piezo electric print heads from scratch. They are sourcing them from Ricoh or Epson. If you know which one, you can buy inks specifically tailored to that particular print head. It's not that complicated.\n\nRemember, ALL printer companies make their business model around you, the customer always buying ink from them, keeping them in business.",
    "likes": 19,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "It's cool but it has things putting me off totally aside from the cost of ink (which as you say isn't too bad when you consider it per item):\nif its not popular enough and they stop selling it you won't be able to buy the ink because it has, by the sounds of it,  electronics preventing 3rd party inks (and would 3rd parties even bother making it for a niche/unsupported printer)\n3 levels of software subscription (!)\nFinally it sounds like it will be annoying in the same way an inkjet printer is - in that if not used for a couple of days it will spend minutes whirring, clacking and wasting very expensive ink and cleaner to clean it's heads.",
    "likes": 3,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Finally after the release the video about the ink costs 👏👏\n\nBest example for payed promotions…",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Any kind of printer that uses refillable ink tanks will always beat cartridges. Epson needs to get on it and make a competitor machine.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "How toxic is it, is there a lot of cleanup? Do you need to wear gloves and respirator when using or cleanup or curing prints?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Combine a 3d Print and the EufyMake. For example print a Pokemon in a single color and use the uv printer to print the eyes or the color details. Gengar is mostly purple adding in the eyes and and teeth using the Eufymake would be insane. Please give it a try. Or you could take like a 3D Printed car or something and add a logo or something that runs the length of the car. I know these are Random examples but when i see a new gadget i think of how it can enhance or make up for the shortfalls of other gadgets. Thanks for your break down it really got me hyped for this machine.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I run a Vanguard VR5 4'x8' daily. Keep in mind the following for UV printers if you intend to get in the market.\n\n- Inks are pricey and have short shelf life\n- White inks are particularly difficult\n- Dont ever strike your print heads, they are expensive to replace\n- Requires lots, lots of maintenance",
    "likes": 3,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "As soon as I saw the specs I felt its would cost a lot if you had to let it idle too long between orders. My subli printer is expensive enough but this isn’t worth it in my marketplace.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I backed the kickstarter for the deluxe bundle; can’t wait to get it !!  Mainly getting to make my own UVdTF stickers and mugs and tumblers.",
    "likes": 6,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "$300 There are A couple ways to look at this. everyone has wasted more than $300 on stuff we didn't need, and  if your selling A product for $20 with a profit of $15, you need to sell just 20 of them. I thinks that's quite doable.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Does the printer require you to soak the heads in solvent when not in use, like AGFA or MIMAKI UV Printers? If so, do they provide a disposal canister?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Hi Brandon! i would like to buy a big 70W diode laser for my shop, my choice is between atomstack x70 pro and sculpfun s70 max. I'm looking for a big working area and nice power for wood and acrylic cutting, thats why i choose these laser. What do youu think about that? do you have any suggest?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Super cool machine. But you’ll have to keep it printing to make any money. The white inks are especially prone to clogging. You can look up the DTF direct to fabric printers to see they have problems if they sit for a while. Hats off to them for even trying this. Hope it works out for everyone.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Any idea how the ink holds up outside in heat, uv rays and weather?",
    "likes": 4,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "would it be possible to do deep engraves with a 2w ir laser over a much longer time or is straight up impossible?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "expensive, proprietary and if company goes belly up-  screwed  - best to WAIT as all kickstarters - 9999999999999999999% are failures and what i consider thieves - all same story from them",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Great info, thanks so much. You mentioned that there was a gloss overlayer you could use. Without using that, is the default a matte finish?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thanks for the comprehensive review. It is indeed a really interesting printer!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thanks, this was an important video for everyone thinking about - or who have already purchased - the E1 printer. You didn't mention the cost of deep cleaning. Maybe you can comment on that as well as the cost to replenish the ink lines when one starts their printer up again after deep cleaning.  Thanks, looking forward to your upcoming videos.=",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "So if the cartridges can not be refilled this product is dead on launch. Thanks for the info.\n\nUV DTF Ink in bottles costs about 80 dollars (ballpark figure of course) for a 1 liter bottle. Do the math, they are asking for 300 dollars for just 0.7 liters. So thanks but no thanks. Redo the damn thing with refill tanks like it should be.",
    "likes": 5,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I think you are mistaken, or the info Eufy is giving you is wrong. All the cartridge kits I could find on Kickstarter and their website say the $300 bundle only comes with ONE White ink cartridge, not two. While that doesn't drastically change the cost per ml, it is at least something to consider. Those who back the Kickstarter will get an \"extra\" White ink, but this is only a one-time stretch goal, NOT something the printer normally comes with.",
    "likes": 15,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "You answered all of the main questions and hesitations about this printer. Thanks so much! Getting answers directly from them is helpful too. I'm feeling a lot better about getting this printer now :)",
    "likes": 13,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Great review!\nYou mentioned a lot what others failed to do so.\n\nThanks a bunch!",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Hi! Am i able to adjust the opacity of the print? I intend to print this on holographic materials. IF ther CMYK ink is too thick the holographic effect wont shine through",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Would you happen to know what the maximum print size is if I use the flatbed? Thinking of printing on painting canvases and can't seem to find what the maximum size I can print. Thanks.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Any info on print head cost?\n\nMimaki is about the only company I know that makes a uv print head that lasts a good amount of time. Everything else is a couple of months - 6 months.\nInk is expensive. But the printhead will be too!",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "So $300 bucks for the ink, is that U.S.D ? That'd be about $470 AUD plus shipping. That's getting pretty pricey.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I thought the ink kit was CMYKWG, and a cleaning kit, not two whites.\n\nNot that it matters in the slightest.  eufyMake will NOT ship to Alaska (or Hawaii for that matter), and after several rounds of back and forth, they admit that they have no plans to distribute ink or parts or materials through other channels like Amazon. So (as of now) the ONLY way to get supplies is from them, and they won't ship to Alaska.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "can you buy white and gloss separate? and how much will that cost?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "About warranty: Epson  v1000 comes with 1 year statutory warranty, with option to extend up to 5 years. Applies to all parts, including head.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Anybody know if the tariffs will be applied on this product?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Thanks for the review and updates. Super fast response to questions! Awesome.\nSubscription software for functionality (credits...) is where I might have to think twice... At the forefront is \"3D relief\" or \"depth printing\" and that, from your brief answer, seems to be tied to a subscription that gives credits. Free tier has limited use, but based on their \"you can make this much per day printing with this machine\" the cost in credits should be calculated into this. \n\nRegardless, great product, wonderful price for entry. A bit shady in not being upfront and clear as to how much total running costs will be. I'd hoped companies would take note after the BambuLab \"this is how we will operate going forward\" backlash but looks like more *asterisk* stuff could be on the radar. \n\nThanks for the updates again. See if you can get more information on the subscription tiers/specifics. If it's anything like Adobe (which I love, but costs a bit) then this is something to definitely factor into the cost of printing products as well as the ink.\n\nImagine a tradeshow/event with a line of 20+ clients and you run out of \"credits\" for generation...ChatGPT like tiers? Free - $20 - $200?....scary...",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "SUPER helpful video! I did back the project, and ink costs have been a bit of a concern. Considering what this machine is, and what it isn’t, the ink costs appear to be tolerable - especially since I’m hoping to sell some of what I make. This video makes me feel more confident about my purchase. \n\nAlso, nice shirt! It’s cool to see you supporting others in the community. \n\nK up the fantastic work. You are improving the community.",
    "likes": 14,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "$300 for a box with all 7 carts in it?\nThat is dirt cheap!\nThe ink for my DTG printer is $1000 for the set of 6.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Glad that your listening to us some.  So price isn’t stupid and ink prices are stupid but all of them are.  At least for uv or non ink prices. If we had just a small more info, someone like me would post a honest price of stuff comparison.  Sodas vs milk vs milk vs gas vs printer ink vs uv printer ink kinda thing.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I wonder if you can print these onto ceramic and apply the glaze on top and fire them.... would the design melt? Would it be fine on a plat horizontal surface? Would it melt into the glaze and bleed together? Can that be prevented somehow?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Huh 300$ for a full set is pretty cheap actually, my 4 colors toner set for my laser printer costs around that much so...",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Hi, when you try using the UV Printer, is there any strong smell? I am interested in this printer but my team concerns on the smell since some reviews on the ink odor of other UV printer brand are not positive. Is it odor free for this printer ink? Thanks",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I would be interested in seeing how well it prints on Baltic birch unfinished plywood.  How accurate the alignment is (laser cut a Christmas tree and theb print the green tree, lights, balls, tinsel on top).  How well will a topcoat of shellac or Minwax Polyacrylic sprayed on work?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "My understanding was that the ink kit comes with CYMK, 1 white, 1 gloss, and a cleaning cartridge?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "What's the cost of the print head?  The concern I would have is that when the cleaner doesn't flush the print head adequately or doesn't keep it moist between prints, you will end up with clogged nozzles requiring a head replacement.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I'm kind of shocked they don't have a cost breakdown in the software standard. On my Mutoh 661UF I could click a single button and it would tell me how much ink of each type in mL's and cost based on me entering my actual ink costs. I hope they get that added to their software standard. That's a game-changer if you're reselling!",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I have a refinecolor zz1s and my cost of ink is so low. I pay $35 for 500 ml machine cost me $3400. A 11x14 inch print on max settings cost me about $0.08 in ink. And an 11x14 on full setting takes 13 minutes to print with full white and color. I just printed on 168 gameboy sp shells and took me 3.5 hours. I love the idea of this machine but it will be to costly to run when you factor in ink, material, electricity, and time, your margins will be thin if you use this to make money.",
    "likes": 40,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Shit you could make 245 of those star wars themed items and sell them for 25 apiece pc and make almost 6k 🎉 definitely a cop for me",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "So to be clear, once a deep cleaning is done, you can unplug and store the machine for up to 6 months, and it doesn't need to run a cleaning cycle every 3 days?",
    "likes": 8,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I didn't hear you mention what the cost of the cleaning cartridge would be.  Do you have that cost ?",
    "likes": 4,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "This machine is nothing more than for a hobbyist. \nYou are not going to be able to make money with this machine selling commercially, keep in mind everybody else is buying this machine to compete with you on Etsy TikTok instagram ect. as well…..",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "If the price is 210 for a set would be sold more often. 300 is to much and limiting. If is to be competitive and people not look so much at the price of ink it needs to be perceived afordable . Otherwise after one week, when the novelty runs out, people will place their machines to sleep. But if the percived price is afordable, people will exepriment and move on. After 1 year the company could re-evaluate the price of paint. Even if they increase the price over one year will be less damaging to the company, since people will already have hfound their niche and be able to properly evaluate continuity. Just my 2 cents.",
    "likes": 4,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I am wondering, If I plan to only use this on occasion, maybe once every few weeks.. how would that work? to prevent it from going into deep cleaning mode as you mnetioned every 72 hours? Would it be very wasteful if i don't use this machine every 3-4 days?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "That’s how much HP wants for their color laser printer.",
    "likes": 4,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "As soon as the \"subscription\" word is batted about, I'm done.",
    "likes": 14,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Finally some that made a video about this. Remember that 3rd party inks can also cause clogging your print heads and might void your warranty. The key is, this is not a regular home printer, this is a professional UV Printer. The price that you should be charging your customers should be 3x or or higher depending on what you are printing and the method. I already have a UV Printer, a Roland flatbed, here is an example of what I charge for a name tags. We just completed an order of 90 name tags and we charge $10 each, out cost per name tag was around $1.50, we ganged the name tags on our flatbed. So a few jobs can definitely pay of this machine, just don't under sell your time and products.",
    "likes": 24,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "There will come cheaper and better UV printers fast and most likely universal ink refill.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I wonder could you cover the UV light so it doesn't cure and then do dtf to fabric if it stayed wet?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "If people what to save money on ink they should open their images in Photoshop. Most people files will most likely be RGB. Convert the file to CYMK and then under color settings use GCR to removal color CMY used in the black. You can choose light, medium, heavy or max or custom. This will help remove ink which is really not needed in printing and save ink",
    "likes": 301,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Deep thoughts: Why can't they have a setting to turn off the UV light and then we can apply DTF powder for application to fabric?",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Yeah, too many limitations to make it worthwhile imo.",
    "likes": 1,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Coming from large format photo printing. Over 1000 Euro to replace cartridges, this is a steal. Interesting.",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Way cheaper than what I had expected.  not a bad price, especially considering the sell price.",
    "likes": 15,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "The kickstarter says it comes with 6 cartridges plus the cleaning cartridge, not 2 whites, just 1.",
    "likes": 2,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Imagine the cost of an HP printer without the support or warranty. Now imagine how many headaches your HP printer has given you.",
    "likes": 3,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "So if the ink is truly that expensive, then this machine is too small of a scale to make enough products to warrant its existence. Especially since they don’t want to warranty the device at all. A machine like this needs to come with a standard warranty that’s more than a year. System this complex and that costly no matter what scale is not a hobby system someone’s looking to make money off of this so it needs to be a solid foundation of hardware and support. This has none of that.",
    "likes": 70,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Backer here. I understand what makes the CMYK UV Ink special for this printer but what would stop me from saving money by providing my own spray on white undercoat or gloss protective coat for a project? like could I spray paint white on a piece of wood then print on it with no white ink? could i seal the colors with cheaper sealants? Thanks",
    "likes": 21,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "So it has all the failures and scam ability of a regular printer. I’m out!",
    "likes": 3,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "hi mate, thanks for you videos. just a quick question, аny chance we’ll see a review of the Monport Mega 70W soon? I’m really interested in your opinion.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can you print white small text (1-2mm height) on glass and plastic squeeze tubes? Thinking of product packaging text. Is the white ink still scratch resistant or does a gloss coat need to be added?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "cost of supplies ? with the hourly maintenance and cleaning that's a big deal...?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Anyone else not like their f1 ultra or is it just me ?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "'(...) kind of the same thickness as like your normal inkjet printer (...)'. Sure. Perhaps or just in the depth. And abstracting your moaning - it's also much more heavier.\nSo, how could this the revolution in 3D printing at all?! I find this question absurd. The volume, the restricted possibilities material  and at least - it even can't print really in 3D. Far beyond of a 'revolution' in this segment... really absurd this context.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I’ll wait for a competitor with better reputation and prob better price point",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Only ever known eufy to make cheap security camera for homes, imagining them making 3D printers feels wrong lmao",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "great video but my stuff is so jacked up its giving me a headache...  either burning a square or the image looks like garbage...  another case of wood on the way..  lol one day master...",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "Not for me plus i prefer sublimation you are not locked into buying specific extra expensive cartridges",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "The company that is making this is already scheming of ways to Fawk with uses that just want a printer that does great work ! \nThey will come up with ways to sabotage your fabulous printer to squeeze & squeeze your balls for no reason having to do with The printer — just so you’ll never trust anyone in these industries, just to Fawk with any desired functionality of artists & creative industrialists, just for anarchy - just for liberalism ( The blackest dark magic form of democracy ) ( ? )",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "i bet that could print a wicked laptop skin..but why is it so expensive? inkjets are like <$200, resin printers are <$200; why is this $1500???",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What a great product. I feel like waiting for 300dpi though.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This would be way too expensive for a hobbyist to run. The cheap part is buying it. Going through expensive ink just by having it sit would be cost prohibitive.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Very cool, great ease of use features but being locked into any sort of subscription or cartridges should be discouraged by the maker community. Company also has a shady past with prior support. In my opinion you should state this in the beginning of your video, you have a wide audience and people trust you",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I have seen in there software, someone printed a skateboard, a surfboard and a snowboard. Is it possible to print a sticker for such a big thing?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Question....please help with my concern....... how can you assure us this product is ligit? Like that it's actually made and after we \"pledge/order\" we will recieve the \"Reward/product\" In July (when product is said to be ready)\nI pulled this information offline....\n• It is possible to back a Kickstarter project, receive the funds, and NOT receive your reward, potentially Losing Thousands of Dollars. Kickstarter is a crowdfunding platform where creators offer rewards for pledges, but backing a project doesn't guarantee reward fulfillment\n• Delayed Fulfillment:\nDelays are common in Kickstarter projects, and backers may have to wait months, or even years, to receive their rewards. \n• No Legal Recourse:\nKickstarter is not a legal marketplace, and there is no legal recourse for backers if a creator does not fulfill their pledges. \nJust sounds to good to be true.... and like a pretty big risk/Gamble.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "so eufymake is anker, anker is chinese, the cheapest eufymake printer is 1699, with 145% tariff is $4162. Everything is fine",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Just what we needed... Another machine that locks users into their company's proprietary consumables...",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I use the Monport Mega and definitely recommend it—it’s easy to use, gives clean results, and has great features like auto-focus and built-in lighting. It’s perfect for both cutting and engraving, and supports rotary tools for more flexibility.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "I don’t have a printer because ink is so expensive. Imagine how much the ink is?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I work with an industrial uv large format printer. The Uv normally has a shelf life of 6 months once it's in the machine . UV ink is nasty stuff . I wonder how you can cleanly dispose  of the excess product it will produce ? It's not something you can put in normal waste .",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "\"Smelling\", \"feeling\"... \nYOU DON'T HAVE TO SMELL OR FEEL THE FUMES TO GET POISONED BY THEM!!! Since when serious health risks became a \"vibe check\"?!",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "While we appreciate your disclosure that the company shipped to you this 3d (product) printer. \n\nhowever, could you clarify whether they sent you this to evaluate and Keep as a quid quo pro. Or, are you responsible to return the printer after testing it out.?\n\nor in other words is this a $2500 'gift'  in exchange for you making a video you promised to make, review, and post publicly?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "*I think it won’t be long before we have UV printers \"painting\" 3D models—like action figures—right after printing.*\n*That would be amazing!*",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "From a technological standpoint and from a consumer level this looks amazing, but from a creative standpoint making cups and glasses on demand, aren't you just maki g more disposal crap destined for the landfill? I mean it all looks pretty tacky and not at all useful.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Thanks - this printers capabilities looks amazing - thanks for sharing - I have so many ideas blasting through my head",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "interested to see if this might replace resin 3d printers in the futures..that would be wild :D",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "If I buy an HP printer, I am fairly certain I can buy compatible ink in a few years. If I buy an eufy, that is far from certain.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Established companies like Anker, the owner of Eufy, should not be using Kickstarter as a funding platform. These corporations have ample financial resources to support their own projects, yet they turn to crowdfunding as a way to shift all risk onto consumers and backers. If their product fails—like their previous 3D printers—these companies remain unaffected, profiting from sold units while losing nothing on research and development.\nWhat makes this situation particularly concerning is that working units of the product already exist, as multiple YouTubers have demonstrated in their reviews. So what, exactly, is being “Kickstarted”? The manufacturing process? This is not what Kickstarter was originally intended for. Unfortunately, more and more established and profitable companies continue to exploit the platform, using it as a shield to protect their investments rather than a genuine tool for innovation.\nThis unethical practice places all financial risk on backers, who are left vulnerable if the product fails. Meanwhile, content creators often enable this cycle by eagerly accepting free units and promoting them without scrutiny. If influencers refused to provide exposure to these companies without genuine accountability, failed launches could force corporations to rethink their approach and adhere to proper business practices.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "2:59 Probably the first thing that stands out is the Green Tape stuck on the printer.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "what is the price of printing like 10 squere milimeters?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Could you possibly have a 'blank' miniature and then print a 5mm layer on top for the detail?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "How you feel about the neje 4max? And just about the open larger format lasers in general?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Congrats for all the video .Keep giving Value for all thank you",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Have you tried to do a print directly on a flat 3D printed surface ??? Im wanting to see how this works with PETG.. The item I am working on is a design of my own and it's printed on its side for strength and I would really love to be able to directly print to it. Thanks..",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Csnt stand already established companies using kickstarter so they don't have to spend on focus groups or more rnd...its ridiculous and kickstarter should vet companies...I mean this co.panie does 100 millions on profits wtf",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can you opt to not print a layer of white on the materials before printing color? It seems like for something like wood, it kind of defeats the purpose of printing on wood if you’re going to lay down an opaque layer of white beforehand. Like if I want to see the woodgrain texture beneath the inks?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Good video. Just wondering how durable the prints are?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Engraving on wood can range from simple designs to intricate, detailed work depending on your skill level and tools. I use the Monport Mega and recommend it—it’s great for beginners and pros alike, with features like auto-focus, flame detection, and rotary support for precise, high-quality engravings on wood.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Hi Brandon! i would like to buy a big 70W diode laser for my shop, my choice is between atomstack x70 pro and sculpfun s70 max. I'm looking for a big working area and nice power for wood and acrylic cutting, thats why i choose these laser. What do youu think about that? do you have any suggest?",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "This reminds me of the 3D printers from a few years back that did full color by layers of paper that it printed on.",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "my concern would be the cost of replacing the color cartridges and how long they last, breakdown of cost to print a project..",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I am new to KickStarter. IF I do the \"Pledge Now Pay Later $1,000\"  option and pay the $1K does this give me the option to pay the additional amount for any of the Rewards when/IF they are fulfilled? Is my $1K refunded if I elect not to accept any of the rewards??",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "This is a great start. SLA and DLP 3D printers had a wave of Kickstarter projects about a decade ago at about the same price range. Now, we have tons of options for under $500. I won't be backing this project, but looking forward to having decent desktop UV printers in the next 5 years.",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What safety measures does it have other than the top lid?\nBesides the sticky base, does it a way to align to the object or do you need to calibrate the material alignment?\nDo you need to prep the materials in any way; soak wood, base coat? I didn't catch it, but does it automatically know to place down white or do you need to do it?\nDoes it have the firmware backdoor that all paper printers have?\nHave you tried lasering then uv printing on metal so that there is no relief?\nI hope they do not get you with the ink or make it obsolete with upgrades.\nNice way to setup your printer label.\nWhat a dust and fingerprint magnet, eh?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "\"Everything on the app\" no thanks. App dies and it takes the printer with it. Needs eternal support. Ripe for enshitification/monetization. \nI have and like one of their cheap robo vacs, but I can push a button on the top of it and it just works. No app needed.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I used a large format UV printer 11 years ago at the print shop I was Art Director for and it was AWESOME... EXCEPT..... The printer worked off of compressed air and oil for movements and we were constantly having breakdowns.\nI'm hoping that a decade later and this thing being so small that a lot of the issues are no longer valid!",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "as a sticker printer who prints his own stickers id really me curious to explore what kind of stickers could be printed with this",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "only 5mm is too bad. It should be able to print on a full 360 degree model.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "If the basic principles behind how this works aren't proprietary or patented, I'd like to see what other companies do with the concept. The brand trust for this machine is low, so maybe if someone like Elegoo does something with it, it might take off",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "is the Ink dishwasher safe on the Mugs or Tumblers?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This has amazing potential. Let’s see where that leads.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Eh... I received the H2D yesterday, I find that to be much better value... I know, different products... But if you're a maker, and owned neither, an 3D printer was the easy first choice... At the price, these will be a hard sell, even more so in USA....",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "cool tech.. but how does it compare to the cost printing/applying/sealing vinyl stickers (seeing that the most common use cases,  are realistically not going to be specialized 2.5D or odd material printing)?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Awesome products. With the wood wouldnt you just be able to paint the wood white first then print saving the ink?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can this print tshirts?  The quality seems good and the 2.5D relief would be great and unique on shirts.  Not sure if it can and if ink would withstand wash dryer cycles.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Good idea but the risks from Anker and Eufy are far too great. \nMore trustworthy companies will make better options soon enough.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "How durable are the prints?  Can you scrape them with a knife?  Does it hold up to water or rubbing alcohol?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This is the first video I’ve seen of yours and the information is great. Thank you for that. But I hope you don’t take this the wrong way — the uptalk starts to become more noticeable.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Very cool!  I can see myself picking one up with all the available options, buying spare ink/cleaner, setting it up and playing with it for a week...then, never using it again (cause that's just the way my mind screws with me and my wallet!).  :)",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Give this thing a dissolvable support material and a little more Z height and it can do full color 3D printing like a baby Stratasys J55.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Eufy, the home security camera company owned by Anker?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Could you 3-D print that Cassian and then have it paint over it like would it be able to process that?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can you send your own 3D files, or do you have to generate the 3D files in their software?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "When the system flushes the lines where is the flushed ink stored? FYI . . .Bitner Built Woodworking shows an \"on off\" button on the left side of the printer next to the power cable plug in.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can this machine print on resin or pla 3D printed parts?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Kinda interesting. But wouldn't be able to afford it anyway lol.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "300 for cartridges, im good bro will stick to 3d printing",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Hi there, may I ask if there is a primer cartige availabale? many thanks",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "There WAS a primitive printer that used paper lamination for 3-d printing, using layers of paper.  Several inkjet printer companies investigated this but it seems to have petered out.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Awesome video! I’ve put a deposit down on an E1, can’t wait to get my hands on one. I really loved the Star Wars planet designs to used in the mug and the stickers. Are they for sale somewhere? Thanks for what you do. This was super helpful!",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can we use it to make, for example, tattoos on figures i printed with resin?",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What is the maximum height, you mentioned 4 “ inches, but the rotary and mug appear to be much larger? Thank you!",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "looks pretty cool,  I really like hueforge on 3d printers. This seems like it might be the next level of that art and print form. excited to see what folks make when it hits. Just like inkjet printing, not so exicted about buying ink and its dries up or evaporates when not in use.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I learned a lot about UV printers in General from this video, thanks!",
    "likes": 10,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  }
]