[
  {
    "text": "SO that's a very expensive engraving machine, unable to cut, and with a specific RF laser that cost a lot to replace, without any compétition for the part. \" A lot longer\" is not scientific, I am pretty sure this laser tube will last very much a shorter time, because any new thing these days comes with a higher cost and a reduced lifespan BY DESIGN.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Will the polar work well with material that isn’t level? You mentioned about the auto focusing with the rock but would it truly be an issue in most circumstances?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Very nice comparison and machine. I myself am going to give the P2 bonus points for having a passthrough and the conveyor - mostly to justify that I just bought it…  ;-)\n\nThere seems to be a rotary addon for the bolt, so they both have that.",
    "likes": 2,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Thanks for valuable sharing. Looking at the Xtool D1.  From your experience, is it adequate to engrave beach stones?  How well does it work on slightly uneven surfaces?  2:30\nThanks.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "What about the best Laser Cutter Fume Extractor/Filter units? I'd like to get the OmTech Polar, but what filter unit should I get considering cost, effectiveness, and especially cost of filter replacement units?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Great Video. I would love to see a direct comparison with the xtool P2. Comparing engraving speed/quality etc. Keep up the good work",
    "likes": 7,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "It may be good, but I couldn’t see myself buying anything from that bro swearing on his granny’s grave. Yikes!",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "How does this compare to the gweike cloud RF? That seems like the better comparison RF desktop vs RF desktop. Love the videos as always.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "So they claim it can cut all the way to 1/2 birch. Have you tried that?",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "You said that a glass tube last longer everything I’ve found said RF tubes last 2 too 3 times longer than glass tube just wondering if I’m miss informed I have a nova 35/100 watt it’s a tank thinking about the bolt for trade shows",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Never trust anyone that doesn't know the correct way to wear a baseball cap.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Great video, very helpful! I’m just debating whether to buy the Bolt or the Nova24 to cut 0.7mm wood veneers for marquetry designs - do you have any thoughts on which machine would be best for this? Thanks, Kevin.",
    "likes": 2,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Why do manufacturers keep ignoring the most commonly available material stock size (24 x 12)?",
    "likes": 29,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Nice review, Thank you.  On the cutting, I found a video of the Thunder Bolt cutting 18mm acrylic! If it can do that i'd say it can be a true 'cutter' ? https://youtu.be/ZVljOabYFks",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Thunder Laser has a distributor in Canada as well as the USA, that's pretty nice.",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Just realized I had the chart for the software wrong, the xTool P2 should have 5 and everything else 4.  The total at the end is right...I just missed that in the edit.",
    "likes": 8,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Was looking for 10w saw xtool with there reasonable priced d1. However sprang for the M1 instead simply for the enclosure, and it was on a big sale. Even cutting 3mm ply on this is fairly slow 5mm/s 100% power etc. If i look to upgrade in the future im coming back to this video. But for me the Xtool P2 is a very atractive option. \n\nAdditional the Xtool software has come a long way since i first started using it, expecially with setting test grids.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I use the Xtool m1 and feel the limit of 10w, shame there is no option to upgrade the m1 like you can the d1 up to 40w",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "This stuff is going to be great one day after im long gone, BUT its going to also be horrific.\nLaser weapons are already here, we are fast approaching a time where conventional weapons are obsolete racing towards our destruction.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The Desktop CO2, are they 110v?  Or do they jump to 220v?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I have been researching for a laser, a diode one to keep the costs down.  The one piece of information I would like to know is, which one has the least trouble to use.  I hear compalints of all sorts, the OLM stops in the middle of a job, or another company, all the suddent the image jumps over an inch, etc.  I basically want something that is reliable with 20w laser.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Ahh yes. \"Chinese Honesty\"\nOr as we say it \"putting whatever words and numbers in the ad that makes westerners buy it\"",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Very helpful video…thank you!  I’m looking for a budget buy to engrave and cut materials under 1/4” mostly wood.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I’m glad you’re telling this.  I was looking through the lasers last week, but it was making me mad because it looked like some listings were being deceptive",
    "likes": 8,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The wavelength in those lasers is comparable to the wavelength of light used during intraeye laser surgery. In other words, diode lasers go right past your cornea and start burning the inside of your eyes. CO2 lasers however view clear plastic and your corneas as opaque. Therefore, it's exceptionally easy to shield your eyes from CO2 lasers and basically impossible for diodes.",
    "likes": 3,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Moisture Resistant MDF (Green MDF) gives better finish with CNC as it has shorter fibres.",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's H"
  },
  {
    "text": "Thanks, good ideas.  You were lucky to get off with just a cease and desist.    Some people get court date notices resulting in huge fines and expenses.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Maybe you could do an update video on this?  A few things have changed from 2 years ago.  Nowadays,  K40's are generally Lightburn compatible out of the box, have air assist and adjustable laser head for different material thickness.  I've been thinking about getting a K40 and it's between Omtech and Monport..",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Are large format (137 in x 79 in.) fiber laser machines available in the market? if not can they be custom-built?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Hi, keep coming back to your videos so thanks a bunch for making such great content. What I am strugglig to find clear advice on is whether this can cut rubber up to 1.5mm thick? Have you tested it with rubber? or have any other ideas/advice?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I'm surprised that the stadium name could be considered copyrighted. It should be a double edge sword for companies to jam copyrighted words into stadium names. You get the \"free\" marketing for it, but anyone and anything should be allowed to reference the name for the descriptive nature. In other words, you shouldn't be allowed to use the Coca-Cola logo if you make a plaque for \"Coca-Cola Park\", but surely you should be able to reference it's name descriptively. I get that it might not be worth the bother, but if companies have this much power over which combination of letters a person can use, companies have even more power there than I feared.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Do you know the focal length of the xtool P2 laser lens and how far should it be from the surface of 3mm wood? Is it a 1.5-inch -30mm lens?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Wow was this designed to keep the camera locked on the sun? After the balloon bursts if you are looking at the sun, it doesn’t move, just spins around in place.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I would love to see the machine function at the 1000mm/sec and have the laser accurately fire. My laser starts losing out above 500mm",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "“WARNING “\nDon’t buy hexa\n\nI used to have an hexa and I just sold it very bad machine. The machine has an issue with power compensation sooner or later the issue will show up. No matter what you’ll do this issue will ruin your projects.\n\nIn the other hand if you are looking for detail or very light cuts or engraving. You won’t get have it with the hexa as the min power is 10% of the full power making details and small engraving impossible to engrave. \n\nThe machine looks good and actually I can say it’s really fast.\n\nBe carful if you want to buy as flux will not refund for your purchase and you’ll struggle trying to fix the machine by yourselves.\n\nGood luck",
    "likes": 2,
    "video": "Is Glowforge Dead?  FLUX HEXA 60W Laser Review"
  },
  {
    "text": "Do these kinds of units produce harmful smoke? I have my xtools laser in an enclosure which I built, but just wondering about these 3d printers. Is there any nasties to be worried about?",
    "likes": 4,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "Have you done a video on lasers that will cut thin metal? If not, will you? ❤",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "How long do you think it would take to route 5 of those holes for example?",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Hi, i like all your videos,i want to buy my first laser as a hobby to start.Base on your experience wich one do you recommend ATEZR L2 36W-Wizmaker L136W or Montport 40w?for glass and metal",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Are there any diode lasers that can be used with iPad? What would be the best laser for a beginner? Many thanks",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "om people need to learn how to always try to use full depth with ur tool and less stepp over bonus from that u get to use all ur tool and u dont wear up the end of the mill",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I have had a glowforge for a few years and the power supply just went out. They want $1500 to fix it can’t afford that. I have a project for the school coming up and I need a cheap laser engraver for about 300 bucks. Do you have any suggestions? Make On",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Have you ever taken a look at the Vevor units?\nI'm considering the 10w model with air assist and rotary roller. Works out to around US300 (In Australia it's A$590 inc delivery)\nIt will mostly be used for engraving and cutting thin plywood. Clearly, I'll need to make an enclosure and will use the same extractor I use for 3D printing.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I have a diode laser with auto-focus but sadly in the unit they sent me it doesn't work at all. I've tried countless times and worked with their support, just nothing. I have to do it manually with the spacer.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "2:28 If it is using 90w of power and only giving you 5.5-6 that's pretty horrible.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Many of them list the output power these days like XTool and Atezr.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "We're currently running an x20 pro and x30 pro for anodized aluminum membership cards, fully calibrated as fast as we can run its taking 3 hours for 40 cards. Seriously considering the omtech sitting in the floor in this video. Would you recommend?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Do you have to have a PC or can the inexpensive diode lasers work on Mac?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "i only buy the diodes, and about the best ive found readily available are 5W... nichia nubm08 or summink? can pulse them a bit harder, but yeah... continuous, without chilling  water cooled loops... 5W.\n\nwavelengths matter... what transfers the most energy to the workpiece, ie, is absorbed the most readily by most surfaces versus reflected? blue? or IR? dont have a choice with diodes other than wimpy green... which is IR under the lens.\n\nmeh, diodes are cool but the aberration is annoying. beam correction is a hassle, and most dont do it. need a semi cylindrical or anamorphic prism setup... fiddly. if you want the precisest DOT possible rather than a line...\n\ntheres another thing about depth and its the focal length. a short beam obviously must have a steep convergence angle, with a wide dispersion cone beyond the focal point. you make conical cuts. a long focal length gives closer to a parallel beam.\n\nin the end, you still get the same energy on the dot but the long focal length does have the head far away... more scatter, more wobble, more jitter and error amplification...\n\nfocusing to a dot then collimating is next to impossible as the AR surface coatings break down... the beam has too pretty well much cover the entire lens or yeah. smoke :)\n\nplayed with combining.splitting prisms with three diodes but omfg, not worth it. take more passes.\n\ni know theres an actual assembly but im a cheapskate. one day i might get a CO2...",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "No misunderstanding.It's just that those who choose a diode for themselves in 2023 have no problem understanding that 40w is 2 5W diode, 80W is 4 pieces of 5W.The latter in my opinion and the reason that CO2 will become a thing of the past machine 1000 1000 based on it will come out within 500 $. Performance? I'll buy 2 more and it will still be cheaper than CO2.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The word \"comparable' doesn't mean 'equivalent'. So that's not specifically a lie since it's making a true statement, even though it's deceptive because people don't realize that words actually have multiple definitions and uses, and if only one use is literally true, then the statement isn't a lie. That being said, on principle I don't buy anything where the title is literally a lie designed to make me look, even if the item details look good because if they literally lie in the title, I can't trust any other claim they make.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "People reviewing these machines should expose as you are doing.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "This is the machine I use - it's awesome! And Thunder customer service is so helpful and quick to respond. I almost wish it came with a stand. It's a bit too high to use on most tables, and a bit too low to operate on the floor. But that's literally my only complaint. It's also very heavy - my shop is in my basement and I had to spend another $300 to a moving company to get it down there and into place.",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "At 11:38 for the speed test did you use the setting \"Constant laser power\" in LightBurn? I have a theory that without this the laser will compensate for the gantry slow speed when accelerating and you will miss the real test value how actually fast you can go. There should be a threshold in the speed chart after which all the squares would look the same in the columns regardless of the speed, so you could see that the laser gantry could not run any faster than the threshold speed.\nI also have falcon2 laser and now I'm eager to do the test as you did here but with \"Constant laser power\" setting on and off. Really good video, thank you for making this.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The Roly Lasermatic 10 watt diode laser comes complete with an enclosure, fan, honey comb bed, rotary attachment and air assist. The enclosure is laser safe acrylic.",
    "likes": 6,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Also remember diode lasers to my knowledge can't do cut clear acrylic.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Great info. Have you tested yet the Sculpfun of 33w? I saw that can cut up to 40mm",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I've watched this twice, and it is invaluable. Especially the Fibre vs CO2 explanation. Forgive me if I've missed it, but how 'deep' can it engrave? I'm looking to engrave wax seals and am wondering if this is the best option laser to go with? Something that can do fine and deep engraving on brass? Thanks!",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hi, first of all congrats on the video. Was really nice to watch. My K40 is on its way. I have also an Xtool D1 which is not able to cut transparent acrylic. Probably if I would have the space and money for a bigger laser then it would be at least a 9060 which is actually a 100W laser. Vevor has one for as low as 3200 Euros including a Ruida controller. But that one is really a huge machine weighing 420 pounds.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Bardzo stabilny, dobrej jakości obraz! A ziemia płaska jak naleśnik - jak to powiedział polski kosmonauta, Mirosław Hermaszewski w swoim wywiadzie.\nPozdrawiam",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Quick question, what machine would you recommend if all I used it for was photo engraving?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I'm sick of the big laser companies lying and sticking it to the small guy. It's only a matter of time before they weaponize their lasers against us. I say we storm the HQ and take all the goodies.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "What I want to know is which slicer companies have the best support. Something breaks, I want to know who's going to be there to take care of the issues.  I have not heard the best things about xtool.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Everyone I have seen, if you READ the COMPLETE description it will say 5 Watt, or 10 Watt or 20 Watt output. Just sayin..",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Really informative. Thank you. Just goes to show the unregulated bullsh*t they get away with.",
    "likes": 8,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The cutting and engraving metal is the one that gets me, a diode (generally unless IR) will not engrave or cut aliminum it will remove the anodised coating",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Totally true. I mentioned some of these things in my last video too. Happens too often. Great video!",
    "likes": 3,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Great list. Coming from the co2 world and getting into diodes second, a lot of the marketing and \"defaults\" were a shock to me. Couldnt believe they were sold without enclosures and was I convinced it was illegal. 😂",
    "likes": 22,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "The. Diode watage rating was always a complaint of mine. \nIts a combined max of everything on the assembly. So laser turned up. Servos under full load etc. \n\nAlso when you get into large diode lasers the rating is not equal to a co2 laser.  Again different capabilities also.",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Co2 will be more powerful and faster. Though the focus burn is tighter on diode. \nDiode are easier to maintain ( no mirrors).",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "*Quick correction, the Sculpfun S9 has an electrical input of 30W, the 90W in the product listing is from what they compare it too.  It shows that in the product right above the laser output, I just missed it like a dummy..... 🤦",
    "likes": 35,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Can with a glass tube and lenses.\nEverything is or can be made in the USA.\nWe ship tubes, lens and chips to China, they ship it back and we can't compete",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "What type of environment does this need to be kept in? Will be ok out in a garage with no climate control?",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Really informative video for me. I was wondering if i could get an advice from you. I am a modeller, i do paper modelling. From card board mostly. Case like: https://www.youtube.com/watch?v=fVNxurfl-1c&t=187s. I spent some money on laser accessories (support for hull, some large construction parts etc). So now i mostly wonder if investment into laser cutter would be good idea. Would be cool to make my own detailed components like railing, framing - you get the idea. I need to cut cardboard (not corrugated) thick ranging 0.5 mm - 5 mm ( that's max i think) and some wooden plywood (in some cases). Would you advice something with reasonable price (Say under 1 - 1.5K) ? I cannot justify spent 2k on device i use once a month or so.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "great informative video.  I'm looking into getting my first entry level router.  this one seems to have a good value to performance.  just a thought but if you adjusted the spindle up further in the spindle clamp so that the z axis would would hit the limit switch just before you hit the bed.  this would ensure you would never hit your bed plus give you more rigidity in your spindle",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "What machine do recommend better to buy. \n\nI have hexa or xtool p2 in mind.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Hi! So what would be a good machine to cut gold and silver? Maybe at least 1mm of thickness.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Love your videos, they helped me a lot while I was researching what to buy. I ended up buying the OMtech k40+. If you haven’t looked into it you should. I uploaded a poor pitiful video of the unboxing, but it came with some useful upgrades",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Great review and explanation.  I love that I didn't need to bump up the speed to 1.5X to get the information without wasting my time, and I love that you organized your thoughts and didn't ramble, again, respecting the viewer's time.  Thank you.",
    "likes": 6,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "with the program for this can you import svg files from other sources say if I bought a svg file on?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Looks like this video was recommended to me a couple of years late but it's still relevant.  The factor that you didn't mention at all is likely the biggest factor to consider when making this decision... Serviceability.   While the K40 is obviously repairable, since it can be upgraded, it's my understanding that the Glowforge is not serviceable at all.  \n\nLast year I was considering buying a used Glowforge and found dozens for sale.  Thinking that anything bought used would likely at least need a new tube I looked into the cost of parts and the tube.  Turns out you can't buy parts or repair the machine on your own.  If your tube, or any other part, goes out then the only option is to ship the machine back to Glowforge and they will give you a discount on buying a new one.  I couldn't find any other service information so I opted to not get one.  \n\nIt's a truly  horrible policy that makes the Glowforge seem more like a scam than a ligament machine.  I hope that I either missed something or they fix the way they treat their customers.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I didn't catch why you did not include any Glowforge recommendations?  Maybe you mentioned at some point, but didn't catch it. Thoughts on the Glowforge?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I just need a laser machine to cut clear acrylic to make earrings/keychains. Which machine and what wattage would be the most budget friendly and best at getting the job done?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi love the channel what would you say is better out the polar desktop or AF2028-60",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hello :) What about the Emblaser 2 ? It's a diode laser costing around 3600€ (so more or less 3900$)? Thanks.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "excellent content, what do you think of the LaserPecker LX1 Max. \nMy 2 choices are -LaserPecker LX1 Max and the Atomstack A20 Max 20w Large Size Eye Protection Laser Engraver With F30 Pro Air Assist. Which one do you think is better?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Newbie here and your comparisons were very helpful. Still doing research to see what will work best for me. I want to do both engraving on tumblers, etc and cutting so this one looks like it will do the trick. I am a little worried when you mentioned this is not as clear with engraving. Thanks",
    "likes": 4,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Thank you for all the information. I learned the most from watching you. Now I can play around with the LaserPecker Pro that Ive had for more than a year. Lol",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Good grief -- 40w -- good video, nice work as always -- I wish I had bought the X-tool.\n\nOrtur issues  info below:\n\nWell-Known Issues with Ortur Lasermaster 3: A Comprehensive Review\n\nIssue 1: Ortur LM-3 Not Powering On\nOne of the most prevalent problems encountered by users of the Ortur Laser Master 3 is its failure to power on. This issue can stem from various factors, including a faulty power adapter, blown fuse, loose connections, malfunctioning laser module, or motherboard glitches. Notably, the Ortur LM-3 has faced criticism for having an underpowered \"power brick.\" Despite seeking assistance for this issue, my attempts were met with silence. Subsequently, I discovered a suitable replacement on Amazon.\n\nIssue 2: Inadequate Laser Engraving\nWhen laser engravings fail to meet expectations, several causes might be at play. These include improper focus, uneven engraving area, or unsuitable materials for engraving.\n\nIssue 3: Mid-Operation Halts\nFrequent occurrences of the machine halting during operations can be attributed to loose connections, faulty motors, or software/firmware glitches. This issue has been highlighted extensively on YouTube.\n\nIssue 4: Subpar Engraving Quality\nSubstandard engraving quality can arise due to incorrect settings, a dirty lens, or a malfunctioning laser module. To rectify this, adjustments in settings, proper lens maintenance, and considering the laser module's condition are recommended.\n\nIssue 5: Smoke and Odor Production\nDuring operation, the machine emitting smoke or strong odors might be a result of a dirty lens, improper settings, or insufficient ventilation. This concern is commonplace among lasers, particularly during cutting. Installing proper external ventilation and employing an enclosed setup are advised solutions.\n\nIssue 6: Unusual Motor Noises\nMotors emitting abnormal sounds during operation may be attributed to loose connections, inadequate lubrication, or faulty motors. Similar observations have been shared on YouTube. A common cause was Ortur's inadequate tightening of drive sprocket set screws, resulting in loosening.\n\nIssue 7: SD Card Recognition Failure\nWhen the machine fails to recognize an SD card, possible reasons include a faulty SD card, corrupted files, or firmware complications. Contacting Ortur for assistance may lead to unresponsiveness, as evidenced by my own experience.\n\nIssue 8: Machine Freezing During Operation\nMachine freezing mid-operation may stem from software/firmware glitches, motherboard issues, or communication problems between the machine and the computer. Establishing a reliable link between my Ortur LM-3 and my computer proved to be a major struggle. Despite weeks of effort and assistance from Ortur, I ultimately sold my brand-new machine at a loss due to this issue.\n\nIssue 9: Inconsistent Engravings\nInconsistent engraving results might result from incorrect settings, a dirty lens, problematic materials, or a malfunctioning PWM (pulse width modulated) laser power controller. Obtaining assistance from Ortur for this issue was often challenging.\n\nLack of Customer Support and Service\nIn terms of customer service and support, Ortur falls significantly short. Despite purchasing their hardware, I received no aid when problems arose. Requests for help went unanswered, and defective parts were disregarded. Unfortunately, Ortur seems unwilling to invest in its customers' needs or satisfaction.\n\nPersonal Experience with Ortur LM-3\nMy excitement for the Ortur Laser Master 3's potential to enhance my workshop quickly turned to disappointment and frustration. Despite its promising appearance, I encountered only obstacles and minimal assistance from Ortur. Their lone response directed me elsewhere for help. Ultimately, after exhausting various resources without resolution, I was forced to sell the Ortur LM-3 at a substantial loss, leading to the demise of my aspirations.\n\nAn Urgent Recommendation\nGiven my ordeal, I strongly advise considering alternative options before investing in an Ortur product. It is my hope that you avoid supporting a company that displays such an evident lack of commitment to both product quality and \ncustomer service.\n\nParting Thoughts\nI am not inclined to write negative reviews, but I felt compelled to share my experience as a cautionary tale for others. Thank you for taking the time to read my account, and I sincerely wish you success in your pursuit of a laser product that truly meets your expectations.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Hey. Downloaded the cutting test file but yet to run it. Just looking over the layers I can’t see how you’ve set the 10%,20%,30% etc for each speed. They show as 100 for each square on the layers. What am I missing ? New to lightburn so assume it’s overwritten somewhere ? Thanks!",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "So, if I want to engrave into things like tool steel, I need a fiber laser? I want to actually engrave and not just a light etch. I have a lot of questions, and no one here can answer them...",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Could you please recommend a less expensive laser to cut shapes , letters and maybe etching on 1/4 -1/2 inch mdf or plywood? Ty",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Can you please recommend a budget laser that can cut and engrave 1/8”-3/16” thick cork board? Really have had a hard time finding any videos other than the glow forge completing that task. Thanks",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Can you tell is the depth of the router bit and end of breadboard to attach this? Thank you",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "What would you recommend for 1mm silver cutting for name tags etc.  Thank you",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "what about cutting holes where its just the tool size in 3/16\" aluminum. so no craving just straight downward holes.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Not sure if you are still monitoring this vid, but how did you create tight joints on the end to end butt joints?  Clamping across width seems all good, but clamping each row across length to tighten the butt joints does not seem too easy.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "i used to use a friends k40 style laser... the extremely small bed size made it a problem to do what i wanted to do. im looking at the 40watt xtool with the extended workspace upgrade. id love to see a review of that with cuts into 1/2 and 3/4\" plywood",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "How come in all these laser videos, no one ever talks about AP Lazer?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "iKier K1 Pro Max: 48W/24W is the very best on the market for sub $2k. I just ordered one after shopping for over a year.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I have had several lasers diode & co2 over the past few years and being pretty familiar with them now I wanted to commend you on what I would say is a unbiased overview for those getting into lasers for a hobby or for work…  This review and chart would have been so years ago!\n\nI just ordered the new Gwieke G2 and I’m excited to be getting into the world of fiber lasers, that said, please check the speed you have listed on your chart for this one, it certainly needs updated..",
    "likes": 4,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Ive owned 3 thunders and they all have been fantastic! nice review..",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "i found this for 200 on sale .. woudl you say it's a good deal ? really worried about that air though",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Help please explain how to set up and use the xTool P2 CO2 Laser with light burn, no one explains this very good",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "What type of eye protection do you use?  I didn't see any links to eyewear gear.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Very good review. Which machine would you recommend to engrave rocks and metal?",
    "likes": 1,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Never trust the eye protections given to you by default !!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "So you cannot use LightBurnt for this ?? Would be cool if you explained more why this software change.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Any idea a cheap cutting machine for a jewerly cutting?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "for how whats to know you need a spray paint with titanium dioxide to makes this work normal spray paint dont work",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "What kinda maintenance is required for this laser? Mirrors look hard to get to get to clean and adjust frequently. Or don’t they need cleaned is that only on the bigger non desktop versions. Don’t know much about co2. Just heard the are a lot of maintenance. I own a d1.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Hi Brandon take a second look at the inside of the Gweike laser cloud or Nox you will find very very bad wiring a fire waiting to happen please don’t recommend this as someone is going to be harmed by this company shortcut on wiring safety",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Take a look at the wiring inside this water reservoir next to power supply it’s a fire hazard even when turned off if you love your family stay away as you never know when this is going up in flames",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "@ComgrowOfficial has a 20w diode, with air assist, for less than $600. I have their 10w ($300) and love it.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Is this what youd recommend for someone that only needs to cut through thick cardstock?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "The problem that I have with Atomstack (and various other companies) is that they lie outrageously about their laser power, advertising the power consumption of the unit rather than the optical output power (which is the only thing that is meaningful). Reputable companies (J-Tech Photonics and Gweike Cloud, for example) do not do this. Yes, Atomstack buries an optical output power deep in their text, but I wouldn't trust it to be accurate given how dishonest they are in the rest of their advertising (for example, 48W for the X40 MAX is **obvious** BS to anyone familiar with diode lasers). In my opinion, we should boycott all laser manufacturers that even mention the power consumption, given how much it misleads many buyers. And, I want to see them show the ACTUAL laser output power being measured with a power meter (again, J-Tech and Gweike Cloud do this).",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Your videos are super helpful!  I’m looking to create rubber stamps using laser engraving.  I will be making a lot of stamps so I know a larger bed is one important factor and probably good ventilation is another. A lot of the machines don’t indicate use with rubber.  Should I assume if I don’t see rubber listed on the materials that I cannot use rubber in that machine?  Do you have any suggestions for a good model for what I’m trying to do?  I was thinking of the Omtech 40W O2 but that is kind of pricey for me just starting out.",
    "likes": 3,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I noticed you didn't mention Boss Laser. Do you not recommend them?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Why no mention of Roly LaserMatic 10?  So much better than the Xtool (and I have an Xtool) but, I get it, Xtool doesn't allow you to mention the LaserMatic with all their marketing contracts.  Seriously folks, do yourself a favor and look at the Roly LaserMatic 10.  Sooo much better than the Xtool and others.  Many accessories of the other diode lasers are included with the LaserMatic 10.  All for under $1,000.  I wish the Roly was available last year when I got my Xtool.",
    "likes": 75,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Can you go all the way thru 1cm thick plates? To make puzzles and stuff",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Could i please ask you a question? the elephant on 7:10 what kind of colour is the result? is it a darkgrey, a kind of black or is that an effect of the light/shadow?",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Is there any way you can shorten the tool extension beyond the collet?  That would help dramatically in reducing the chatter and rough finish.   The shorter, the better.",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Great video! EM-Smart is also a desktop industrial Fiber Lasers.",
    "likes": 2,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Looking at the D1 or the P2... mainly going to cut/engrave leather for patches (MANY) and 2 layers of twill for garments... Is one going to be substantially better than the other? Thanks much!!",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I honestly don't understand why you would want to cut through thick plywood on so many passes at 100% power, not unless you have deep pockets!. \nDiode lasers, although they can accomplish it will burn out in no time.\nMonies wasted there replacing the diode lasers over time could have been used on a decent 60-100w CO2 laser which can at a lower percentage output, put up with the abuse.",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Consider Roly 10w, enclosure, w exhaust fan, air assist, camera. I love mine, my frist laser. I can't imagine a better starting point for a hobbyist. Nice informative video.",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi Brandon, after watching your channel for what seems like years lol, I finally purchased the Xtool d1 pro 20w with the ra2 and the IR head as a package, really enjoy playing about with the laser , not mastered lightburn yet but I’m getting there. Not sure how good the IR head is because it’s dreadfully slow but it does allow me to mark on materials the blue diode can’t touch. Love the channel and thanks for the brilliant reviews and knowledge base.",
    "likes": 6,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I remember watching your videos a year ago on which route to choose C02 or Fiber, I have chosen the fiber route and bought myself a 20W Galvo Laser and my life has changed for the better ever since. Thank you for your recommendation and keep up the excellent work!",
    "likes": 8,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I have a question and I was wondering if you had any input. I started out with an xtool D1 pro and had so much fun that I wanted a CO2 laser. I recently bought an AF2028-60 from them. When it arrived it was instead a usb-0705-u1. Instead of the 600mm/s time of the machine advertised, it was  listed at 500mm/s. I contacted customer service and they said I got an upgraded model. But if so why is it slower. It seems more likely to me someone either screwed up or sent me an older model and thought I wouldn't notice. Any advice you've got would be appreciated. Love your channel by the way.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Used a Trotec 300 at work! Nice machine! All Fibre though, company didn't get the Flex Model that also offer the CO2 laser!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "just keep spending money, and keep showing the next bigger more expensive lasers. Why not show what you can do with them?",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Or get a 40w K40 CO2 for like...$500?  You're irresponsible for suggesting these garbage diode lasers to the public.  They are open, they don't have safety measures, they don't have proper fume evacuation, etc.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Your statement at 3:29 is a little bit misleading. One could think only lasers with visible light are dangerous, whereas lasers with e.g. 1064 nm are even more dangerous, since you can't see the beam and might have a false sense of safety.",
    "likes": 3,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Nice overview!  On a whim, I bought the cheapest Aufero Laser 2 for $160 and couldn't be happier with what it can do.",
    "likes": 8,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Very good comparison.  Are you planning to review the Xtool F1?",
    "likes": 2,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "This is a neat little round up. I used to love working with a laser cutter at a shop I was part of and I've been missing it and this helps a lot with the state of the tech now.",
    "likes": 8,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "have you done a comparison video on a UV and a fiber?",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Also, one of the things I never understand is why laser manufacturers don't make laser beds in the common sizes of materials.  When I built my 90w CO2, I did so catering to my needs to cut 2'x4'/610mm x 1220mm (actually 700x1250mm bed size) materials.",
    "likes": 16,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Great video!  I just got a 60w Mopa fiber laser delivered yesterday.  It's a game changer when you're used to a CO2 or diode. 😅",
    "likes": 3,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hey quick question: At 6:45 you say you CAN'T do actual raw aluminum, but then immediately show it being engraved?\nSo CAN you engrave raw aluminum or no? To what depth? I need to not just burn out the pigment of the anodizing, but rather dig to a .1mm depth so you can feel it's depth.",
    "likes": 5,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "YOU need to update this video friend, many things have changed :)",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Have you compared the xtool P2 laser against the newly released Thunder Bolt desktop?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I just got a Autero Laser2 a day wou.d li,like, to do the tests you did in your video but I can't find it. Canyon send me the link. I enjoyedyourvideo and Plano watching more of them. Thanks😊",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Great video, as a noob I have an atomstack A5Pro+ and I like it and I intend to only engrave but lately thinking of making router templates and a 10w machine would cut 1/4 \" material,  but to many choices if you get a 10w you loose engraving detail  read everything on Ortur and the Ortur LM2 Pro S2  looks like one i would like, just to may brands and choices.  got an Idea?",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "One's a diode laser and the other is a fiber laser.",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Can you engrave tumblers like Yeti with the OMTECh?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "As ever - a Fast & Furious delivery efficiently covering lots of aspects of the machine.! I have an LP2 and Atomstack A20 and wish I'd waited for LP4, but we can keep waiting and tech is hitting us with fast updates - we cannot keep up.! Keep the utube  videos coming.!!!!",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "would love you to compare this the the similar xtool.",
    "likes": 2,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "+50% $ for an upgraded machine sounds great. \n+100% $ sounds justifiable if the quality/features are there.\n+250% $ is way too hard to justify IMO. You could buy 2 of the OMTech lasers + 5 Extra 60w tubes that will last you the next 20 years for that price. And the Thunder has a smaller build volume and no camera? I like that they're trying to make a more premium Chinese laser but I think it's an oversight to not at least include the features of the competitors that are less than half the price.",
    "likes": 10,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "They should have called it PeckerLaser.  Market it to the Tattoo industry.  Missed opportunity.",
    "likes": 2,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "So I went with the xtool f1, for the lightburn and the fact its far safer and easier to carry. Note you didn't mention the software much if at all and that worries me.",
    "likes": 1,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Xtool F1 is 4000 a second twice as fast, laser pecker is junk, I had one",
    "likes": 2,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "72000 piedi.. Quasi 22000 metri... Orizzonte piatto😊",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Just staring at that jacket collar the whole video 😂 thanks for the info tho!",
    "likes": 5,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "can anybody tell me how long the laser diodes will last approximately when using this machine for cutting 3 mm plywood?",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Nope its junk. 3 weeks in and its just a total POS. Crashes into prints after filament changes power failure resume doesn't work itll just stop printing at times. Runout detector is junk and failed within 2 weekw. Extruder was loose and belt was off when arrived. Bed wont stay level. Overall very upset with all these biased reviews on YouTube. i understand you guys were given free machines but come on be honest.",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Do you know how the fine adjustment (up and down 6 mm) screw tighten? Mine is out and I can't seem to tighten the laser module.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Hi, great video, thank you. Will this K-40 engrave acrylic? Also, will it cut through 4mm thick acrylic?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Loved the review. Will this do a deep etch on ceramic mugs. I do sandblasting of mugs and get a deep etch. I would like to get the same with this machine. Thank you.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Would something like this be okay to engrave metal like stainless steel",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "The new k40 on OmTech's site is LightBurn compatible and still A LOT cheaper than most 40W Diode lasers.\nAny reason to choose a diode over this?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Disculpa con ella puedo hacer invitaciones con cartulina de 235 g",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "would like to have seen you show how to do these things rather than talk about it. kind of leaves a person like how do i do this? there are several steps especially in light burn to invert image. i see other links for that in description, so cool and thank you for the test files.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "So are you able to cut thicker wood when your feedrate is higher and you're cutting it several times, to avoid the fire?",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Wanting to add custom leather patches as an option in my embroidery / silk screening shop what do you recommend for a laser cutter?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Now what are the other attachments that work with it",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "How big is the work area with the conveyor installed?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Hi, awome reviews.The one thing that all these high powered diode lasers reviews fall short is....can it engrave clear-, white-, blue-, yellow-acrylic?",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Nice video, I have been working with lasers since this year and your explanations have taught me a lot，thank you！",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "He straight up disrespected Xtool when he pull that Atomstack out 😂🤣",
    "likes": 0,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Hi! Thank you for all these info! But at the end I’m not sure what is the best for me. I need to cut small 2mm Bakelite pieces and also 0.5 mm metal sheets. Can you recommend the best cost/features model, please?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "So 4k+ for the machine, then 50 bucks per month to use it? What the fk chuck? That is a horrible business model for the customer.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Spent 30 minutes looking for a true unboxing experience. Not only did we get a 40 minute video we got full commentary and multiple camera angles. God bless you.",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "neighbor threw out the housing/box for a K40 and now here we are contemplating building it or tossing it:P(only really wanted to salvage the plexiglass/plastic as I knew roughly what it was)",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Is there a way in Fusion 360 to create 2.5d from vector or any other picture?",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "What is the size of the grid matt you have under it? Thanks!",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Hi everyone, You can also create dovetail joints using this extension: https://youtu.be/MKiWr-Mndl0! Thanks for this great tutorial ! 👌",
    "likes": 1,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "Combining this with zach freedman's girdfinity would be great.",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "Thank you for this. I own a diode (M1) and I want to upgrade. I’ve been on the fence between polar, gweike and a Mira. I don’t want a Glowforge (nightmare) as several people I know have one and they told me don’t get one. I am patiently waiting for my polar, just purchased. Look forward to learning more from your videos!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Or go for the Comgrow 10 watt at $250’ish refurbished. I bought that plus an enclosure, air assist, and honeycomb bed for $350.",
    "likes": 5,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "Great video, where can we get the SVG for that watch cutout?",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "DO NOT use MDF unless you are very well aired out. That stuff is bad for you to breath in",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Maybe I am blind. Air assist is nice to have. But where comes the power from? Couldn´t find the plug in.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "A great tip for engraving plastics or doing the tumblers you show in this video is to put a thin coat of dish soap on the surface before you engrave. It helps keep the soot from settling on the surface and makes cleanup afterwards a whole lot easier.",
    "likes": 18,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I bought the Gweike Cloud one Year ago, and was not satisfied. I struggled with some technical issues and the support was poor, until I get a bit mad and called them directly in China. From this point they tried to help me, but in the end I sold the machine  and bought a used Gcc X252. Its not fair to compare this two machines, but the Gcc was really effective to use. No problems, just do the work.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I heard a Chinese person pronounce it gway kuh.  Thanks for the review.  Very informative.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "21:08 is Collinear not Parallel. I just redid the tutorial 2x and setup a separate instance of 2 rectangles trying to figure out why I kept getting constraint errors! LMAO. It didn't occur to me to actually watch which option you clicked on. Thank you for the tutorial, I learned a lot.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "What is the preferred water use for the laser?   The instructions say purified but can you use Distilled?\nThank you.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "you always forget about the sound factor. on every machine your review.   Many of us use it in the Kitchen .",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Not interested in this Particular machine, but it was educational. Thanks!",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "How feasibile would it be to swap out some of this hardware to be able to handle actually cutting metals? Or does anyone have any other recommendations for low price cnc metal machines?",
    "likes": 7,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "*_Would you mins updating your links on where to buy this laser? the one you posted is insufficient._*",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "For me the controllers are what made me keep my atomstack and get rid of my xtool I have all my regular files on the memory card and just select them on the controller and cut when needed no need to connect to my laptop and go all through lightburn so much easier for me",
    "likes": 3,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "With so many reviews, do you have a spreadsheet with comparisons? I'm really close to pulling the trigger on getting a diode laser. So far, the xTool D1 Pro is still at the top of the list just because of some build quality on its behalf.",
    "likes": 1,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "So when they talk about the \"shut down on fire,\" does the laser module move away from the source of fire, or does it stop right over it?",
    "likes": 1,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Wait a diode with no zip ties required.... SEND IT BACK 😆",
    "likes": 3,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Was so close to buying this last night, but decided to wait for the 40W version thats out now. Seems to be a very good machine, just a pity they didnt give you the 40. Keep up the great work, appreciated.",
    "likes": 1,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Was expecting some few comparison to the ortur, xtool etc. Whats your take?",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Looks great. If I were in the market for a laser I'd definitely have this at the top of the list. \nTechnically I'm always in the market for a laser, but my wallet isn't!",
    "likes": 3,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Hey if you want to donate any of your older machines to someone please pick me ! Lol",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Your videos are super helpful. One of these day's I'll buy a diode laser. Any opinions on the ACMER P2 33W? Just saw it in my feed the other day and it looks like a decent high-watt diode laser. I want to be able to engrave wood AND cut 1/8\"–1/4\" MDF or plywood for templates.",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "Awesome! Could you compare the dot sizes like you usually do?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "You failed to even discuss the uses of the CO2 laser.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Can I keep this in a wood shop or is the dust going to be an issue?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Got my laser off eBay, 100W tube, 900x600 huge area, Autofocus, rotary axis, 900mm/s max speed in stock configuration. Paid $2000 delivered, earned probably $6000 with it already. All these machines that you test are just fancy toy machines for people who know nothing about technology really. Hardly upgradable too. That tiny area is probably barely going to cover needs of a housewife, and don't even get me started of how much these companies are charging hamsters for their K40 $300 equivalent toys. If I wanted to spend a $3000+ on a CO2 laser, I would just build a freaking servo driven 150W  1m2 monster. They way people waste money is just hilarious. I mean, same people buy carton sheds in usa for $500000, what can you expect from them after that lol. The only thing I truly hate about all industrial lasers is a very stupid controller and a software, RUIDA controllers absolutely suck and they are supposedly the best around, so everything else is even worse apparently. I'd love to have some opensource FW options to be able to tinker and add more features to industrial lasers.",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "It's not worth it. A business won't buy this kind of maschine, a hobbyst would do much better in buying a cheap maschine, enlarge it and get an after market laser module for that. That thing is not even made of standard profiles so you can't enlarge the frame.\nAlso this is a poor job of a review: no test of cut, no test of precision. Does it cut acrylic? How thick the wood in one pass? It comes with air assist and air compressor: pressure, air flow, misdirections?",
    "likes": 1,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "I wanted to use it for “kiss cut” stickers. Is this machine a good option or you recommend other ones ?",
    "likes": 0,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "could it be used to clear graffiti from a surface say like brick?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Can you make a video of the speed of the polar for leather patch engraving and cutting?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thanks for the valuable information-love your fast paced reviews.  Other Youtube reviewers I have to turn the speed up double to get thru it all.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Avoid this laser, I ordered one based on the comments/review from this video and have had nothing but issues, just a huge waste of money. Do your research and invest in something other than this laser!!!",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Which one is best for glass engraving? I want to do beer mugs wine glasses shot glasses n ect.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "How is the G machine on graving glass? I'm into engraving beer mugs and wine glasses and shot glasses ECT.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Say you have a four foot piece of steel that is 1” wide and only 1/4” thick and you only needed like a four inch linear logo engraved. \n\nCould you just slide it on top of the work area with the unused pieces hanging off either end? Or does the entire piece you’re engraving have to sit inside the workspace. \nThx",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can a laser engraver cut paper? I looking for a cheap one that can cut A3 paper for stencils",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "This is definitely not a good CNC machine. This is a toy. If you really want to buy a toy like this, buy the cheapest one. You will probably be able to engrave printed circuit boards, and thus softer materials.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I'd like to know the CONS. What didn't you like about it as you used it?",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Great video thanks, I have the lu2-2 and can only engrave works good But now I want to cut. Ortur wants me to upgrade to the pro. But Im limited on dollars. do I get the SF or LF ?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Thanks for the review!   I had to laugh when you quoted the power, and yes, it is what atomstack quotes the input power is... But. further on in their spec sheet they say it comes with a 12v 5 Amp power supply.... eye roll.... yes, that is a 60 watt power supply.... so I really don't know where they get 130W from.... Anyway, it is their spec, you are being true to what they give out.      On the co2 equivalent, the Epilog 75watt I had use of for a few years, required 240v and required a 15A circuit, so perhaps they should say it was a 3.6 Kilowatt machine.... I must say though, I am pretty impressed by these little laser machines, and they do some stuff better than a co2, just slower",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "These lasers self-identify as “guys”. Folks… please stop calling things “guys”, “kitty”, and “doggy” - especially in the 3rd person.\n\n“Kitty likes to be scratched” - annoying AF.\n\n“Doggy was found on the side of the street!” - nobody gives a crap, because you sound like a toddler.\n\nYour inanimate objects are not a  “he”, a “she”, nor should they be associated with any other gender. Call it a f#cking red dot man. It’s not a “this little guy”. 🍌\n\nEdit: this ^ and “yeet” really trigger the sh|t out of me… sorry,\nThere’s probably some good laser content to learn from here, but I said to myself: “if he calls something a ‘guy’ one more time,\nI’m out of here! Seemed to really become a fad in 2021+ for some reason.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Download link gets me nothing but an ad! I put in email address and nothing, nothing! Checked all folders including spam and NOTHING!",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "What material do you use to engrave the Area 51 project? Best regards, great tutorial.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "could you guide me in the direction of a machine. \ni have this 2 millimeter thick Circuit Board with copper on one side and the rest is an epoxy resin that i would like to cut into 1/8 inch strips.  this is all new to me and i just need a cheap machine for starting out. can you guide me in the right direction for a total new b. thanks",
    "likes": 0,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "I have the D1 now, and I'm thinking about this as an upgrade. What is your opinion?",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Can you please compare the MIRA 5  with all the other desktop CO2 laser you have tested before. I would really like to hear your opinion what you think about it.",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Would a laser cutter cut aluminum or melt it. I need small pieces cleanly cut.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I like the atomstack. I have the x20 with extention. And use the xtool ra2 rotary.\n\nWhat i dont like and see that isnt changed \nThe feet risers  are just wierd.\nAnd the connections on top for usb and power still there. I dont understand that they disnt changes those things with the x30",
    "likes": 0,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "I can confirm that where you purchase the laser absolutely makes a difference in the support you get. I could not get any support from the company and they told me I had to go through the reseller for support...which you can imagine was not nearly as proficient.",
    "likes": 5,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "I find myself wondering if there are any diode lasers that integrate any sort of air control. I'm not that familiar with lasers - I have had an Ortur LM3 for some months now and become pretty comfortable with it. I use Lightburn and see that little switch in the layers tab for \"Air\". Not sure if that's a thing that is ever used with the cheaper lasers. Or, honestly, even the larger ones. I've never used a CO2 laser. I've found I get much better engraving results (or at least have to sand a lot less) if I don't use air for my engraving, or I use really minimal air. Really dig the channel and reviews. Thanks 🙂",
    "likes": 1,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "I work with industrial flatbed lasers that cut up to 1 inch thick aluminum plate. I realize this far removed from the \"hobbyist\" spectrum, but I am awaiting the day that we have hobbyist level lasers that can cut sheet metal components that can be used in weldments.",
    "likes": 6,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "Atomstack now also have an upgraded controller that you can use with LightBurn to control the air assist (on/off). I agree that handpad is useless. One thing I never see mentioned is diode laser life. My x20 has reduced in power by about a third (according to my cut tests) with only 10s of hours on it. It's not a dirty lens/lens protector or S30 setting issue. They have agreed for me to send it back (after copious amounts of poor and repetitive formulaic email support). On the whole I'm not impressed with the build quality. The focus adjustment is sloppy (the addon z-height adjuster requires moving the M2.5 tapped holes for a limit switch), my x-axis eccentric nut was over tightened at the factory which damaged the v-wheels and I had to replace them. The cable management is poor. My next laser is going to be the Roly 20 or 40W. The Roly10W build quality is amazing and their tech support is first class.",
    "likes": 2,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "Between this and the xTool D1 Pro, I'd most likely pick this. I don't need the smaller laser, and this comes with the air assist. And if I need the smaller dot, I can buy the 10w laser from the M50 and still be 10% below the total price of the xTool D1 Pro.",
    "likes": 2,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "Nice! I hate the external controllers but that's the most aesthetically pleasing to look at air assist unit I have ever seen. 👌",
    "likes": 1,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "Hey dude, any chance you might like to donate me a printer 😅",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Why do YouTube video makers think they are comedians or actors?  Just give the review.  Like a professional.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Do you have an update on Lightburn combability? Also does this require some type of fume extraction?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "ive been looking at this p2 as well as the omtech polar havent decided on which one since im a first time user my budget is like 5k which would you reccomend",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I have a question. I'm curious what eye protection you use. I just got a k40. Very concerned about the uv radiation. Also,  Do you think the tinted window filters uv effectively?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Comparing diode laser to CO2 laser do you really run the 55 watt CO2 at 55watts or even 40 watts since that will really shorten the life of a very expensive-to-replace laser tube?  It seems like most folks are actually running their CO2 lasers at 40% or so output which puts a 20 watt diode much closer to a 55watt CO2.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Hey man video was great. Curious I see everyone doing wood, wonder if it’s possible to do cups/metal etc.",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Seem like a really nice space.\n\nIm only new to your channel and am enjoying the videos on lasers.\n\nI dont have a laser yet, would you make a recommendation for any laser for a beginner?",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Which will you recommend for jewelry? Not expensive please",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I bought an ORTUR Master 3 LE in January, and it still does not work. I have sent loads of emails, videos, and photos, so they sent me a secondhand laser, which does not work either. Today 31/05/2023 and I have been ripped off by ORTUR.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "i use the Honey extension on my desktop, and when i put your code in my order i added it to Honey so now it will automatically add it to peoples carts when they use the extension for coupons 🙌",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "In the future a compinaton of gantry and galvo is the way to go with also both laser sources CO2 and also Mopa Fiber laser. Trotec is the leading in that sector",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "This is an ad. At the very start of the video, it should have been disclosed that this is an ad. It's not a review, it's a paid advertisement. So that said, you're breaking laws in the US.",
    "likes": 2,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Hey man love your videos. Could you make a video on safety protocols? I watched your video on the omtech polar and purchased one. But after reading the manual, im super scared of random reflections from the laser bouncing out of the engraver. The manual says to always wear glasses, is it really necessary? I thought I would be able to look through the glass lid while the machine is engraving ... Do I only need glasses for this? What if I open up the tray and use the pass through, or the rotary tool, does the opening at the front of the laser leave me susceptible to laser reflections and  possible burns or blindness? I know it may seem like i'm being overly paranoid, but these are the things the warning labels talk about, yet I see people operate them online as if closing the lid is more than enough. I even saw one man stoop down and get eye level with the laser as it engraved a glass cup, the front of the engraver was exposed and open. I'm a complete novice and have no basis as to what is normal to do or not to do. I would truly appreciate your insight on this.",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Great vid! Quick question: i'm looking to get a laser engraver that can cut holes in film (the kind of film of put in an analog film camera). Do you think this engaver can do that? And will it cut the holes cleanly like the holes that already exist at the edge of camera film? Thanks!",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "*Well, I know what my next laser machine will be. Thanks.*",
    "likes": 2,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "All fine and dandy. But I would like to know if there is a video showing how and where to put material on the machine. \nIs there a video fir that!",
    "likes": 1,
    "video": "Why do these lasers cost so much?"
  }
]