[
  {
    "text": "So can you print colors onto a 3d print instead of needing different color spools",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "i have a strong suspicion that this is going to require the cloud and require accounts to use. is that the case? if so, i absolutely refuse to buy any more cloud reliant stuff in my shop or my home. it is the biggest deciding factor in products that I consider purchasing.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "You mentioned a regular laminator but they are selling it as a uv laminator. Which is it, because i have a good laminator.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can you color print onto a 3D print? Say you print a model of R2D2 on your Bambu in white filament… could you then put it on the spindle and Eufy print the colors on it?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Used to own a HP 60\" wide UV printer. Printed whole sheets of plywood. Large tiles, cardboard, etc. The ink was highly toxic and crazy expensive. Print heads failed often. Printer was $80K in 2014.",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "All though I would still ventilate the workroom while working with any resin. I think the saving grace here is that it's printing and curing small thin layer at a time so you not getting as larger amount VoC floating in the air like mixing resins or an open vat like a resin printer.\n\nThough this was an interesting machine that's taken the resin printing of larger machine and gives a smaller and easier to maintain printing profile for the resin to the process.",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I do not see how this has innovated in any meaningful way. Like… every uv printer ever just has bottles for the uv resin and you can fill them with whatever. This nonsense introduces shitty vendor lock-in with cartridges. I hate it.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "because it prints a white layer first cant you just paint the object or area white first yourself and print on top? Meaning is it capable of printing on top of paint and is there a dont place a white layer down option?",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Please INVESTIGATE HOW TO ACTIVATE the “AUTOMATIC DUBBING” of YouTube, they are great, and will literally reach millions of people who do not speak English fluently. I love your channel but I hate reading subtitles",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "At some point someone is going to come out with self serve laser tattoo printer with a handheld scanner and print head all in one",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "That print time is crazy. I have a refinecolor zz13 and to print a 11x14 inch sheet of aclyic on the highest setting with 100% white takes 15 minutes. 30 mins for that print is ridiculous",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I'll wait till it's actually out. Kickstarters have left me hangin a few times so f that.",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Thank you for sharing this, I hjope they are able to launch in the UK",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "just ordered the Gweike RF metal tube machine, to me the benefits are worth the uplift in price",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Hi, what is the largest (longest) tumbler it can take?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Some dimensions for the printer when the front and the back are closed? Thx",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Do you think it could print graphics and text on to plastic models and maybe replace decals or stickers that conform to the model? Thinking about how it would handle rivets on a plane wing or fuselage or branding on an HO scale or  G scale box car or tank car?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "How long did it take to print the Cassian 2.5d print? What about the NY one?",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Solid no from me. This company dosnt have a great history and not off to a good start either with lots of people not getting any response at all from them when other similar companies have answered questions etc from day 1. Also its subscription based, dosnt appear to have any new tech in terms of print head leaving the machine open to issues known with this method.  This is why theres a proce difference between Chinese UV printers and the proper ones made for the job like Mimaki etc",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I would be cautious like others have said. It is for sure interesting however",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "amazing machine, but i dont have enough kidneys to sell to pay for that ink\n\n\n\n\n\n\n\n\n_[insert joke about looking for a new area with more homeless people]_",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What's \"it can take a while to print\" mean? So odd nobody is saying this cup took X min. This piece of wood, x min. This sticker, x min.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I wish he told the true on the low end of co2  11:04 is not the lowest end at all. His chart before that miss all the sub 2k dollars machines",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Was there even one millisecond during your entire video when you weren't talking? Sorry, but it sounded very hectic to follow.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "With the company history, lack of current support of products they made and a subscription service to use, I think everyone should pass on this.",
    "likes": 131,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "As long as there is no information about the colors (ie consumption and costs), then I see this video as an advertisement for a probably free product.",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I was looking this up because I was curious to buy and thank you for this video. I'm certainly going to pass.\n\nMainly because it's crystal clear now that they're going to absolutely drain you of money due to the ink. Every 3 hours to cycle a bit from their already small cartridges (I understand the importance of this in a uv printer which leads me to:) + no area for you to do a manual access cleaner flush yourself that I'm seeing to prevent that if you choose to unplug your machine yourself and instead do it via a cartridge you have to shell out money for + £300 (?!) to buy a set that is only from them  = you spending way more than you've spent on the machine itself in a relatively short amount of time. It's set up to money sink you from the start.\n\nNot to mention ink that isn't even guaranteed to be sold for as long as you have this machine because they might discontinue.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "After dealing with their total flop AnkerMake M5, ain’t no way I’m going to buy anything again from them.",
    "likes": 6,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Everyone anxious to get this - keep in mind if you are in the USA, and it ships from China, your $1499 purchase will cost over 4k when the new tariffs are added in.",
    "likes": 30,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "My main concern is the reoccurring cost of the cartridges... would be a lot more willing to buy this if I knew that generic/cheaper cartridges would be available",
    "likes": 14,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "8:29  - Eufy-specific resin? Eufy-specific cleaning cart? All locked to Eufy?\nInteresting machine, but no way I'm buying this now.\nI'll wait a few months for Anycubic/Creality/Phrozen etc. to come up with their version, that we all know will be open source and not locked.",
    "likes": 38,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Will it print to fabric? When you do the real review can you do durability test on the prints?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "It’s an interesting machine, but £300 for a set of cartridges 😳",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "this machine is made by the same company that made the by ankermake m5, that is now also discontinued just like they discontinued a copple other of thare products knowing that ill wait untill someone els makes this kind of printer.",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This is 2D and 2.5D (bas-relief). Perhaps this technology will soon venture to full 3D and be a new contender to SLA/MSLA 3D printers?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Good video :) Thanks for posting. Imagine what you could do using different colored woods (like dyed), endless possibilities.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "can you print 3d onto the film, just wondering if you could design & print a custom pin badge on it",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Thanks for the video. I needed to know these details. \n\nBuyers beware! I placed a deposit last week because the website clearly states it is “fully refundable anytime”. Now that I know more about it and the full price, I decided it is not for me. Although trying to cancel my deposit, I get this message from EufyMake support: “Please note that if you place the order on our official website, you have a one-hour self-service cancellation window.” And they are not cancelling/refunding me. You have been warned.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Great video! So would we have to replace the cleaning cartridge every two months? I was confused about that.",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What type of sticker is being used to print on? Must the sticker be purchased from eufy?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I wonder if you could print on terrain on a sprue like Dungeons and Lasers does.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Must the substrate, cups for example, have a sublimation coating to accept the ink?",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I know it’s not capable of this- but how cool would it be if it could fully paint resin model parts?",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What is the process for cleaning the overspray on the print bed?",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Feels like another Sawgrass printer idea of making all their money off the ink.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I just put down the deposit. I hope its all good, LOL!",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "im a lil broke at the moment or else i would have joined the kickstarter right away...  maybe its a good thing to wait a lil bit to see the first problems... im still a lil bit skeptical with the printheads... i worked with a swissqprint nayla4 for a while, the printheads needed cleaning every day so u needed to print something everyday if u want to be on the safe side... also 300usd for a set of colors is more expensive than a normal bottle for the big boys... but anyway its cool to see this tech coming to normal users!!!",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I wonder if you can 3d print the accessories like the mug stuff instead of buying",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I bet the price of the resin will be insane, and no third party brands will work.",
    "likes": 15,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "As a small business I’m so close to putting down my deposit but I have a few questions maybe you could answer please. \nThe biggest attraction to this for me is portability and being able to print on demand at fairs etc but timings would be a factor as to whether this would work for me. How long did it take to print the logo on the cup you made? I mainly do mugs, tumblers and then smaller gift type items, my images would be flat without the raised  elements, could you give rough timings for the cup please. Thank you",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This is a first iteration of the technology. The real value will be when it can print on uneven surfaces. I'll consider it then.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "First thing stand out to me is that GREEN TAPE WHY THO WHAT FOR HMMM?🤔",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "This has me interested enough I did the deposit hopefully the consumables aren't to crazy expensive. This has so much potential with my laser cut designs that it's worth the risk. I sure hope it works as good as you have shown",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Price of cleaning cartridge ? And how long does the ink last? About how many prints? Because the cleaning cartridge every 2 months sounds expensive to say the least.",
    "likes": 63,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "How would humidity affect UV printing? My workshop is in my cellar, which is quite humid and cool. I hear they smell quite alot, so I'm not sure about putting it in the office.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I put the deposit down yesterday. I can see a lot of good uses for it in my lineup. I have 3d printers, lasers and cnc routers. I have ideas 😅",
    "likes": 17,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "How would it look if you \"3d\" print by 2.5 printing on 2 sides of something",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What print head is in this?\nTraditional UV printers either have very short lifespan print heads or incredibly expensive ones.",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I own a Roland uv lef2-300 what's the print area and how is this different from mines I like how you can do mugs I can do that with the I have and I paid a lot for it",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I've heard something about a subscription service? Thank you for the review. I have a few eufy devices around my house and they've performed pretty solid.",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Wanted a consumer level Uv printer for my art prints for a while now… hope this machine isn’t too insane in price",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Thank you! I’ve been asking eufyMake questions for the past two weeks that you finally answered.",
    "likes": 11,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "How fast is the printing speed. Its awesome and all but looks slow. I wonder the time for a 12x24 simple canvas with no 3d effect??",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Cool beans! Is the ink dishwasher safe after cured? For situations when you have to clean those tumblers or mugs. Were you able to test the ink resistance when left outdoors for a period of time? I'm interested if it fades relatively quickly. What about printing on curved or organic shapes that do not fit on the rotatory tool? I know for some laser machines they use the inbuilt laser to make mesh of the curved surface so the engraving comes out the appropriate size with minimal skew. And lastly, I assume you can print on flexible material fine?",
    "likes": 4,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I would be interested in seeing if you can color inside of an inlay on wood.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "this is pretty major that they actually physically have a product out and gave it to you, because I remember seeing this in its earlier stages awhile ago and it looked like one of those scam things.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I'd love to UV print onto skateboard blanks! Thanks so much for the video.",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Maybe I missed it somewhere but how long did the 2.5 prints take like the normal tile you did then the city tile that you did. I plan on purchasing now that I seen a actual video about it so I will use your link. Also do you know if they will say in the Kickstarter how long it will be before real production and shipping will begin ? Sorry for so many questions and thanks for the video.",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "After the honeymoon phase, a hobbyist may need to be able to unplug such a machine, cause one might not need it for a week or longer and it's taking up space. Is there a way to clean it right after usage, unplug it and store it - or do I risk a clog and need to keep that powered always?",
    "likes": 3,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I just set up my own mopa b6 60w. I’m very interested in the database for settings. I’m thinking LSD (Laser Settings Database).",
    "likes": 1,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "this been on my radar for a little bit definitely looks interesting",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "start of a new type of machine. now we wait for prusa or xtool or bambu to pick this up.",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "My question is, can it do an array of things? Like could I place 10 coins down and print the same thing on all of them in one print?",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Really cool review and informations! How much full cleanings can be done with one cleaning cartridge? And is it safe to not use the printer (switched off) for some months  after full cleaning process?",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "That is crazy interesting. I didn't know anything like this existed.",
    "likes": 13,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "1) Are the inks transparent? Want to print on glass and back light glass. Expecting the print to glow, like stained glass. \n2) How scratch resistant is the printed surface?\n3) Will the printed tumblers survive a dishwasher?\n4) Do the inks have any flexibility? Imagine printing onto TPU. Will the print crack when the TPU is flexed?\n\nNice review, thanks.",
    "likes": 15,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Really appreciate the in-depth overview!!\n\nCan you confirm that it has a max object height of 100mm — does it throw an error if it’s larger? Also any details on how flat the print surface has to be or whether it can handle textures or variations.",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I want one...\n\nThe cost of usage seems slightly high taking in consideration the high cost of the cartridges and cleaning kits.\nAlso if it flush resin regularly that sounds like a lot of resin going to waste in the cleaning cycles.\nShipping cost for consumables is a slight worry as well.",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "consumables are definitely a big concern from what I've seen. For sure interested though. Would be amazing for a ton of cases",
    "likes": 8,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Can u print with a small item like small finger nail size?",
    "likes": 3,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I appreciate this video, I've always wanted to dabble in uv printing as a small scale crafter and this video gave me a lot of insight to how this particular machine works. Been trying to decide if I wanted to make the leap and get in on the pre-kickstarter discount and this helped me decide. I definitely would be interested to see how your cups hold up in the dishwasher too though. Thanks!",
    "likes": 5,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "What about the print, when you put it in a dishwasher?",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Why you are covering the the front sign the say  UV1  KENOB  the you know we can see that that no makes sense 🤔 😏 😐",
    "likes": 1,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "I put down my deposit so now I'm just waiting for the Kick to start.  I have a few questions, I'm hoping you can answer.  1) How long do the resin cartridges last, ie: how much can you print?  I know that is somewhat subjective, based on what you print, and how much of each color you use, but take your Mando print on wood.  How much resin did that take?  How many of those could you print with a single kit?  2) Since the printer has to lay down a white layer under anything that isn't being printed on a white surface, is the white tank bigger than the colors?  I think I saw somewhere that the ink kit would be around $300 to replace, and if you're going through that (and/or a cleaning kit) every few months, that has a pretty high cost of usage.  3) I saw another video about printing on tumblers and cups and it seemed to suggest that the machine was pretty picky about the sizes and shapes of tumblers it works with.  The ones you demo'd appear to be Eufy branded, so not just any old tumbler.  It loses a lot of flexibility if you can only print on their materials.  4) The sticker lamination set up looks like it might require some kind of transfer material, and I'm wondering if that is also proprietary.  I live in Alaska, so I'm really cautious about new tech with proprietary media / materials, because all too often companies don't ship to Alaska or treat it like a completely foreign country.  ($200 to ship a $99 thing - Xtool won't even ship replacement lenses or mirrors to Alaska).  Thanks in advance.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "To be honest, I adore your videos, but I hate it when you do it just for the sake of being a promotional thing, (But I understand you perfectly) but not for the exact and clear technical knowledge of it and where things could be different. Because if it was done by a person with experience in this field, it would be completely different, knowing all the nuances of what everyone is trying to make better and more comfortable, in this case it's a new dog and a cool idea that they have come up with that maybe will be ok, but doesn't mean it's ok, because the reality is different.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Very cool machine, but being tied into another walled garden is the issue.  What happens when they quit supporting it?  How much is the 'ink', the cleaning unit, etc.?",
    "likes": 15,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "It’s technically cool but I have the impression that we try to find the usage of the tech instead of it really solving a problem peoples have",
    "likes": 2,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Hi, I own a small factory, recently I have my eye on MetalFab and Gweike M series. They're just perfect for my work. It seems that Gweike is cheaper, but I'm not quite sure their differences. Will you do a review of the M series or compare the two? Thanks a lot!",
    "likes": 2,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Before buying a laser cutter and engraver in 2025, make sure to consider the Monport Mega for its reliability and ease of use. I use the Monport Mega myself—it's packed with features like auto-focus and rotary support, making it perfect for all kinds of engraving and cutting projects.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "what would you recommend for cutting out game board pieces from wood or plastic?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Im looking to engrave small metal  plates (4-1/2(L) x 1-1/2(W)) with just text.  I heard you say the Monport Company offers a Fiber engraver that will also give you the option of engraving in color.  Im just looking 2 colors....Black, Silver, Gold.  What do you recommend.  Do you have an email we can correspond to discuss.  Im new to the laser engraving.  Looking for an experienced professional to consult with to help me pick the best one that suits my needs along with giving me the best product.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "At 7:26 in the video I see there is a “Move” option. I don’t have that on mine is there a way to get the “Move” option?",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "I have a question:  Does F1 Ultra cut 22 gauge silver?  Or 26 gauge titanium?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Most excellent video on Depth Maps and ScupltOK site so I checked that site out and it works the Depth Map came in nice but with white halo on the top on bottom and I replayed your video and you do mention that one might have to do a little clean up in another program. Do you have a video for that type of clean to remove imperfections? Thanks",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "TELL XTOOL THEIR WEBSITE SUCKS AND IS SUPER CONFUSING!!!!!",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "For engrave Stone ar high speed what is the cheapest laser fiber that you recomend?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "I have 2 concerns. A craftsman should own his tools or he will never get anywhere in life. $20 bucks a month to rent software is crazy!\n\nMy 2nd concern is the whole idea of vaporizing metal as opposed to machining away metal.\n\nA small home cnc mill could use the same image to cut the metal away. The metal shavings could be melted down or sold as scrap.\n\nVenting the vaporized metal fumes in or even outside the home still sounds like a bad idea in the long run.",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "Can you tell me how to get the clean shine at the end of an engraving? I have finally got the engraving I want but the cleanup pass at the end doesn't seem to \"Clean up\" anything. My coin is still burnt and rough.",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "I appreciate your work but it is 2x time expensive than traditional screen printing tbh.",
    "likes": 0,
    "video": "The Easiest Way to Start Screen Printing!"
  },
  {
    "text": "To anyone who is looking at the recreative side of laser engraving and cutting... I have the Xtool 20W. 1- their software is great and is enough for my use. I do not need to purchase and learn lightburn. 2- You will need air assist , an enclosure, a metal bee bed, an air purifier. That pushes up the price a lot. And knowing this, I wish I had gone for a desktop CO2 Machine with autofocus and a camera. The end price will have been about the same and instead of having a toy that really needs lots of upgrade, I would have the right machine...",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "How do I set my gridwork panel? I do have it set with my laser as far as size. Is my grid reflecting that size?",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Absolutely amazing! I’ve never seen anything like this and have been using lasers and CNCs for a few years now. Thanks for the full step by step tutorial!",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Thanks for the overvew. Will any of these engrave stone?",
    "likes": 1,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Gweike have just announced their new M Series multi-functional machine, similar but has even more functions I believe",
    "likes": 1,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Cost of ownership/maintenance would be interesting. How often are components such as co2 tubes, mirrors, lenses etc. needed to be replaced. Obviously this depends on usage, but is there a way to compare replacement cost and usage..",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Im confused the by price list. Omtech k40 co2 is only like 700",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I might be getting a job where I am going to be doing much of their swag including tumblers. Right now I have a glowforge and it works great but wasn't something better for tumblers. As far as how much I want to spend I am not sure but I will like to stay around 6000 give our take . So I want to be able to cut and engrave including pictures.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "will the 10w vista cut 3M vhb Double stick tape? I need it to cut through the tape only, in sheet form. its about 1/8\" thick foam with plastic film backing on both sides.",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Can you adjust the amount of air assist is pumping out on a layer by layer basis depending if you're engraving or cutting?",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Getting a co2 laser for clear acrylic just will never be possible for me 😭keep seeing \"cheap\" and \"budget\" and yet they're all 4 to 10k like.. who is that a budget for.. being a disabled artist means only being able to make things by hand I guess.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Can you future proof yourself and just go for the full pro license even if your machine is like your g-code based unit ?",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "I see on your site the Monoport has an accuracy of 0.01mm but the Gweike has an accuracy of 0.001mm, is that telling me the Gweike can create details 10x finer than the Monoport? I'm looking to make a very intricately detailed watch dial.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "do you know if xtool has a more powerful f series in the works?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Love all your videos!! Helps me when looking at toys, I mean tools🤣",
    "likes": 0,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "only bad side of my K40 is, it has no camera, so i kinda guess where it will start lasering :D other than that, it makes everything i want",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I really enjoyed this vide, thanks! As a total newbie I was both informed on lasers in general and specifically on this masine I've had my eye on :)",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "atomstack a10 vs creality falcon 10w for cutting and engraving video game console shells and controllers? which one is better.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Great video, thanks!  What's it like with 6mm white sheet foam and clear polycarbonate 10mm?",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "What laser to pick for around $800-$1400...\n\nI was looking at atomstack kraft.\n\nAre there \"better\" options",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "how do you do an image mask for a photo you upload? I do not see an option, when I select both it says \"you can't set parameters for both a vector and a bitmap\"",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "This is such good information but also I still dk what to do 😂 is there an option someone can recommend for a complete beginner? I don’t even own a printer so I need something I can manage without getting too technical. I’m mostly/only interested in cutting transparent acrylic and I would prefer free/cheap software at least to begin with but I also need the tool to be as cheap as possible bc I tend to be hesitant to use stuff that’s to expensive bc I don’t wanna break it. At the same time cheap one needs to require like least maintenance what do I do 🫢",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "no one trust americans no more and never will again",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Software is so much better with X-tool but their customer service is horrible",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "I am AceBullion and I make lots of bullion items from jewellery to coins to statues. I am after a laser to help make Tokens ( so legally can be sold. ) out of pure 999 Silver. Which one of these would you suggest. I know time. I have a few of your videos saved. I am ok with waiting 4-6 hours to finish one.. Because I will still be applying more detail to them .  Thanks for your help. Jon.",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Activa los Doblajes automáticos de YouTube, son una característica genial que te hará llegar a millones de personas que no hablan inglés",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Hate to do this what are peoples thoughts on the AtomStack P1 Laser Engraver",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Do you have a wood from Lowe’s or Home Depot that you’d recommend to use on a creality 10w laser? I’ve just used junk plywood so far while I was learning how to use it, but now I want to make some nicer stuff. Specifically door hangers and decor",
    "likes": 0,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Can you 3d engrave wood like those on coins without burning the wood? If you can, what type of laser can do that?",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Paid to demo their products doesn't present an honest review.",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Can't get an \"HONEST\" review from people who are PAID by the manufacturers.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Thanks for the tutorial. What is the thickness of the veneer that you used?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I can't get the software to open... been trying for hours",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "anyone else rocking a lasermarktech cobalt xl 20w mopa?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Engraving is cute, but I was hoping to get some specs on cutting machines. Guess I'll just look those up.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi how was your experience with commarker so far? Which company do you think has better service commarker or xtool. I'm new to laser so I hope to find a company with support as responsible as possible.",
    "likes": 0,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "so for engraving brass coins will I need MOPA of Fiber? Why is everyone saying use MOPA if it only includes ABS plastics",
    "likes": 1,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "This says he upgraded with the 60w module, but i cannot find that part anywhere. I see ones from other sites, but not from creality.",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "Do the settings depicted in this video also apply to a Reality Falcon 2 Pro 22 watt laser?  If not can you please direct me to a related video or provide the settlings.  Thank you for your anticipated help!      (BTW... this was an AWSOME tutorial!)",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Thanks for this review! What did you mean by “cut and engrave basically the same regardless of the type of laser that you put it in”? at 0:35",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "You have the prices backwards on the OneLaser machines. The XRF is $4200 and the XT is $3400",
    "likes": 1,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Came from the 2025 best machine commarker video. Didn't find this Flux machine any thing special to be honest. What point of this machine make you recommend it?",
    "likes": 1,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "*I recently bought xTool P2S and I haven't setup it up but I have a question about it, I want to move that machine to a different area later on (currently it's in my home) so after setting it up can I easily move it and everything will be all set or do I need to readjust the laser dot and do the setup again whenever I move it??*",
    "likes": 2,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "I just ordered the \"Special Lightburn Cable\", at $50 it's expensive for a USB cable. Looks like it's just a UART cable though.",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "I think you need to have the machine to do a review.  Also, bring on someone who knows how to weld.  Laser welding is not a strong as mig or tig. Penetration should  be looked at closely.  For a diy'er, this is good for decorative welding.  Just my .02 cents.  Also, way too expensive.  If and when you do a review given your limited knowledge of welding, bring in an expert.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Wow, what an incredibly unbiased review. When you're sponsored by xTool, at least have the decency to say so. We get it  😂 😂 😂 😂",
    "likes": 6,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Ease of use is only relevant if it also offers the option for advanced use. 4-6k for a machine that relies in broken software is a red flag and should never be recommended",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Probably one of the most overpriced mediocre desktop lasers in today's market. Let’s put it this way: “FLUX = K40’ DENALI. ”😂😂😂 Without that small LED screen, K40 is $499 and they share the same machine structure, similar speed, I'm sorry but this is just fact",
    "likes": 3,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Kind of a silly video to make since you recommend Xtool so much and there's no brand or laser that charges more than they are worth. I guess when you constantly take free machines it's hard to actually warn your viewers",
    "likes": 2,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "Hi, I need some help! I have an image for an inlay. However, when I draw a square around it, it does not give me the same results as yours!  If the square is in' line' mode, I  get a line scribed around my image.  If the square is in 'fill' mode, my image is gone!",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "What do you think about the new BOSS?  where would that fall on your list?",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Where is curve even on this go pro camera with little lens on straight lines curving it slowly actually and wheee is the part from the thumbnail picture 😂",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Hi Could anyone recommend the difference between commarker omni and xTool F1 Ultra and which one is more suitable for small craft shop?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Just reading the web page and show their ad? Show the product bro.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Question i am looking for a CO2 laser for cutting aquarium stuff glass acrylic and polycarbonate. Making tops and ect what would you recommend?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Wait, if it's taking an existing image and then just putting your product in it, as you showed in the example with the Emma tag on the folded napkin, how is that not plagiarism? It's not like it's even really making a new image, you're literally feeding it the image you're copying, call it inspiration all you like, but it's just plagiarism with the extra step of telling the computer to do it for you. And frankly, why bother with chatGPT if you're just gonna plagiarize things, you can already do that for free.\n\nAs for selling your photos with generated images of your product, I would say that's just false advertising. If you're portraying something as a photo of the product, and it's not a photo of the product, you're just lying, again, with extra steps. And sure, if you want to sell your product by lying, that's hardly a new idea - just ask El Nasir - but let's at least be honest with ourselves about what we're doing here.\n\nLook, man, I'm not entirely against AI being used as a tool. There are even ethically trained AI models out there(even if ChatGPT isn't one of them). But this this isn't helping folks, it's the opposite. It's just a way to have people offload essential - and fairly easy to learn, in my experience - skills for a creative business to a tool they don't control, and ensuring they are turbo-screwed when those tools change or go away, as well as essentially telling people to do sketchy and in some given examples downright unethical things like it's normal and fine.\n\nIf you want an example, let's say, hey, someone spun up a business doing portraits of people in Ghibli style using chatGPT...they'd have some angry customers right about now, because in the time between filming and this video being made, ChatGPT has taken that feature offline, with no indication of when it will return. Which is especially ironic, considering Brandon's quite reasonable complaints with hardware about not having it in your control, and a third party being able to shut you down arbitrarily, at any time, with no recourse.\n\nAnd no, I don't expect this comment to last too long, a few hours at most, whenever Brandon's part of the US wakes up. But that's fair enough, I've said my piece, so no skin off my nose.",
    "likes": 4,
    "video": "Create Pro Product Photos Instantly (No Fancy Setu"
  },
  {
    "text": "I am purchasing the OneLaser and would also like to purchase the Flexispot E7 Pro desk you have in the video. What size is the table you have it on?",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Really well done, learned a ton of little tidbits that I never thought to try - will have to watch this a few times and write notes so I can fully digest everything I'm not doing in my own designs. Thanks for the video!",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Isn't that the commarker B6 from the last video on the table? I thought you say its for metal. But the example is all wooden?",
    "likes": 1,
    "video": "Create Pro Product Photos Instantly (No Fancy Setu"
  },
  {
    "text": "It is pretty wild stuff. This will really help stream line the listing process.",
    "likes": 0,
    "video": "Create Pro Product Photos Instantly (No Fancy Setu"
  },
  {
    "text": "2w infrared laser it's better or not for metal reviews plz",
    "likes": 0,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "my grid got small and I can't reset it, I have a project on it I can resize that and it sort of resizes the grid, but it really doesn't any ideas anybody?",
    "likes": 2,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "What are your thoughts on the Laserpecker LP5? We have been testing ours and really impressed by the compact design. Would love to see a video where you put it through the paces.",
    "likes": 0,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Just DONT BUY ANYTHING FROM MACTRON.. nothing but issues with their fiber lasers and their software MM3D is horrible!",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Just DONT BUY ANYTHING FROM MACTRON.. nothing but issues with their fiber lasers and their software MM3D is horrible!",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "This is just more Xtool marketing via social media. \nThe specs and capacities touted change from one 'reviewer' to another. Almost none, if any, of them are reliable.\nIt's more suited to TEMU sales aimed at easily influenced hobbyist than any serious users' consideration.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Would have loved to see Epilog and Trotec in these comparisons.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Any chance you could do a comparison between the OneLaser XRF and the Thunder Bolt? There is about a $1500 difference and I'm wonderIng if it's worth it?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "No entiendo porque desactivas los magníficos “Doblajes automáticos” que hace YouTube. Conocí tu canal por los vídeos que hicistes el 9 y 11 de Diciembre, ambos doblados al Español. De eso hace ya 10 vídeos, publicastes dos vídeos con el doblaje automático y fue genial, a partir de ahí no has vuelto a aplicarle el doblaje automático de YouTube. Me encanta tu canal pero odio leer subtítulos. Literalmente puedes llegar a millones de personas que no hablan inglés nativo. Por favor actívalos.",
    "likes": 1,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "01:52 te ha quedado la promoción genial. Que tono de voz usaste )o nombre tiene esa voz) y que software para crear esa voz? Suena impresionante. Agradecería información",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Por  favor activa los “Doblajes automáticos” YouTube que son increíbles. Literalmente puedes llegar a millones de persona que no hablan inglés. Me encanta tu canal pero odio leer subtítulos.",
    "likes": 3,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Yeah I do believe the moonport is heavier than B6 haha. That's how I sprained my waist last Christmas moving a tree pot. Take care.",
    "likes": 2,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Do try their uv. Omni is really cool. Being able to engrave more materials than fiber laser is awesome and the results are pleasing. Love it more than my old b4 now. Too bad b4 didn't have autofocus, it would save me much time when I start leaning engraving if I had it.",
    "likes": 2,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "I am so confused I'm trying to turn photos into jigsaw puzzles help please.\ngreat video",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Tengo 2 preguntas muy importantes. Qué longitud de manguera tienen las pistolas, es la misma longitud en la máquina de 800W y la de 1200W.\nY la pregunta más importante qué tipo de conector o enchufe 🔌 tienen las máquinas en Europa, conector Shusko?? Es que he visto que la máquina de 800W necesita una potencia de 15A (hasta aquí no hay problema pues los enchufes de las casas europeas normalmente resisten 16A) el problema es con la máquina de 1200W que necesita 23A. Así que definitivamente me gustaría saber qué enchufe 🔌 trabe ambas máquinas, deberían poner datos y fotos de esto que pregunto es su web",
    "likes": 1,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "I also have a DIY CNC plasma cutter. What do you think about installing manual laser cutting on our plasma machines? It would involve replacing the plasma torch with the laser torch and adjusting the parameters (I'm sure the THC can be made to work somehow, too). It seems much easier than installing a fiber laser.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "I am a knifemaker and want to be able to mark my knives, would you suggest nothing lower than 50w to engrave hardened steel? Obviously speed is not a decising factor being that the engraving is only going to be a small mark..?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Am Lamech from Uganda,but at my work there's that machine, so I want to get more knowledge about it\"i know nothing\" but I want to make it work.",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "Is there a place in Georgia you can buy that hvac tape in person?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Ciao, volevo ringraziarti per questo video bellissimo, mi è stato molto utile grazie grazie",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "So based on a previous video of yours I was about to pull the trigger on a OneLaser. Are you now saying that isn’t what you said it was? Genuinely confused because you seemed very excited about that one. We don’t have a ton of cash and my wife is trusting me to make the right choice. So…OneLaser or this? Appreciate your input. Cheers.",
    "likes": 1,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Thank you, I guess you chose the 60W MOPA over the Titan 60W MOPA because of its portability and the few hundred dollars in savings? \n(you didn't compare)",
    "likes": 0,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Very cool. I especially like the parameter catalog you're working on!",
    "likes": 3,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "... We are three months in. This is your top laser of 2025??",
    "likes": 5,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Give credit to the artist who's picture you took in order to make this. \nLooks like an easy way for people incapable of producing actual art to sell a bunch of copies of someone else's work.",
    "likes": 0,
    "video": "Laser Engraving Metal Cards are Wild!"
  },
  {
    "text": "ABSOLUTELY YES YES I WOULD LOVE TO SEE MORE VIDEOS LIKE THIS !\nAMAZING WORK",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I am a glass worker and I want to make some of my own custom \"stamp impressions\" . I can use brass and graphite.  Need to be able to engrave up to 1/8\" in graphite, a bit less in brass.  Most will be 1.5\" square or less.",
    "likes": 1,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "You mention \"a couple of guys wanted to start a new company...\"  So who are they?  I can't find anything online about the co-founders, how they're funded, who else works for the company, etc.  Not even on their \"About Us\" page.  Who are the co-founders?",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I have two AdamStack Diodes, one 10-watt and one 35/70 watt. The 10 watt is a 410mm x 410mm and the 35/70 watt is 800 x 800 \n  I rarely see Atomstack tested in these videos. Odd.\nTwo years of abuse and the only part I have had to replace is the glass on the laser node.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Very surprised the FAA didn’t contact you about doing this. You have to get pre-approval first. The jet was probably sent to investigate.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Are there any videos about cutting acrylic with this machine? Thanks!",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I'm just now discovering this company maybe a week ago. But I love this engraver. I'm really thinking about getting one. The main thing I would be doing is leather key chains & tumbler cups. I always wanted to do t-shirts. I have a heat press machine. A Cricut & a 2nd vinyl cutter. But I DEFINITELY need to add this to my collection. Gr8 video my man. I'm sold on this. Gotta handle sum other things 1st but I'm definitely putting in an order for this. Also I saw where the price is now 3699. So I guess I'll be saving a bit of money. That's always a good thing. Awesome video. Thx for posting",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "This is amazing, I've always wanted a machine that either etches like a $100 machine or makes complex constantly variable trapezoidal cuts from a fixed point. All my parts are like this, I always need parts cut so they have this constantly varying angle that's always off center. Now I can finally make these parts without using those crappy regular subtractive manufacturing techniques that leave 90deg cuts, so inconvenient!",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Why do you lie about the price? I just looked at their website and it's nowhere near $3000. In fact, the Onelaser XRF with the base (as shown in your video) costs $4700.",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Not a single 10,000 satellites supposedly orbiting the globe & Not a single freakin planet orbiting the Sun 😂😂😂😂😂",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Roll that beautiful balloon footage of our flat stationary Earth baby!",
    "likes": 6,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Why do you feel the need to yell every word?  I wanted to learn Lightburn but your animated style and need to scream were very off-putting.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "what goes up must come down. nothing manmade stays up there! #Payattention",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "would love to see u do a review of the new h2d bambulab laser modul...",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Can I ask a question please? Can anyone recommend a budget laser cutter that would work well with cutting only paper. That's literally it - just paper lol I see a lot of people cutting things like plywood etc but I only want to be able to make detailed envelopes in my bedroom.",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "WOW! I just downloaded LB and you go way too fast for me to keep up.  I guess I better find another beginners video and come back for the tips.",
    "likes": 0,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "Very cool video. Do you know if someone has Glowforge settings for doing that aluminum tape trick? (And I already know that Glowforge wasn't the best choice of printers...)",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I'm not from New York City.  So I don't talk fast nor understand those that do,  Therefore, your Video was Very Confusing to me.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi, thank you for your video demonstrations. I have an issue that I need help with. I manualy draw a cut line around my object and have to stop and start it due to workspace issues. When I run it it burns in sections and not the perimeter. Please help. TY",
    "likes": 0,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "I've subscribed for the list and I never got the email.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Yep, got a commarker b4 at work since last year. Awesome results on metal and their service is always on time. One vote from me.",
    "likes": 3,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Good morning, do I need to make any allowance for kerf ?\nRegards Cam",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Thanks for this. Very helpful. That said, please get rid of the magnifying cursor it is so annoying. Every time you move the cursor it distorts what's underneath it and so it's hard to read what it is that you're doing.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Sorry I may have missed it but do I have to adjust for Kerf with this method?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Thank you so much! I'm a glass artist and I need to carve designs into graphite.  I can do it on my cnc, but the dust is horrible.  What laser would you recommend?  Mostly less than 2\" square and about 1/4\" or so deep (I will use as a push mold to transfer the 3d design into the molton glass.",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Could you do a video on the Flux BeamboxII? There are serval comparison to xTool P2s.",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I bought one. Apparently it will not connect to any of my devices between iMac Chromebook iPad or iPhone 16 even though they said there’s iOS compatible for some reason it seems impossible. What is your take? I bought it because I thought it would be a benefit. into the onboard camera for my little hat business I’m getting Gordon but I am wasting more time with her than I am making product. If you have ideas, please I would love to hear them",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "don't follow this guy you will just be waiting your time",
    "likes": 0,
    "video": "Making Shirts with a Printer?  Procolored DTF F13 "
  },
  {
    "text": "Thank you for the full tutorial. I was able to follow along with everything from the previous video except for the actual inlay. Watching each step helped me understand what was happening to the veneer when it was being cut. I definitely enjoyed the video. Today was the first time I watched your videos. I found you when  I was looking for comparisons/review of the X Tool. Thank you 😁",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "*Great Video!!*\n*Midjourney in depth detailed Tutorial would be great, definitely looking forward to it!* 👍🏻\n*And can you share it here or put all the website links that you have shown in the video in the description as it would be very helpful!* 🙂👍🏻",
    "likes": 0,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "Im pretty sure you can get a 50w or 60w fiber laser for that price, maybe even mopa fiber laser 50w",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "I read some of the previous comments and many say they think you did a very good job explaining this to beginners. Well Maybe it's me but I could not keep up with you. And I needed a little more detail.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Thanks for the info. I am thinking of doing some jewelry. I found commarker omni and it seems great. What do you think of this brand?",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What if i want to engrave my logo in black color ( on zamac perfume cap  surface ) which one is the best to give black engraved logo",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "since photonics x1 pro weld machine is around $2800 on KS then for this you are look at about $6000 because of the CNC aspect which is the only additional feature so let say if it on Ks $6000 to start and then maybe after launch price could range from $6000 to $12K at most. also not to mention Xtool is not know for any Business grade professional machine just prosumer, hobbyist and craftsman man. \r\n\r\nso they need to come in at an affordable price before they can have a foothold in a industrial class market segment. \r\n\r\nindustrial class are not mainly concern about price as long as they have a way to generate a ROI on the machine investment. what tends to outweigh ROI is support and aftermarket sales. \r\n\r\nif Xtool wanted large scale business to buy into this they will need to have started approaching them for a long time as business of who would buy 1 - 2 or 5x would usually plan out the ROI, safety, aftermarket sales, e.t.c. \r\n\r\nI think they will be aiming the SUB 10K mark as most hobbyist will not put down 10K if the ROI is 5-10years you really want to have and ROI of 1year max as a small business. 2 year at max. 3-5 years if you are buying multiple. cause if you take long to get an ROI you loss foothold on market share fast has competition start start to get into the industry with similar machine and product and and your direct competitor start to gain market share.\r\n\r\nso you all should be persuading Xtool for a KS and a price of around max 5K for early entry backers. \r\n\r\n12K is not a stretch for some people but within a year or 2 other company will make similar product do not forget xtool is a Chinese company so patent laws work differently there. am sure you will see similar very soon. it a first but not the last. and other companies will come with integrated or modular system easily.",
    "likes": 3,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "This was just an infomercial.  I thought you would show us it actually working.",
    "likes": 1,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Do you think they'll make a P2 this big or bigger? Really would get a bigger machine with a bigger bed space 👍",
    "likes": 2,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "$10,000 or more is out of my budget. I'm happy with my mig/tig/plasma rig I paid less than $500 for. If I had a business and could write it off in taxes, maybe.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "As a certified welder, laser welding it is not very strong it is good for crafts intricate products  it's for very thin or basically sheet metal laser welding is not used much at all in America because of the price tag and low capabilities y'all are better off buying a plasma gun and and small portable welder in my opinion for like a grand or 2",
    "likes": 3,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Tried this on my commarker b6 and result looks just amazing. Came back to say thanks! Looking forward to more videos like this. Really helpful and detailed.",
    "likes": 2,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "Great video. I am by no means a welder so machine would not be for me atm but seems rather impressive. Would be awesome if can just get the welder. CNC wise i am still waiting on my Carvera Air",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "At that price its certainly not a hobby tool.   $4000 would be A LOT for just the cutter but maybe ...",
    "likes": 1,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Welds aren't strong or structural. Theres other machines just like it out there.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "I hope if the price is expensive, I wish buy only the cnc laser fiber cutter separately than the laser welder. For welding we have alternatives like mic, tig, etc. And if the price is more than 3500 dollars or euros most buyers like me we will can't buy it because we want it only for hobbies. Also I think this is first step to democracy the metal cutting laser. In my case I was waiting this type of machines lots of years. Congratulations to @xtool. Now the price is critical.",
    "likes": 0,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Under 15k I would get it just for the cutting ability in that form factor. Turn key, more or less and it fits in my small shop? Perfect.",
    "likes": 2,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "OMG, all of this from one leaked photo.  Can't wait to hear some REAL facts.",
    "likes": 2,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Laser welders are amazing, I LOVE how easy it is to prep the metal/clean any rust... After using one one cannot go back to traditional welding!",
    "likes": 2,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "Very cool machine. The cost is definitely gonna be a barrier to entry.",
    "likes": 12,
    "video": "Will This Replace Traditional Welding? xTool Metal"
  },
  {
    "text": "I would love to see a workflow tutorial. Thanks for this one.",
    "likes": 0,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "I’ve played around with a diode engraver I got on Temu a couple years ago and it worked well for soft materials, but I’ve always wanted to find something to engrave chrome plated tools. I personally have a couple thousand pieces to engrave, and I was thinking I could provide engraving as a service to other technicians to help pay for the machine (who also have lots of tools) and I would also provide personalized enamel filling. What wattage would be best for chrome vanadium, speed isn’t critical, and engraving points will tend to be small (~25mm^2 or less)? I also wanted to know what kind of surface treatment I may need when working with reflective chrome plated tools.\n\nAny and all help would be awesome!",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Simply amazing comprehensive video.  So much info I need to watch it multiple times to grasp the breadth of information in the video!",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi,\n\nI really love your videos, it’s always a pleasure to watch you! I have a question: how do you manage to have sublayers in LightBurn with an image layer?",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "could you guide me into a entry level Textile laser machine?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Love the long style tutorial.  Would be great if you can specify what will work with CO2 verses Diode in each step.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Quick question...is that comaker 50w....need 220v or is 110v OK?  Thank you.",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "I would very much like a tutorial on Mid Journey from start to finish. Something that is simple but yet covers all of the basic aspects of the product. Anytime something has a charge to it I want to have a. thorough understanding. Thanks so much.",
    "likes": 1,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "Other AI tool that you might want to try is Bing image creator. It is free, based on Dall-e model, and is working great for me for laser engraving stuff.",
    "likes": 0,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "A Midjourney workflow tutorial would be super helpful! And for the outpaning in phyoshop, you can also use the crop tool to expand the canvas and do a generative image expand in one step.",
    "likes": 6,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "Love your vids, but you talk so fast I get anxiety.  LOL",
    "likes": 1,
    "video": "Top Laser AI Tools I ACTUALLY Use"
  },
  {
    "text": "I know this is an older video, but just wanted to disagree with 18:49 - xTool support is awful, I bought a machine and they sent me a USED machine with the wrong spec, and I've been trying to get them to send me the things I'm missing and the new machine I paid for, and for the past 2 weeks I couldn't get a return label sent to my email",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "211 hours of labor a month!? That’s more than my full time job at around 160 hours a month. Is this accurate?",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "I’ve tried to research this but am not finding much information. I’m interested in using a laser to engrave small concrete and eco resin pieces. I originally was leaning towards a P2 but am now rethinking that since the CO2 seems to be geared more towards cutting. I’ve watched the F1 engrave eco resin but I want a larger workspace. I’m so confused 😂",
    "likes": 1,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "I need to mark machined parts typically stainless steel but some others, I also sometime need a deep mark.  have looked at 40-60K machines, don't want to spend that much, your thoughts?",
    "likes": 1,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Can you turn pass threw off for pictures on slate on the M1 Ultra and can you use Lightburn?",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "Seems to me if anyone that expects to make money in the laser field \nthey have to go on u tube and hype somones laser  or etc.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "It is the only great video available on internet of fusion 360 details toolpath.❤",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  }
]