[
  {
    "text": "hello, what is the difference between Atomstack A10 PRO 50W and X7 pro",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "wow - i wish i could afford it.  i'm sure atomstack and ortur will no doubt release something similar in the future.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Jimmy Hendrix? That's funny! How can one not notice it's Jimi?\nBTW, how deep are the engravings?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Will this Device be able to engrave tiny design approx 1cm, on small pieces of wood (2cm-3cm)",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi there! Amazing video!!! Do you know of a laser machine that can actually cut longer material like the glowforge can. I like this laser,  but 12x20 isn't that big. I like how the glowforge can feed the material through and make a longer cut. Such as wedding signs etc.  Thanks so much!",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "I think you put the bottoms wrong and that's why you can't use the whole table area. Look carefully. These lower two aluminum plates, on one is attached the motor, on the other the handle for rotation. They have to be turned upside down, the protruding things on these aluminum plates are actually the legs of the machine and they have to be down. If you turn these parts upside down, the table will be able to pass over them and have more space for movement.",
    "likes": 3,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Why didn't you turn that overpriced 45watt(lol) on so people could see what they would have to deal with every time they do a cut or engraving?  Ink Scape is FREE,  K40 Whisperer is FREE!  You must be getting paid by Glow Farce to do these videos.  YouTube is full of videos debunking all the marketing hype that GF does.       shame on you",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Man! Been loving the reviews. I'm debating on a lazer engraver or CnC cutter machine. I have a project that I'm working on that combines a wood base and a 1/8\" LEXAN top piece. My question is will the lazer engraver  print on the Lexan?",
    "likes": 1,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Here's a good question. Can you talk more about these companies and what else they might make or what quality of support they provide. It's hard to get the straight poop from customer reviews that get lift on let say Amazon.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hi, I am new to laser cutting. I wanted to get your opinion on which model is best for cutting through 6mm plywood on one pass. Have in mind that the production speed is essential. Also workspace must be big enough for more production.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Good day, I am watching your video for some information. I've bought my KT4060 in 2020 and waited nearly a year for the machine to be delivered. When I opened my box it was only the machine with no software or anything to operate the machine.  I am new to this, nfortunately the guy through whom I ordered my lazer cutter don't want to give the chinese company's name and contact details.  Where can I find software for the machine.  I want to buy the lightsburn but still need the software for the machine.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What keeps confusing me is the fact, that some suppliers rate it with 10W output power and some rate it with 15W output. Even the Neje online shop says its just 10W output power. Does somebody know whether the \"10W\" module is the same as the \"15W\" module? I'm about to buy the A40640 module but im a bit afraid to buy the wrong one. I just aim to buy the most powerful diode laser for under 500€, is there even a better choice than the A40640?\n\nThanks in advance!",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "the OMTech 20W Fiber Laser  is about $3 k, thats the one you want",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Just got one! I’m selling it as it took forever to get it so I bought another laser. PM me if you want to buy it I have it up For Sale! Sealed in box",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "$960.00 for a small 5.5w diode laser cutter / engraver is quite steep. Even the Omtec K40 C02 laser is half the price.",
    "likes": 1,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Could you inform me on what screws you used to put it into the wall? I am having trouble with that part",
    "likes": 0,
    "video": "How to Make a Simple Tool Wall for a Garage Worksh"
  },
  {
    "text": "Can it be fitted with an air assist nozzle? And is there an app  for Android users?",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "My biggest concern was that it didn't run Lightburn, but now it does.   Fantastic review!  I'd been waffling between the OLM2Pro and the XTool D1.  I just ordered the XTool!",
    "likes": 3,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "thank you, me and a buddy look to buy a machine,  from gun engraving, to larger pieces  like gates made of aluminum  with engraving on it, or signs that are for parking spots, lol is there a specific machine you would use  for all or do we need a few, i suspect a few",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks but the \"Other Laser\" links don't appear to work.",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "I'm trying to find videos on the usage before my machine I ordered arrives, (Should not be hard, considering it hasn't even been mailed yet-over a week later!) and one I can't seem to find is how to make sure it starts where I want it to and stays on the board. Is the software coming with the tool able to identify printing/cutting surfaces edges, etc...?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "How do two 5 watt diodes make a 10 watt? Why isn't it just two 5 watt?",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Hi my friend! Great review. I am planning to buy an engraving machine. Maybe a decent one around 3000$. But i am not sure if i need some training first or I can learn it by myself. Any advice would be very helpful. Thanks a lot.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I have a very important question. I can see that you love Star Wars, but is there also a special place in your heart for Star Trek?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great Test. But the dot size can be affected by the direction of the wood structure (because if hard and soft area) you could rotate the test piece by a quarter turn and laser and measure again or just use other material then wood which is more even",
    "likes": 5,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hey buddy just wondering in your opinion what is the best  laser for 2022 is it the X tool D1?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "There are commercial fibre lasers available that work similarly to a CNC router, but no hobby ones that I can find. \n\nAnyone have any experience with them? Running costs are allegedly half that of a co2, and performance significantly faster",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "What should do to benefit from the moneyback guarantee of your course?",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Heya. Do you know if these can engrave PS5 controllers?",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "What is the widest and longest piece you can work with?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Have you actually tried killing power or running out of filament and resuming the print? How noisy are the fans? I think we would like an in-depth review.",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "interesting video, pity about his choice of \"music\".",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Hi. I had two questions I was hoping you can help me with.\n1) What's the maximum height of the item that can be put in to be engraved? What if the item is 15cm high (like a lectern)? Also, the item is not totally flat.\n2) How can I make sure that the product that I want to engrave, the wording comes out straight when I put it in the machine? Is there a guide on the machine to ensure it stays central?\n\nThanks for the amazing review!",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Have you ever cut mylar stencils with any of those machines?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "My main concern would be the constant z height change could affect duality at higher speeds. Looks interesting though.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Do you have any experience with the JTech 7 watt laser?  Trying to make up my mind if I should go with the Neje 10 watt",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Do you think that model can cut .030” thick copper? What is the model no of this machine. Thanks",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "in your opinion ...wich one is bettere the neje dual diode or the atomstack?",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Can you control it without the app like using light burn from your laptop",
    "likes": 1,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Love the features. Diode lazers need to come up to the co2 standards. Mainly for safety.",
    "likes": 2,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "Trying to download the test file but after I put in my email address and click, it just shows the snake chasing its tail and never completes.\n\nUpdate: I have just tried using Firefox (I was using edge) and the file is now in my inbox. Thank you 👍",
    "likes": 1,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "My opinion is those computer fans are worthless. Doesn't the xtool d1 have the best spot at .08 x .08? I've seen it missing in your comparisons in this video and one other.",
    "likes": 0,
    "video": "The Feature Every Laser Should Have! - Two Trees T"
  },
  {
    "text": "I enjoyed the review of the low cost cnc. I have interest in learning more, but I think the real fun starts with the larger size machines.",
    "likes": 3,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I am thinking to make customized name necklace and also engraving initial on the pendants at home. So desktop mini machines are more practical. Could you let me know so I need 2 machines? Is there a desktop machine do it all?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Hey I love the video! Does this method work with marble as well?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "6K for a desktop machine is nuts....I have about 10k in a 100 watt Reci tube system that is the size of a car...That even includes a 1/2 ton chiller that cools both the laser tube and my spindle on my AVID.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Why would anyone consider a Glow Forge when you can get a Thunder Laser USA Mini 60 for less money??",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "So are you working on a quick stretch and working off that to create on Fusion 360 to check correct measurements?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "So if can just buy one Diode laser today would it be the  Ortur master pro 2 SF or the  Neje Master pro 2S?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "why the cooling fan stopped when the laser finish the work?does the laser not stay hot?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "How easy is it to line up? The laserpecker2 has a outline feature, how can I find more lasers with that feature, where they show the outline,  not just an invisible box around the area",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "You could take chemtrail samples on heavy spray days.",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Question. I see you do mostly Laser video’s. If you are able to make a choice what would be the most bang for the buck CNC engraver machine for under $1,500…?  Greg",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Nice video, thank you! What is the real life hours of those diode laser machines? Thank you.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Amazing! Not matter how hight the camera is, the Earth always looks the same size.",
    "likes": 5,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Have had mine for a couple of months and can only do the most basic tasks.  Cannot get an English user manual or any support from SparkMaker.  Can you point me to a source of training or tech support to make the thing useful?",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "Just stumbled upon your channel very cool reviews \nHad a question about the software you’re using could you scan a picture and burn it into the wood or is it more involved than that ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "How much does the co2 tube cost to replace on these machines? And how often do you need to change?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Did they give you a free machine?? Sounds like they hooked you up! Everything wrong with that damn you you twisted into good thing. No thanks. No buying that big-brother controlled junk.",
    "likes": 0,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "I'm surprised you haven't received a cease-and-desist letter from Disney along with the lawsuit for printing out Mickey Mouse. 😃\n\nGreat videos thank you, I've been really wanting to get one of these to engrave guitars that I've been building. I'm just looking for something that I can fit over the item and something that I can afford",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I custom built ours for our small business, but I also have an engineering background and several years experience with 3d printers and motion systems including modifying firmware..  It is a 7W diode that I will be upgrading to 10W soon on a approximately 5 ft x 5 ft frame (about 1400mm squared actual work space).  My other half and sister in law do a lot of sewn products for people, and being able to laser cut when you need 50 of the same pattern cut at a time is a huge timesaver.  It cost me around $1000 in parts to build plus a lot of time, but even a diode unit that large would be a few thousand dollars minimum.  I could have dropped that price by 3d printing more parts instead of using aluminum for 99% of the machine.\n\nI recognize that is not a good option for most people though.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Is there a reason you are using regular wood stain instead of colored butcher block oil that is food safe? Watco makes multiple colors and is available at home depot.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "do you have a laser test file for the laserbox basic software?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Keith B. \nIm looking for the best laser to cut and engrave abalone and mother of pearl shells for guitar inlays.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I’m overloaded with choices! My need is for the best budget-minded laser that will cut out and then engrave abalone and mothe of pearl inlays for guitars. \nKeith",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Is there a way to contact you?  I have a laser pecker that I got about a year ago and want to upgrade. Been looking at the Ortur pro SF but maybe this with the larger gantry and air assist is the way to go?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Hello, I have to make a choice, to buy a K40 Co2 laser or the Neje A40640 (10w optical power). I will use it for leather work, cutting and engraving. What is the best choice? Speed doesn't matter for me, but the quality of the cut and the lifetime of the machine. What is your advice? Thank you very much.",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Fantastic video! Great breakdown of the top performers. Im looking to add to the arsenal and you got me thinking about a fiber laser haha. Nice work!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I love your channel!!\nJust a couple of random facts.... my dad's next door neighbor is from Athens Georgia. His name is Al Henderson and he LOVES Christmas trees. He has a second home in the North Carolina mountains Just to grow Christmas 🎄 which he takes back to Athens to sell each year. \nSecondly the coach of Georgia Tech football team is from my home town. His name is Paul Johnson and his family still lives here.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "I just put mine together (Jamuary 2022), you can use Lightburn with the D1 now. I'm really digging it. Thanks for your review!",
    "likes": 4,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I don't mind closed off software as long as it works.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "How do you think it will perform on a non flat surface? Something with different elevations?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Does your channel have a discount code for the NEJE site?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Where do you get replacement nozzles for it? I got mk8’s with .4 mm but it’s really thin",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Is fusion 360 really free? I just downloaded it and it says I can use it only for 19 drawings. After that the files will become read only. Is it really worth learning a software when you know that just when you learn it you won't be able to use it?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "What is the distance from the laser module to the wood 3mm?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I have never used a laser or cut wood with a laser cutting machine but I want to start a business in this area. What machine do you suggest I get? And where should I get some training or videos?😌",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I would go with the Otur just for a cheaper price.  I am only considering it as a fun hobby.",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "will your lightburn test files work on other programs  like laser box or K40 whisper?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Regarding resolution, it offers 1k, 1.3k and 2k pixels per 100mm. So it's 10px/mm, 13px/mm and 20px/mm. Or 254dpi, 330dpi and 508dpi.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Will it do plastic....or metal, with diamond  drag???",
    "likes": 2,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I need a engraver that can engrave a hardwood. So I can put my signature on my builds. What brand do I get on a budget?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "have you considered the NEJE Master 2S Plus A40640 Laser",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Don't want to brag but I was the 1,000th like on this video. Amazing laser, I will buy one for DIY projects.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Thanks for the review, I'm new to Laser engravers and this looks like a great option. Have you ever reviewed the Yarohome 6550? How doe it compare? Thanks",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "they expect you to put some random USB thumb drive into your PC!? what? lol",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Is this available for sale now? Also, is it compatible with Lightburn? TIA",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "how long would a laser typically last in actual used hours\\days?\nis there a rotating axis that works with it?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I was looking at PlasmaCAM. Do you have any thoughts about plasma vs laser?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Hello! How big of a piece you can get with this machine? Can I get a image of 12” carved with this cnc?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Great video looking to get in to engraving business as starter what do you recommend budget below 1k  that will be cable on multi surface \nThank you",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Would this work on stainless steel to engrave a golf club?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I can't stop staring at the burn mark on the camera.",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "When we are talking about how dangerous are laser cutter, after smoke my second thought is fumes.",
    "likes": 1,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "Can someone tell me what the best engraver to buy to engrave usb pen drives with my own logo.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "So, I’m getting conflicting info in reviews and even from atomstack about its capabilities regarding metal. In your review you note that it can engrave stainless but that’s it. Atomstack says they can engrave any metal. When asked to differentiate between mark and engrave I got no answer. Can this machine articulately mark or engrave aluminum? Not just black mark. I need gray scale. That’s my project. Thanks!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Not what can a $300 CNC do? more like 20 minutes of building a toy CNC",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Amazing software tip!  Thanks!  Much better than what I had been using for similar maps.  Off to the install and learning curve!!",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Hello i dont know what is wrong i own one of this and i cant cut with the laser playwood in one pass (4mm) i try setup the focus several times and the best i can do is cutting the 4mm one in 3 passes with 100% power and speed of 100mm/m, do you have any idea what can be wrong ?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I ordered mine this morning. If it does well I want to add the rotary and extension kit for sure.",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Question I can’t find the longer Lk 5 pro in cura or the any of the longer printers",
    "likes": 1,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Is this powerful enough to directly ablate copper from a printed circuit board blank?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "How do you think this compares to the Aufero 1 for cutting?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "can you cut and engrave with CorelDraw or do you have to design and import into their program?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I enjoyed the video but can't seem to download the test files. It just goes in an endless loop. Is the download functional?  Thanks.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I am using a Long Mill CNC router to run my laser. In my enclosure I am running a bathroom fan since it can be ducted out of the garage when running the laser.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I would love to get one of these. Don't have the budget yet but hopefully one day... Nice video.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I'm not sure if I misunderstood sth but if I buy a Laser with RUIDA I can use it with Lightburn? Thanks for your Video!!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Have you seen the sculpfun so or the it's pro? Can we get a review?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Ordered one of these and it just arrived today. Have spent the last several hours trying to get it to work. Do you think I can? Not a chance. Starting to lose my patience.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I'm blind so I can't appreciate the visuals, but you could clearly hear the difference when the balloon pops, there is also a gradual change in the sound as the device falls closer and closer to earth as the atmosphere gets thicker. Question, what was the total distance traveled from the launch point to the point of impact?",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "... can you Engrave Polymer ? And Colors on Polymer..? Thanks",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "The company has been almost a year late in shipping orders. Mine was supposed to arrive in May21. Still haven’t received it. Wouldn’t waste your money until the company gets its act together. Paying them is a risk.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Do you have a video from the design end of things. Ie; navigating the CAD program that is used with the OMTech laser? Also, can you import something like a signature or handwriting and etch that into metal? Thanks!",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Hi awesome content. Do you think it would be possible to use the laser by the memory card?. So you would not need to have computer in the same room.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "What's the difference between this and the ATOMSTACK A10 PRO?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "This was such an amazing treat! I’m blown away! If I ever doubted that we do not live on a spinning globe 😂I don’t know!!! Those lying creeps! Your video shows it all! It is a circle ⭕️ just like The Bible says! God is not a man that He should lie… but N.A.S.A. Sure are! Criminal! Now that we know where do we go from here? I mean cuz obviously we are not going out of this enclosed world! Lol love love love this video!  This is what should be in every school around the world not this 🌎! UNBELIEVABLE!!!! 🙄 sheesh I’m so angry! But thankful to see it for myself yippee!!!! I’m actually feeling very free kinda like a weight has been lifted!!! Whoa 😳 does that make me an official FLAT EARTHER NOW?!?! Hahahaha 🤷‍♀️truth is truth I guess an again The Word says The Truth shall set you FREE!!!! Be blessed y’all yipppppeeee!",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "can this engraver engrave on metal like gold and silver ?",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Where I can buy this machine?I cant find in banggood",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Ok, now I want to know what you can cut with it, and is there anyway one could cut clear acrylic with a diode laser?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Thank you so much for all the amazing information!  For weeks now I have been exhaustively researching laser engravers for my first one.  I had pretty much decided on the Atomstack A5 Pro until I saw this video, and so glad I did!  The question I have is, can you please clarify the differences, if any, in the Atomstack models X7, A10, and S10?  I'm getting conflicting information from sellers.  Some say there is no difference in the three except for the color of the unit.  Another says \"S10 Pro is improved performance in all aspects than X7, also it can engraving material including wood, glass, stainless steel, acrylic, etc. and with faster speed and more better results.  This will be a better choice for all engraving and cutting enthusiasts.\"  My head is spinning and I figure if anyone can get to the bottom of this, you can!  :)  Thank you!!",
    "likes": 3,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Their customer service is total garbage.  I received one of these that was not working from day one.  I have now tried for over 2 months to get a working unit from them.  They insist I repair the laser.  I informed them I'm not an electronics tech and asked to have a new, working unit shipped to me.  They have refused and insisted I repair it after endless videos and photos had to be sent to them..",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "thank you for you detailed review.  it really helped me operate my 1st xtool.  any tips how to clean the orange box?  accumulating black build up.  thanks!!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I read reviews on the Facebook and many buyers claim they never received the laser.  Many also claimed that they got no response via customer support and ultimately got ripped off and never got their money back.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I think the changes are a big negative for hobby users or those teaching themselves or in the pre-start-up phase.\n\nThey made 3 axis projects take a lot longer by removing rapids. A 3-hour project will now take 12 hours which is huge if you have to stand watching the machine (as most hobby users do). Not to mention the extra power usage...\n\nThey made 4 and 5 axis hobby cnc machines useless by removing that functionality completely. This limits what you can make regardless if it's a one-off hobby job or full production. \n\nManual tool changes have been made needlessly arduous as they now require a whole new operation.\n\nThey could have achieved the stated goal by simply limiting the hobby version to only posting to Mach 3 and Linuxcnc which no commercial VMCs use. \n\nMost of what they removed has nothing to do with commercial operations. It looks more aimed at forcing hobby users to pay for expensive subscriptions for the small handful of personal projects they do.",
    "likes": 2,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "What program comes with this machine?? You mentioned it but then said you would use the one you had on your IPad. And also, how difficult is it to learn how to program your actual drawings, cut-out etc??",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I think the Sculpfun S9 is more powerful as the narrow beam has a higher energy density and cuts through 1cm black acrylic.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "10 Watt? hmm... My Snapmaker A350T already has a 10 watt laser included. Yes it is more expensive than this machine. But it can also 3D print and do CNC. Optional full encloser with HEPA filter is a nice option for the fumes. Just saying if you want a 10 watt laser this might be a cool alternative for you. Not affiliated with snapmaker btw..  but just saying.",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Can I use this user to cut 1/4 \" or 3/8\" clear acrylic? Additionally, is there any spec difference between this blue and black model and the red and white model? I can't seem to find any but the red is listed cheaper everywhere.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi, Would this Diode laser be powerful enough to mark carbon steel and Stainless steel(knives) Fiber is a little out of my price range. Thanks for the very informative vids.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "hoe long would a laser typically last in actual used hours\\days",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I’m new to lasers and I’m looking for something that can handle 0.118 plexi/lexan/acrylic is that a possibility with this diode model?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "What is difference pulse frequency on uv laser machines?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I'm not sure if its a new update but the QuickOSM has a preset called \"Urban\" that will pull like 95% of the data you need into multiple layers in under 90 seconds. I did almost all of metro Tucson which I wasnt able to do with the other method. It kept timing out on me and said pick a smaller area.",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "I gave engraved antler on a friends glowforge. It worked well. Would I be able to use a diode laser with adequate success?  Thanks love your reviews.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I always use mm/sec instead of minutes for my CNC machines. It's much easier to visualize that speed to me.",
    "likes": 4,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "My lightburn is seeing this as a a5 laser not the x7. Any ideas?\nThe driver they provide is for mac os.\nHow do i uninstall the the driver that was installed with grbl? So i can retry.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "\"Weeding invitation paper\". 😆And didn't anyone tell you it's dangerous to point a laser at people? You just damaged the eyesight of your viewers...",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I have it with the max frame, it’s really good, but I have added air assist, as I found the lens quickly becomes coated with smoke, and the power drops right off. I use it to cut 3mm black acrylic, and it works really quite well,",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "What's the most powerful diode laser at the moment?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Thank you for this video :) awesome work, but shouldn't you logo be M||B rather than M(b)? or \"outcome ? make : break\"",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I’m exploring the laser and cnc machines and what they can do. I’m a newbie with no knowledge of what they do, what I can do with them or how I can make income to justify the cost. I want to go with my third machine first. I don’t want to buy one only to realize I need a bigger one etc. I also don’t want to buy industrial only to get bored with producing products. I don’t mind spending 20-25K setting up shop with tools that I will need to do the work correctly. I do have a bunch of carpenter tools for rough work but nothing really for finish work. So I will continue my research in what tools I will need to enter into this field. Now having said that, I am impressed so far with the Glowforge Pro Laser Cutter. Will that be my first purchase? I don’t know. I want to check out your other reviews as well as other folks reviews on the different brands. I will also be looking if someone did a video on complete tools to setup a shop needed. This machine sounds pretty simple and that’s good for an old guy like me. If you have any suggestions or links I will check them out. Thank you.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "@04:40 are those Presets in LB you can select from like a Dropdown Menu or are they DIY ones you have to create and edit yourself? 🤔",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "seems to me neje keeps making bigger lasers in the same small heat sink. how long will they last b4 they burn up, heat is the #1 destroyer of a diode laser i have already killed 2 of there 20 watters",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "The resume print feature is useless since the bed is glass and cools quickly. By the time power is back the part would detach and the print would fail.",
    "likes": 1,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Focusing it by eye and then measuring the line width really beats the purpose.\nYou should do a proper focus test and then you can print a jig that size that you'll place on your material for each  focus without hassle.",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "my question is can it go through a very thin sheet of glass and melt glue?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I have the Glowforge. I’d love to buy a course on Affinity designer. Know if one exists?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Should look into the Longer3d Ray 5. It claims .08x.08mm dot size on a 5watt laser. The company claims they did 12mm pine board in one pass. It's got the full square frame at 400x400mm. From the little work I've done with it it seems plausible. It also comes with a spacer for setting the height so there isn't the guessing.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "When I did my review on the A40640 I didn't have access to a way to check the power, but last month I met someone who had an actual laser meter. My A40640 came in at 13.8W. Neje says it's 2, 7.4W diodes, the max power a diode laser can emit. It's pretty darn close to their claim. Definitely not 10W. My Ortur LU2-4 came in at 5.05.",
    "likes": 12,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Thank you for your honest review.  I'll be moving toward a purchase in the next few weeks and I found your review helpful.",
    "likes": 1,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "how does this diode laser compare to the Xtool D-1 ????",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Very informative and well explained about choices, but the the best detail of all is the engraving of the second amendment on a Picatiny rail accessory, NICE!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "You keep saying this is cheaper than the Ortur, but even the price in your links show this $100 more! Do you have the prices mixed up or have they changed that much in a month?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Do you have any recomendations for additional or better goggles?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Looking into one of these. Do you know the difference in the LU2-4 LF and the LU2-4 SF?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Such a mish mash of info delivered way to fast and so many jumpy edit cuts … sorry but this really was confusing as to what it was trying to achieve.Maybe as an absolute minimum try taking a few more breaths !!",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Thanks a lot for your tests, i'm a interiorarchitecture student I had some expérience  with lasercutting machines. I got really fascinated with my first experience and so I buyed myself a ortur laser master pro 2.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "With this construction... I really do wonder if the arm drops significantly enough with the laser at the far end.\nHave you done a test engraving with the laser focused sitting back against the main rail and then a straight burn to the far end of the arm? And then compare the engraved line at different points?",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "How about attaching a small device that, after reaching 27-30 km, will start flying in some direction, preferably towards Antarctica, but I know how difficult it would be to direct the balloon there, but I think it would be a good idea to see what's behind the ice: ) or as some people think, maybe we will fly a balloon around the earth",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I see on the website they say acrylic would be possible, Would you say it really not ?",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I deperately want to get into using one of those $300 units for some art. Who can I talk to or ask to help with set up a system?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I want buy one but not with out a custom service number it's only in the bank.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "It was a good comparison, but very disappointed that you didn't include the Aeon Mira 5 and the Epilog Fusion Edge.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "This has a 20w laser. It that input or output strength.",
    "likes": 0,
    "video": "The Features all Laser Software Should Have - WeCr"
  },
  {
    "text": "Hello thank you for your videos , \nwhich one you would recommend for a beginner - SCULPFUN S30 Ultra-20W  Vs  ORTUR Laser Master 3 20W,\n\nMy requirement is bed size and upgradable. with good cutting capability.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "think the m5c is going to be my new printer. still checking other reviews  to be 100% sure",
    "likes": 11,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "I build American flags-19x 37 inches and would like to burn quotes onto them on the stipes....which machines have work area that would cover that?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I cannot even browse xTool website without it crashing my browser",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "My company is a newbie to lasers. Our priority will be engraving and cutting wood. We are on a budget in the range of $4000 to around $6500. How do you feel about the Omtech 2028 100 watt CO2 machine. I’m hoping to end up with a unit within the above budget that will produce a sellable product. Your advice would be greatly appreciated!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Do you have any thoughts on the fox alien resier 20w?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I dunno man, the X2 from the X-Men is kinda trouncing the Avengers.  One guy engraved text on a single grain of rice with it.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "They aren't lying to you. You and the other youtubers just make money by putting out videos like this, claiming it. Which is worse?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I really enjoy your channel, but a factor none of the review channels seem to discuss is the VERY short service life for xTool products. As recently as 9 months ago, xTool was heavily promoting their D1 and D1 Pro lasers, yet if one visits their site now, ALL of the replacement parts are \"out of stock\", and none of the laser heads can be replaced, with the exception of the $1,200 40w head for the D1 Pro.\n\nSo if your machine breaks, be aware you cannot get parts to repair it. This seems to be true for all xTool products, and I think a 2 year (maximum) service life is preposterous for a tool at this price-point.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Thanks for this video. I am brand new to engraving and I am watching lots of videos to educate myself before I go spending a lot of money on things that I may not really need. I appreciate this video teaching where to find the important information I will need to know once I set up the machine that a friend of mine had advanced beyond. The machine did not come with an inclosure, but the more videos I watch the clearer it becomes that I really need one to keep fumes and fire from happening.",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I am ready to buy I am 59 years old I prefer to buy by phone.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "What is the lowest cost ones name I want to buy it.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "How do you laser a cup that has the threads for the lid on the inside where the little bracket tightens down on the wheels?",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "What a great review! I've been looking at this machine and the Omtech & P2 as well. \n\nCurious - how would you say the noise level is for this machine vs. the other C02 lasers you have, such as the GF Pro?",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Well just goes to show I'm different.. I like the dings and darker spots, it gives the piece character.. and even tho nothing is perfect, it is still beautiful 😊😁",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "I was just told xTool no longer sells parts or heads for their D1 lasers. If true, that would be a deal-breaker for me, and I will never purchase a machine from ANY company who discontinues parts and support after such a short time. I don't care how good the technology, it is not worth it if it becomes a paper weight after a year or two.",
    "likes": 1,
    "video": "I was wrong about the xTool D1..."
  },
  {
    "text": "Would like to have seen some examples of what it does.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Got a Sculpfun S30 Pro- 10 watt diode a few Weeks ago. I really like it but I am already wanting something more powerful! Been thinking about getting a k40 to tinker with once I get a little more stuff done with my current laser- I love customizable hardware so I see that part as a plus, you get to know your hardware by upgrading/fixing it which makes any problems in the future much easier to diagnose and fix easily, without that understanding a Person often ends up just throwing out perfectly good things- I dumpster dived for a while and the stuff you find is really crazy sometimes- it's just a bit too inconsistent to be feasible where I live. I LOVE this laser stuff though! Wish I'd gotten into it a long time ago!",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Wow the conveyer belt feature looks awesome, very good review... Father's day gift idea.. the full 2 feet width surface is great for some bigger projects",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Love your videos, I am looking to purchase a laser to simply do engraving boards. Really don't plan on doing anything else with it. What would you suggest for your lower price range units?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I'll wait for the camera feature so that this is comparable with a GlowForge for the kids.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "In these videos on different machines you barely show the actual results of any engraving. No comparisons to other machines output, no closeups, dim and blurry shots, no common objects like a pencil or ruler next to the engraving for scale, no side by side comparisons to commercial products with engraving, no comparisons to the same engraving printed with a office laser printer. The manufacturers web sites also don't generally show anything with any detail. I can only conclude these non-industrial laser engraving machines in general don't do a good job. I think anybody shopping for any laser engraver should see results in person with the products they want to engrave.",
    "likes": 19,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "is it good for branding, like if I wanted to make a tattoo on myself",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "The only thing that has prevented me so far from getting one is the price...",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Personally instead of a glowforge I would go with a 50-60w Chinese laser And a laser chiller they have a much larger bed than the k40 and just better overall quality and still the 50w with a chiller and mods is around the price of a glowforge. the 60w 20by29 af js expensive but with a chiller and accessories for under 4k it’s comparable to the glowforge pro witch is 6k.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "I am sure there's a word for that very 2020 thing vloggers do where you signal the end of the video by blocking the lens with your hand. Now, the question is not what that word is, but can anyone please tell me when it will frikkin die out? Please find the place \"hold my beer!\" went to lie down and die. \nIt was jarring the first time it happened and now, years later still is. And nah, it was never cool. \n\nAnyhow, thanks for the video.",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Does this laser produce fumes?  Are there any issues with running it indoors?  Thanks for the great videos.",
    "likes": 4,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "chinese sellers lying on the specs -> surprise pickachu face",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I purchased the Gweike Cloud laser in 2022.  I need a drive belt, they wont sell me one. Service is the reason not to by Gweike Cloud, the laser works or used to. I can't get parts and they do not offer a service manual of any type.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "You have to schedule a 30 minute (week day only)  'consulting' call in order to even think about buying one of these.  What an archaic and unnecessary sales model.  They just lost my business.",
    "likes": 2,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "What do we need to cut through 0.5 mm thick Ti sheet ?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I buy rags that are ripped up T-shirts at the big box store. I cut them with my laser to a more manageable size. The secret is, cut them in one pass or they will catch fire and wear safety glasses because cutting white T-shirts will brighten the whole room! I'm using a Falcon 2 40 watt diode laser with air assist. The laser has fire detection.",
    "likes": 0,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "I have one from Longer, and even as an entry level laser engraver, it seems to do a great job. For a beginner its quiet a good way into the laser world.",
    "likes": 7,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "How is this with acrylic? Looking for a decent cnc for my acrylic stamps for myself",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Maybe I’m just not seeing it but do you have a video talking about the differences between a fiber and a UV?",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Good info. I have been using a ULS 25W CO2 laser for 22 years but it is in need of a new cartridge and that is much more than the hobby machines made today. I just use it for my own hobby projects so looking for a new table machine. Thanks",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi, thank you for the review. \n\nWhat about just a unit for engraving custom logos on any type of shape or surface? The type of unit that I can position over any type of big or small object or shape.\n\nI need to engrave custom logos, 3x3 inch maximum. Need to engrave on around and flat surfaces. The materials that I use l are glass, wood, plastic and metal. \n\nThanks again!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Thanks so much a great review!  Our slowforge has been giving us fits for a long time now, where we have fixed the red wire issue several times.  Glowforge's support only replies with special over a thousand to pay for a refurbished one that might not last either.   We are doing fairly well with our small business, and decided to replace the slowforge with the Thunder Bolt.  We look forward to having a laser that is top quality with customer support that backs up their product.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Hello. Can you please recommend the Lazer machine for acrylic to use with resin epoxy. Example face clocks. Thank you in advance",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I’ve got the LP3. I love it.  but would love to have more setup instructions for the setting when doing glass or just engraving cups. I also have roller platform. Such a let down. The rollers should have been rubber coated because metal cups slide on it. And you can take it apart to add rubber bands and length is very limited. Love the video.",
    "likes": 0,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Please analyze the 3D dynamic focus device for fiber lasers. Feeltek is the brand, I believe they are the manufacturer.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "how does it compare to flying bear laser x with the whole bundle package?",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "When test’s / reviews are done and not shown in a long enough shot to have a better look at them there are only 3 reasons for it I can think of:\n1) the producer does not know a thing about reviews should look like and what information are needed for the audience to get enough information to come to their own conclusion or\n2) the test did not turn out great \n3) it is not a review but a paid presentation of the unit (aka advertisement) and the host has been restricted in what can be shown and said with the aim not to harm the product",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "1800 dollar laser that wont cut materials. im  good",
    "likes": 1,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Do you know Any fiber machine that has a price around $1000?",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "I saw you hit Start in this video and not once did I see you with laser safety glasses on.",
    "likes": 2,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "I have been able to laser directly onto stainless steel with my blue diode laser. However it won't engrave or mark on any other type of metal.",
    "likes": 2,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "On their website they state that the non MOPA ones are  MAX lasersources, while the MOPA types  have JPT sources, they also sell lenses where you can change your working area up to 150mmx150mm or down to 70mmx70mm",
    "likes": 3,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Hi, very useful and informative 👍. Can you tell me how much material is removed during the process? I’m thinking of brass, could it be used to create a wood brand, perhaps with multiple/many passes.",
    "likes": 1,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Do you anything about the latitool laser?   Thank you so much",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "They aren't paying you to do a review, but this is a paid review.  Free machine and affiliate links is a form of payment.  You're just not as highly motivated to be overly nice to them as if you were directly funded to do the review.",
    "likes": 12,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I like the idea of getting a laser cutter/engraver, but I am wholly against getting one without a full enclosure that's fully opaque to the laser frequency the machine uses. Sure you can wear goggles and protect yourself, but if there's any more than zero chance that someone else could walk in while it's running, no matter how small, then I'm unwilling to accept the risk of inadvertently causing permanent eye damage to them. Class 4 lasers are nothing to play with; even just seeing the spot they make can cause eye damage before the signal reaches the brain.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I’m needing to engrave glass with data coming out of a database. So CO2 and less talked about it needs to show up as a printer so a database can address it without going into something like lightburn. Do you have any recommendations?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "do you guys think that I will be okay with a s1 instead of a thunder? I feel like I will be yearning for a 30 watt Bolt if I get this. Its like spending a fraction of cost for a slower machine",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Not only the companies. Youtubers make it look deceptively easy and I very rarely ever see them talk about the pitfalls...most don't even mention the need to vent fumes from burning.  I regularly see posts from people who have no idea how to get started, they bought them thinking was like having a printer. It is very much not like that, it is a steep learning curve in image manipulation and also software that is needed to get the best from your laser.",
    "likes": 3,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I noticed that on the Xtool productss there seems to be a lot of people complaining about these products mainly they either do not work or quit soon after purchase. Also the warranty seems to be a joke. So if you are in fact looking out for your viewers why do you not zero in on these frequent failure machines and junk warranty machines and let your viewers know these things. You are telling us this or that machine is the one to buy.  so I would think if people buy on your word you are the one they will blame when the product is I don't know junk might fit for a descrition. I mean you are saying what to buy.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "lmao @ that stock footage of a \"woodworker\" crosscutting at a random ass angle with no sled or miter gauge at 8:57 .. yikes bud",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Is the customer service based in the United States? Currently have an XTool and their customer service is not great.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "As I’m watching this video I realized I am also wearing my pizza planet shirt! Also great video. Thank you!",
    "likes": 2,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "why do you keep calling it a 40w laser when its only a 5 watt \nthe whole unit can use up to 40 watts like most of the listings claim",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "These cutters should not be sold to the public. They should be enclosed and vented out of the room, not because of fire hazard as much as toxic vapors from the laser ablation. God knows what idiots will try to cut, releasing toxic gases. Shame on Amazon.",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I need the best budget laser to engrave dog tags, ect!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "This video is a hidden treasure I've been seeking! Subscribed, and I'm inspired already! - \"Triumph is born from dedication and unwavering commitment...\"",
    "likes": 1,
    "video": "The Features all Laser Software Should Have - WeCr"
  },
  {
    "text": "Is there a place to buy this refurbished ? As much as I’d love to buy just don’t have 5k. I feel like with no lasertube you could probably buy one that was used and not have to worry too much about longevity.",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "11 minutes in we find out we cant use it on aluminum, nice review.",
    "likes": 2,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Remember there is a threshold between the energy needed to cut some materials and the energy needed to ignite the same material",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "And here I thought LightBurn was your software of choice for a laser??",
    "likes": 0,
    "video": "The Features all Laser Software Should Have - WeCr"
  },
  {
    "text": "You imported a drawing……could you scan tools and Lazer cut foam?",
    "likes": 1,
    "video": "The Features all Laser Software Should Have - WeCr"
  },
  {
    "text": "Bed is now 169. Boy they got proud of them ill buy a different one for 50",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Hi, could you please help me with my Gweike cloud? I just cant find the solution of this problem. The problem is that my lens is always getting dirty after 3 minutes of cutting and then it wont cut trough and only let big marks. I would appreciate, If you could give me some advice how to solve this.",
    "likes": 0,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "Can you cut out copper plates? lets say up 3 mm? That would be awesome for making custom reusable copper sealings for cylinders , Engine casings,ecetera..",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "I was advised by XTool support that the S1 with the IR module + rotary could engrave inside rings however I have found this impossible - has anyone worked this out yet?",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I'd love to see a review of the Monport Onyx. For the price it's a really attractive feature set on paper but there doesn't appear to be a single review of it anywhere on the internet for some reason.",
    "likes": 0,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "Light from any of these lasers is not the type of lasik you want to get.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "About 5 months ago the Atomstack 30W model price was $1200 and as of today November 23 I can buy this same 30 W model is less than $500. Is that anything wrong with these machines? Just curious. Make or Break, I want your honest opinion.",
    "likes": 0,
    "video": "Is Saving Hundreds Worth it?  The Atomstack X30 La"
  },
  {
    "text": "What's the point of a list of machines with data points without the ability to copy to a database file?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I built the paint stand tonight. Cut nicely, went together smoothly, …and my bottles of paint don’t fit. 🤦🏻‍♂️",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "Please  doa  review of the FM7979-50S - 50W Split Fiber Laser",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Amazing review! I want to ask you can i cut acetate plates for eyeglasses with this cnc?",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Don't forget the safety glasses that come with diode lasers are unable to filter the laser frequency and your eyes will pay the price.  Always buy separate glasses that will do the job",
    "likes": 2,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Exacly how compatible is the Polar with Lightburn?  Are you able to use ALL of the Polar's features with Lightburn, or only some of the features?  Such as the camera, auto focus etc?  \nAsking because I just got the Xtool P2 that claims to be compatible with Lightburn, and yes, it sort of is, however its VERY limited. Cant use cameras, no auto focus and I have to manually put in stats of my cut material each time.  It sucks.  Pretty much have to use the Xtool software which is nowhere near as good as Lightburn!  I'm considering getting the Polar instead.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "what is a good entry level laser engraver for home project use?",
    "likes": 0,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "Great comparison video there, but as a total newbie, what is the answer to your title question? is this the one for me?",
    "likes": 0,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "Hey man, I'm really struggling to find a laser cutter that actually cuts through steel and stainless, I'm aiming for 18ga but there doesn't seem to be many desktop options. Any insight?",
    "likes": 0,
    "video": "Best Black Friday Deals on Lasers"
  },
  {
    "text": "I'm struggling to find desktop laser that can cut up to 18ga steel/stainless. Any insight you could offer up?",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  }
]