[
  {
    "text": "We just ordered the qweiki today. Within the last hour. Hope we made the right decision. Quite scary ordering from China because of the stories of it being held up at customs or people have also said theirs came damaged. But they did rectify the decision with those people. Fingers crossed 🤞",
    "likes": 10,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "If you run a business, would that make sense to take the tool that's compatible with the leader software suite in the market?",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "If it wasn't cloud based I would be interested  in the G machine",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Am intending on getting the xTool D1 Pro in March.  But I follow your channel to keep tabs on the latest info.  Do keep posting on that, especially techniques and methods to get the most out of the diode lasers.",
    "likes": 3,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "In my view (run a laser buisness and do lots of stuff with it) glow forge hand cuffs you with their software, lightburn is the premium laser software and if I was designing a laser it would start with lightburn control and build from there",
    "likes": 12,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Spend some time watching videos on Lightburn and to hell with glowforge. Lightburn is awesome. The learning curve is not at all bad and the power of Lightburn can't be beat.",
    "likes": 4,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "if that jet or plane contacts a balloon we will never get to do this again!",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I avoid Glowforge like the plague due to being locked into their cloud-based software.  Lightburn may have a learning curve, but it's infinitely more user friendly than say RDWorks, there are tons of YouTube tutorials, and once learned it's extremely powerful.  If Glowforge allowed for the use of Lightburn in addition to their software, it would be a 0 no-brainer.",
    "likes": 81,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Been waiting for this review, thank you! Love your advice",
    "likes": 4,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "New viewer! Love your content. Thanks for what you create!",
    "likes": 2,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Remember that one time, when they hired an alien to capture the moon landing on camera?  Is there a higher IQ anywhere to ask who exactly shot that footage, and did they come back to pick him up or what?",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I would had definitely wanted to see the last comparison with D1 Pro USING the AIR ASSIST. Seeing that would have been DECISIVE!!!",
    "likes": 3,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Looks like a flat earth to me boys and gals. When you turn the camera absolutely no curves AT ALL",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I learn what not to do on every project.  Thx for this video. (BTW, I am 80)",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Better not to buy from them directly. \n\nI bought X7, rotary, and extension kit. Had a few issues, the packaging arrived damaged, and cables were outside & damaged. and they did not bother to put an outer box. The order value was €975,  but was charged €1027.36\n\nI wasn't happy with the way it arrived, asked them to make a return. For 4-5 weeks they were trying to negotiate with €20 refund for the damaged item. Then stopped responding to email.\n\nAs per EU law, the right to return. Return policy should be clear, they are interested in honoring law or  EU standards.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "i can not understand why these simple cnc's need to cost that much...",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Head to Head video? xTool D1 Pro vs Atomstack X20 Pro?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "My M1 will not do the automeasure or recognize the material label.  It always gives me the \"offline\" warning when I use the automeasure.  I have the M1 hooked up to my computer with a USB cable not WI-Fi.  Any suggestions",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "The machine comes with small metal angle brackets to secure the unit to a baseboard. It is a simple DIY job to add a support under the free arm, which makes for a more solid unit. Once secured to a wood base board, there are no shake issues. It’s a no brainer fix well worth doing.",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "What would you suggest in regards to this vs the atomstack 20w? I'm looking into doing overall everything possible. Wood cuts and burns also sheet metal/stainless pictures  And general use. What's the better buy?",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "What is the best laser cutter engraver to cut wood +- 7mm or more and engrave on metal that do not let the material burn like the wood on this review and product that have some warenty maybe. Want to be able to do neet engravings on knife blades wood and leather etc. and round objects like glasses, tumblers.? Budget under a $1500 give or take. And some safetyand cooling featchers would be nice.",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Hi thanks for video what can you cut with the blade?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "I got the machine and tried every module. And I can only say it sucks.  I got like 400$ Single use machines that get better results. (3D Printer/Laser/Small CNC) I was fooled by the sturdy design and the idea to only have to have one machine at hand for my projects. If I could I would refund it imitdiatly. The 3D Printer is slow as F.. The CNC cant even cut a small juwlery box without skipping and the \"old\" Laser moduler is also really really bad. The Photo feature cant even get a proper picture and after month of wating for an update to fix the abd module with an software update the release a new one for 400 bucks. Jeez. I really wanted to love the machine but i just cant.",
    "likes": 2,
    "video": "Is this feature worth $2400?  The Snapmaker 2.0 Ro"
  },
  {
    "text": "is it just me or are the 4 individual beams clearly visible in the video?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "11 000 mm per second?????????  11 meter per second? 40km/h? Hurricane!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Bro I want to buy this machine but got a question! Is is possible to run it without the laser? I want to use it for ''another'' project. I want to move this thing to certain location with my own code is that possible? Please help me answer this question.",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "i almost hit the buy button till i saw the price tag of $1200  :(",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I’ll like to see how you engrave a foto of a person on a black powder  coated aluminum piece.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Sorry but I find it quite annoying that people keep referring to these lasers as “Chinese” Lasers. I’m sure you already know that most everything you use, from clothing to computer are made in China, or has a part that’s made there. Who F-ing cares if it’s from China or made in someone’s back yard in Tijuana, so long as it’s good quality and works.  The “made in china” slur Is not relevant in todays culture. When the US consumer market becomes predominantly made in the USA, then saying “made in china” might have some relevance.",
    "likes": 5,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I dig the new format, but seems that the costs were a bit flated. In my experience, maxing out the k40 can be done for about $750 that includes upgrading the board which only costs me 50 dollars for a grbl off line board with wifi and touchscreen, along with air assist, water cooler, dope digital panel, one button emergency shut off and of course some RGB to wrap up the whole thing and give the laser that, \"looks way more impressive and than it really is\" look.",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Please stop saying \"Laser Diode\" It's a \"Diode Laser\" It sounds picky, but there's a big difference between the two. Also you're showing upgrades to the D1, not the D1 Pro, it already has those upgrades.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Can this machine cut thin aluminum ? .... im looking to cut number shapes for my house number ....",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Cool as an overview but could not call it a tutorial - tutorials teach and DO get down into the weeds!!! They also understand students know nothing and go slow with big screen shots showing menu items being selected... you know... teaching? Then you can call it a tutorial that gets down in the weeds",
    "likes": 5,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Just received my unit - thanks for the video (John 3:16)",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I have a 500 watt spindle. Will that fir this machine?  It’s a 52mm and is there enough power for it or can I use the power supply it as with it?  Thank you",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "will that work on animal eartags?rubberize materials.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "What would your recommendation(s) for a machine that can engrave business card size blanks?\n\nOne requirement I have is that it’s possible to make this machine automatic so it needs to be open so I can fabricate some kind of mechanism to place and remove pieces",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I work as a laser operator, the machine i use is worth over £1,000,000 and cuts 40mm stainless 🤣",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Hi, are you using the lightburn or the program that follows with xtool?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Have you seen a Maslow CNC before?  They have a work area of 4'x8' and can be wall mounted, and now sell with an optional laser engraver.  Been super curious if the laser engraver is worthwhile",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "how is the exhaust? If I run this in my bedroom will it smoke up the room or is there a way to redirect the fumes!",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Could you recommend a machine in this same price range or thereabouts that is capable of cutting sheet styrene, pvc board and plexiglass in thicknesses that are no greater than a quarter inch?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can you recommend a machine that is capable of cutting styrene,pvc board and plexiglass in thicknesses that are no? greater than a quarter inch in the same price range",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hi Brandon, currently considering purchasing my first Laser. I'm a little up in the air between the Atomstack X20, and the Xtool DI Pro 20W, any suggestions??",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "The stars are Gods children not what you've been mislead to believe in!!",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  /"
  },
  {
    "text": "Does the compressor going through the head just blow the smoke away, or does it also get used to help cool the diode.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I'm lost here, did you just guess at what you needed for structural steel? \nI'm a network engineer, and it looks like you didn't even look at any contemporaneous  examples before jumping in...  Kudo's though for showing your mistakes.",
    "likes": 1,
    "video": "Welded DIY Metal Bed, This is What I MESSED Up"
  },
  {
    "text": "To clean the base plate and the prisms you can use warm water and dish soap as well.",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "I just binge watched a lot of your videos after looking at the Atomstack and trying to learn about the different variables and stuff to consider. If I was going to start with the 20w laser I'd probably lean toward the Atomstack, but if I want to start out with the 10w or maybe even the 5w and then upgrading to the 20w or something down the line, which would you go for? Looking to mostly cut out board game components, so a recommendation for initial power would be helpful as well.",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Hay great video Thanks for your time and info👍🏻\nI have a question on a longer ray 5 \nLonger ray 5 how would you connect a rotary tool?",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "Do you ever check the speeds of these?  11,000 mm/sec is 36 ft/sec or 24 mph...",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "How many of the guys in the comments section are using this for business? I have a graphics/sign business and want to add laser engraving to my product line just wondering if this will get it done.",
    "likes": 3,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Does the xtool sell extension to cut larger material?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "You mentioned fiber for cutting metal, which one would you recommend that cuts metal, leather, wood, plastic etc.?\nThanks",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "neje is still best and biggest diode, you are leaving this out",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "How about the problems with the machine kicking back into the limit switches and not allowing to get to the same position?",
    "likes": 3,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I already had de d1 10w model will be possible to buy just the laser???",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "My wife bought me an XTool D1 for Father's Day. I can't get anyone at XTool to get back to me to upgrade to the D1 Pro. I haven't taken the unit out of the box, in case they get back to me. I've tried every email I can find to reach XTool, but they haven't responded. Damn!",
    "likes": 4,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I have the x20 and I’m new to the game but I’m happy with the product with the enclosure.Hopefully I get a co2 laser.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I'm new to lasers and learned a lot through this channel. I'm curious your thought on Xtool's new enclosure for the D1 Pro. If laser cutters are vented out a window is that sufficient enough?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Tha atomstack can also make use of an extension kit, is the build quality that inferior? I'm considering one of these machines in the next 2 months.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Hi, could you clarify that the limit switches actually work for homing and not just bumpers to avoid grinding? I've been unable to get an answer out of Xtool, and none of the videos so far show the machine homing to the limit switches. Also, are you able to change your homing corner in Lightburn given the additional switches?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I just bout the Atomstack X20pro. I looked at both units and both are great. Xtool I think the build seems better however the fact air assist is not included for a high end model was what turned me off. Also I think the Atomstacks laser cover is better at protecting the eyes.",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I already put my money down on the Atomstack! Good to hear that the differences aren't too substantial.",
    "likes": 3,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Sent back a genmitsu jensoku lc-40 because it is only 5 watts. If the work area on the lc-40 was the same as Xtool d1 or larger & it had a 10 or 20w laser option, it would be the far superior machine. For ENGRAVING, genmitsu jensoku lc-40 is superior. I want to cut thin wood & use rotary, though. So I was forced to by d1 pro 10w since 20w is way too expensive right now. Speed trade off, right? If lc-40 had 10 or 20w, I definitely would have bought that. If I was ONLY engraving, it would be the best laser for that, hands down. Build is just that much better. Linear rails, no brainer.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "how to i start my first project. i have no experience",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "With the cost of this unit being 1200 usd,  I'm starting to think co2 laser vs diode.",
    "likes": 3,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Brandon, how does the laser dot size (.08 x .1) or any of the others, compare to the size of the dot on a k40 or larger co2 lasers…. I would love to see the dot size  compare to each other including co2…",
    "likes": 15,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I was initially going with xtool but tried purchasing during launch the codes provided did not work, emailed xtool and never heard back plus didnt want to wait to most likely mid Aug before they actually start rolling out. My big thing was air assist I know its only 150ish but something with that amount of power should be included IMO. Also planned on using lightburn so software wasn't an issue for me, although I do like xtools platform better.",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Would really love to see a comparison of the modules for size that you have tested on these various machines over the past many months. Laser dot size was a critical for me as I do mostly engravings.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I have the xTool D1 and I just recibe the 20w module that I bought at the early bird, and have the power but not the small adjustment nor the air assist nozzle. That’s the worst combination posible",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "optical output power? Or, as usual, the power consumption of the module xD ..A laser power meter to check the manufacturer's specs would be nice.",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "The one here in the vid, atomstack x20 pro or neje max 3 - which one of those would you recommend, and why?",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "The Atomstack s20 pro has this claim about using 256-bit color scale on their amazon page: \"Upgraded Atomstack self-developed 32-bit motherboard built-in 256-bit color scale. It achieves a finer engraving result and a higher contrast effect.\"\n\nCould someone help me understand this claim? Does it only matter if you aren't using a computer, or is it completely bogus? If it's true to an extent it'd be neat to see a side by side of a detailed engraving.",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Atomstack wins hands down. Also comes with air assist. Xtool feels like your getting mugged right off paying extra for accessories. Someone please tell me if I’m taking crazy pills",
    "likes": 8,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "In about to buy the Atomstack.   I have a cnc with an old 2.8w laser.  I already run Lightburn, so the addition of the air assist pushes me in that direction.  I’m actually an electrical engineer, and I’m thinking the next level will be 8 LEDs in a circular array.",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "so I've watched a few of your diode laser reviews... which is your favorite, or really which one do you use the most because it just works better? :-) tks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Hello. If you would have to decide between the AtomStack 20W and the Xtool D1 20W Pro which one would you buy? Thank you.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Atomstack for sure. They have a coupon right now for $100 off. So it is $999 compared to this at $1169 and $139 for air assist. $308 is a significant difference.",
    "likes": 2,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Now that they have the emergency flame shutoff, does this mean we can pause and restart jobs? Very frustrating on old D1.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I've been waiting for your review of this great job! but I'm still torn about weather to go with the atom stack version.. what does xtools air assist look like as far as size compared to the atom stacks.",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Ordered mine on launch. Very excited to get it. I love my D1 and can't wait to start using the 20w Pro.",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "A fact that is quite frustrating: you order a product that the privileged YouTubers, who got these machines first, advertised as high end and state of the art and when you get it half a year later it‘s outdated. When I order today this 20W module there will be 100% a 40W module when I finally get it.",
    "likes": 6,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I bought the 10w D1 Pro as me being a first timer during the launch stream.\nThanks for this review.",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "HI Brandon , excellent review as always , im torn between the D1 PRO and the Sculpfun s10 or the atomstack equiv . been looking at these for ages now to integrate these into my little airsoft business mainly for engraving  but as far as i can tell the D1 and the Sculpfun s10 will allow the laser unit to be positioned  higher where as the atomstack needs to be a lot lower down for focus . what im really torn over is wether or not i need the 20w or would a 10w suffice. any advice would be grateful thanks",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I just bought the 10 watt version a few weeks ago. Sad face",
    "likes": 1,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Love to know how this compares to xtools d1 pro 20w. I can't decide what one to get.",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I was looking at 2x speed? Omg, speak so faaaaaaaast 👀",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Great video as usual ;) to bad that you didn't measur the size of the laser point as you always do :)",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Almost a complete waste of time. Just about no benefit to watch any of this video.",
    "likes": 1,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "so looks like this would easily cut say 3/16 in leather?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can you do a review on the Comstock 10W dual diode system? Thanks!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "How small the character this machine can engrave? Can it engrave 9pt characters?",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Which one is better d1 (10watt) or the sculpfun s10? I'm stuck trying to figure out which one to buy?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "None of your discount coupons work. Do you have any updated ones for xtool products?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "could you do more videos on chinese lasers that are real branded products? for example blue elephant, g.weike and acctek? the is like... 2 search results on youtube for any of them an d like a total of 3 pages on google.",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "i cant for the life of me figure out fusion 360. too complex.\nDoesnt help that they redesigned the GUI and most video's use the old one..",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I've watc hed a lot of your videos, they are great!  How does this xtoll d1 10 watt stack up against Sculpfun s10?  I've tried browsing your site for comparison.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Hi... Great video - Thank You!..\nI want to cut .5mm stainless steel, 1/4 birch ply, and acrylic - will this machine do this please?..",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Can this cut intricate pieces of cardboard that is about 1/4” thick?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I'm struggling to wrap my mind around how anyone can unbox with such a lack of pace.",
    "likes": 1,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Hello! Thank you for this great video. I was wondering, how do you determine what size endmills/bits you need? Will Fusion 360 give you an error if you picked the wrong size? Also, you mentioned there were resources for determining speeds/feed rates, can you please share those? Finally, I didn't see an answer to the comment below, but he asked how you were able to zero your 2nd and 3rd bits after facing the whole piece of stock?",
    "likes": 4,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I like the bundle feature. I can do multiple printing in one shot and the camera let's identifies de object",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Excelent. I will be using whit  Atomsttack B1 enclouse to get the smoke out of the room. 👍",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Thanks for the file!  Why does the image come in mirrored or backwards?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "I'm looking at getting one of these co2's 40k and was wondering if you know if it could cut abalone vernier?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "do you have any experiance with lotus lasers? they look ok and i am britsh i want to support a british company... but dont list the fucking prices so im instantly turned away",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Is that all these people do is make star wars crap?",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Hey Brandon, I wanna cut through a bendable magnet foil / sheet whose thickness is 0.5 centimeters (0.19 inches). So what would be the cheapest option for that?\n\nAlso, is there any special need to prepare a vector png file, or can you just directly end it to cutting? it's like a 2D game sprite.\n\nThanks!!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "A laser is dirty and a cutter should  be perfectly  clean. Not a good mixture for quality  work. Get a  D1 and Cameo 4 if you care about  the quality  of your  work. I wouldn't waste  money on one.",
    "likes": 2,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Amazin video.  I got a Atomstack s10 pro 10W lasser. But because of the big size and a small apartment, I am thinking to return it and get a Laserpecker 2. But I don't know if it is the right decision because I want to start a small business and offer engraved things in different sizes but also small wood objects and the Laserpecker doesn't seem to be able to cut so well. Can you please give me your advice? Thank you for your answer",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "So helpful! Our Glowforge Pro died after minimal use; it’s not the laser. Ribbon and small circuit board replaced - no luck. We got it in early 2019. Hard to pay $6k and have this happen. This is a great review, and I’m glad I found your channel because we are considering a replacement, and it has been daunting.",
    "likes": 4,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "@Make or break shop mate I want a machine that can cut and engrave metal for making business cards.. Whats your pro recommendation ? thanks",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "would be interesting to show the technology behind the laser.",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Has any body tried to use it on work shop tooling.. I know it's not a fiber laser but I'm wondering if it would leave some sort of lasting impression on tools like sockets, spanners.\nAny help would be appreciated",
    "likes": 2,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Great review. I was sold on the M1 until you pointed out the lack of the air assist. I will wait to see if they upgrade it. The fume extractor is really pricy and I wonder how long before you need to replace the filter which s also quite pricey! Thanks again!",
    "likes": 2,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "I have the xtool m1 and love it. I also have a glowforge but the m1 allows me to use the rotary for cylindrical engraving.",
    "likes": 3,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Staff at 3pL said this can not engrave on jewellery made from gold, you need 50W minimum. What do you think?",
    "likes": 1,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I love your reviews they always seem truly honest.  I have the M1 and brought it for the blade laser combo. Can't wait to see what else you do with the M1",
    "likes": 3,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Have u seen the lunyee m1 laser n cnc the bed is ridiculously huge! Looks like 4x4...looks like peeps are trying to top each other in crazy ways lol! So basically it's a cricuit with a laser??",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Mine is on the way. Needed the enclosure, because it will be in my office. I built a suction system and punch a hole in my wall for this ^^",
    "likes": 1,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Love your channel; sooo helpful.  I’ll be buying both a CNC & laser next year and will be consulting your channel before those purchases.  Thanks!",
    "likes": 2,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Hello.  Do we have a chance to have a business cooperation? Can we pay you to review our laser module？",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I need one that cuts at least up to 1 mm. Please help.",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Anyone can help me..i can't afford this machine..\nJust try to help and send me this machine pleas",
    "likes": 1,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "YES, Interested in video on Frequency and Pulse Width!\n\nthx",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Vinyl is PVC. You will produce Dioxin and hydrochloric acid. Stop giving dangerous advice to people.",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Wish I could buy Xtool in the U.K. anybody know if the version on Banggood is the newest D1?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "It's very dangerous, potentially lethal even, to laser cut materials like vinyl, chemically treated leather, ABS, PVC, and many common plastics (it will also damage the machine). But these precautions are only briefly addressed early in the video, and later on you recommend laser engraving the included leather which is definitely not veg-tanned, and is most certainly producing toxic fumes.\n\nWith a combo unit like this, using the available materials in the wrong way will definitely happen to new and uninformed users, and they will be sorry for it. This needs to be addressed early in the video!\n\nAdditionally, you may not have been paid for this review, but you were provided the machine for free and your links in the description are clearly affiliate links to the product in question. You must disclose this to your viewers.",
    "likes": 3,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "After waiting several months, my M1 finally arrived last Friday. Unfortunately, the cardboard box was almost completely destroyed and depressed all around during transport. I am so frustrated that I haven't opened the box until today to check the content.",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Thanks for the review. I have chosen D1 just because of AirAssist. It is pity that it is not available for M1. It think it is critical.",
    "likes": 3,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "I am sort of confused where diode lasers are going. It started out as a bare bones all safety to the wind cheap alternative to CO2. Today they are technically a far more expencive alternative to CO2 with reduced productivity and no safety features that the most basic of CO2 units have. This diode laser with a cutting base option and box to stop the house from burning down while catching the fumes is $100 / watt. Where a CO2 most basic @ double the wattage is $15 / watt and 1/3 the overall price.",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "in the video it says $650 in promotion coming down from $800.\nNow if I check it out it's $921 \"in promotion\" from $1116\n\nThese tech usually drop in price with time, don't they? What's up with this one? \nIt's crazy expensive for more than 900 USD.\n\nFor $650 it'd be very reasonable indeed.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "1120 you cut out something. id really like to know your thoughts about all companies. Thanks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "what type and/or color of material should I use for an enclosure for xtool d1.  I am meaning a window or maybe full cover enclosure so it will be safe if someone walks in my shop or I forget glasses",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "For more interesting colors on stainless you have to defocus the head about 1mm up to spread the heat out, something I've experimented with on a 70 watt Tykma large field and later heard from a former Tykma applications person. Be glad the clones cost what they do since the industrial machines are usually 15x that price. If they are running the same ripped software there should be tools to distort the marking field to match your part's contours in the absence of a rotary head.",
    "likes": 1,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "No air assist is a deal killer. Plus, I can add a 20 watt laser to my D1. Great review as always! You are the person I trust when it comes to lasers.",
    "likes": 7,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Would it make sense to put a second base in so you won't need to clean of the residue @9:55 ?",
    "likes": 1,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Great review!! After I pre-ordered a few months back and just got mine set up for leather work. It's turning out to be invaluable, especially for prototyping. I can cut out pattern pieces of full grain leather with the knife without burning any edges, then laser engrave, all in one go. Originally, the 45-degree blades that came with the box were not able to cut through my 1.2mm veg tan, but I saw that after product launch, they released a 60-degree blade. Shipping was going to make those blades extremely expensive, so I took a risk, ran to Hobby Lobby, and bought Cricut Deep Cut blades to see if they work. They do!! Pretty sure they're the exact same blade as what xTool is selling. I would love if the Cricut knife blade would also work with the M1, but it seems more proprietary. Maybe xTool will make one. \n\nTake care!!",
    "likes": 8,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "If a window is unavailable, can you hook the exhaust to a carbon filter or would that not be sufficient enough for safety?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "I'm a complete laser newbie, and I was looking at the d1 for a long time. But I don't have a garage or some other unused space I could just let fill up with smoke. So I went with a preorder on this one, as I do have a quite large basement, with a tiny window to throw that hose through.\nNow I just have to wait who-know-how-many-months for it to ship.",
    "likes": 3,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Ever tried to cut Mother of pearl shell with this kit ?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Would you pay extra to have a cutting blade?  Check out the xTool M1: https://geni.us/xtool-m1?track=dZZ5HgbPLRU",
    "likes": 2,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "Do you think the atomstack x20 pro., would be a good starting point for a small scale laser engraving business. Also what do you think the life of this machine is with daily use?  I'm just starting out with laser engraving. That said I don't want to buy something I would need to replace very soon. Money is definitely a factor for me. It looks like laser engraving would definitely enhance my wood working projects. Just not sure what machine to start with. Right now I'm watching videos on different machines which can be confusing to say the least. I'm also taking this time to watch videos on lightsribe, it looks like a very good program for what my needs will be. Thanks in advance.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "How did you get black on aluminium?  Even the ppl selling them say that isn't possible. Only white engraving",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "what were the settings for taking paint off the tumbler",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Can’t find the link! It’s not going through when I click on it! Can u please send a new link",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Pl"
  },
  {
    "text": "That WiFi antenna is pretty durable. You lifted the whole engraver on that poor thing and it survived.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Don't expect any customer service. I purchased a  Laserpecker 2 deluxe package. After nearly 2 months and $2000.00 NZD nothing had arrived. I emailed them and did not get a reply. After several emails and finally making a threat the Laserpecker 2 package arrived. I received a faulty unit and despite  repeated emails they have yet to respond. I'm in the hole for over $2000.00, don't make the same mistake. This company has no customer service and will take your money with no accountability.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I bought the A350 nearly a year ago and have been pretty happy with it. Haven't bothered getting the rotary module. It doesn't feel as good as getting independent machines but then I'm in a pretty small shop so it doesn't take up a lot of space. Predominately I make boxes so the laser and cnc functions are what I use most of the time. If you were working on bigger items like furniture then I'd definitely steer clear. The unboxing and setup was first rate although I agree Luban is pretty ordinary - I wasn't even able to insert italic test for a quick laser engrave and instead had to use Inkscape.",
    "likes": 2,
    "video": "Is this feature worth $2400?  The Snapmaker 2.0 Ro"
  },
  {
    "text": "What would your recommendation for a straight fiber laser for the money right now.",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I need this but i can't afford..\nIf someone help me for starting my own business..pleas send me this machine",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "سبحان الله العظيم وبحمده أقسم بالله العظيم إنها الأرض كبيرة وعظيمه جداً جداً ومنها خلقنا وفيها نموت ومنها نرجع الي الله سبحانه وتعالى أشهد أن لا إله إلا الله وأشهد إن محمد رسول الله أستغفر الله العظيم و اتوب اليه",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "أفضل نوعية فيديو رأيته في حياتي شكراً علي التصوير الصادق يامحترم",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Where did you get the honeycomb for underneath the material being cut?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "i am searching for a laser to structure glass, could u test the mopa laser for that?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Are there any copy-write infringement in terms of selling wood working projects? I.e. say Jimi Hendrix portrait on coasters or something? Thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hi, so are you saying that lightburn comes with the purchase of the D1 now?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "Cool! question: Can either of them MOPA or fiber (even the omtech one) cut metal? (i'm talking about very thin sheets from .50 to 3.50 mm)",
    "likes": 1,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Can you adjust the power and speed into corner cuts in light burn? I’ve never used it but that would be really helpful.",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "You really want those free review units don't you. Man. The pandering you people do just to own that shit is beyond me. Donate the machines you are not using to a non profit place that can use them!!!!!!!!!",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Hi, great video! Quick question, which one can cut thin metal sheets? (<1mm)",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great review thank you. Can this cut through 4.5mm oak?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Really cool, would buy it in a heartbeat at 500$, can't justify 3-5k for hobby yet tho",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Really cool, would buy it in a heartbeat at 500$, can't justify 3-5k for hobby yet tho",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "How to modify length and width coustom size\n100cm *80cm????",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Is that 5mm lite ply or birch ply you're cutting?   If it's lite ply, how well does it cut 5mm birch ply?   What about 1/8\" or 3/16\" balsa?   I'm a RC aircraft modeler and would like to cut my own kits. Thanks.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Hey Brandon, Brandon here! I did a lot of research on lasers and your video ultimately sold me on it so I ordered one and used your coupon code and saved a lot of money which was super helpful! Thank you so much for such a great review!",
    "likes": 4,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Hi there, Could you make a video of how to use the wifi? I dont have a computer near to where i want the laser. \nIs it posible to use the app just like a controller as the Atomstack has\nSo you can do framing ans press start",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "Thank you for the discount code really appreciate it, I saved $108 total (D1 deluxe bundle, 20W diode and extension kit).\nCrossing my fingers and hoping for a good start.",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Module Max input 24 volt 3,5 A ?  so this module will also work with ortur lasermaster 2 pro because its output is also 24volt ?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Do you have a video that covers the RE3 set up portion for the rotary tool?",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on "
  },
  {
    "text": "Is this also possible with the the free hobby version of Fusion 360?",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "I'm gonna pick up one of these modules, you have an affiliate link or even a discount for just the m100 module?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Xtool already has their 20W laser out. I'm getting mine on the 22nd. They have been shipping them out for the last month.",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "but without them been willing to sell you spares they are useless",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "How much power does the laser module draw from the wall outlet?",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Since MOPA is better for plastics, I'm curious how well a small, simple machine like this would do with PCB prototyping or small scale manufacturing. It wouldn't be too difficult to have a multi-material profile, just switch frequency and amplitude within a certain set of lines in the code. 'Etching' a PCB would be such a great alternative to the typical developing methods, as even some of the newer prototyping methods, like using a photoresist PCB blank on the LCD of an MSLA printer, still require developing in chemicals. If this could not only etch the traces, but also etch the board for proper marking, I don't see why this couldn't be a viable alternative to cheap board manufacturing. Stemming from this, I'm curious how well this kind of laser handles various solder masks, say if someone wanted to mask a whole board then etch the masking off the pads, instead of more typical processes; most PCB software already separate pads and traces, so technically you'd already have a file for just pads, with the proper settings you could potentially etch the solder mask but not the copper pad underneath. \n\nIf it works out, something like this could be great for maker spaces, assuming someone had already gone through the calibrations for specific materials, thicknesses, etc. Even as a hobbyist or small business, a machine like this would be amazing for prototyping and small production runs.",
    "likes": 3,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "god, i love your videos.  so informative and engaging. thanks for putting these out there!",
    "likes": 5,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "These companies don't have any incentive to fix their marketing. Because youtubers will still review them. Only if you boycott these companies will they fix their marketing",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Brandon, boy did you get beat up on this video. I hope it doesn't bother you. I received the Ortur 10 watt module this week. I haven't put it on my machine yet because I haven't had the time (building a house keeps me pretty busy right now). I'll let you know what I think about it when I get it going.",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "watched several of you videos, but not one on engraving acrylic. I know you have to have something underneath the acrylic so the lazer does not just pass through.  My question is some acrylic blanks have colored protective coverings, some blue heavy plastic and some a brown cardboard looking color. If you just remove one side of the of the covering are those backing colors solid enough to keep the lazer from passing through?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "I’m looking to purchase the Xtool D1 for my small business but is it the best choice? Could it be possible for you to rate/compare different lasers and their capabilities?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "First thank you very much for the great review.I am planning on buying in the future another laser.Right now i have a diode 20watt laser from fox alien.The laser is good for learning how to engrave and do some cutting also even when it is just possible with multiple passes. My question to you is now: What would you recommend to buy next a Co2 laser or most powerful diode laser for creating my own Model kits and maybe sell those in the future.",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "\"Acetone dries very fast because of the alcohol content\"\n\n\n\n\n\n\n\nbruh",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Do you know why this can engrave wood but the o tech can’t aren’t they both fiber lasers\n\nAny suggestions on em laser vs omtech?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Question! Could you use the large rollers to engrave a cylinder shape? 'Torches' etc??",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I am a cnc laser machine setter and this video is very informative well done 👍👍",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "What's the largest diameter you can engrave with the rotary please?",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "Thx, great review! Small question, ehat about the 10mm pliwood cutting clame? Any truth to that?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Sorry your review is sponsored. you praise it very much but do not show whether the claims of the module are true. They claim that one can cut aluminum. Too bad you haven't refuted these exaggerated and false claims. That's why I don't think your review is fair in advance. If you really make a review, really test it. Now you're just promoting your heavily sponsored \"review\". You talk a lot but show little.",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Mr. I really need portable laser that can engrave on silver and gold and iron for small business,, So what's your suggestion ?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Can anyone Donate me this machine no need Expensive one..just want a cheaper for running my own buisness",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Dear Youtube, Please do something with paid product reviews. Its clear this guy just wants stuff. Im going to start making videos for youtubers and how a review should be done. If i was looking to buy this id pass. He gave more stats the wiki show us real life examples and the thickest wood it cuts.",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Can anyone donate me this laser machine..i want make my own buisness but i have financial problems",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "the buttons really looks like the atomstack machines... ;) just a question, it dosn't work on wood??",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I can find a lot off reviews but not for cutting veneer. What i no is better high power and high speed. Others the adge are brun and discolored. The price for a CO laser is high or a bath chinise laser of issuesl. Now i can bay a 10 watt but i find a 20 is better and most of the time you used lower power that is better fot a longer life off the laser unit. What are doing? Oke it is a lot of money. Thanks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "0,08x0,1 is not bad my CO2 is 0,1x0,1mmm with a 2inch lens",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "The problem with this that 20W will make a \"LOT OF SMOKE\" so some kind of box or strong smoke suction is surely needed. Also a honey comb grid and a 40x40cm not smaller. And you still cannot cut acryl. And the last and the biggest problem is \"PRICE\" these multi diode heads are NOT CHEAP\" not at all they are almost there what the CO2 cost.... This one is over a $1000 so there will might be 8 diode version but that will be surely at the cheapest CO2 price territorry. Yah and no ruida controller... (which is great)",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Good video however disappointed that the \"offer\" to download the test file has expired.  Video is two days old and the offer expired? I just received a email from you saying it was the test file click the button below to download but no button???",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "what's the average life span of a laser diode when its running only at half power?  Does it compare with the lifespan of a CO2 laser?",
    "likes": 5,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "On the test boards the X7 test board is labeled 5mm verses 3mm on the X20, is that just a typo?",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Great review thanks, I’m in the uk and looking for my first laser, hoping to go straight in at a 20watt one, really difficult to decide when unable to get hands on so your reviews are of great value\n. Does the atomstack have metal rollers etc like the Xtool or is that part of the quality difference between the two?\nAlso does the 20w head weigh much more than the 10w, just thinking about wear and tear or stability of the head at speed etc?\nProbably going to boil down to one of these two for me",
    "likes": 5,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Great video... thanks for some great information. LOL at 9:18 your laser is loosing a screw.....",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "That was really well-explained mate but I was just wondering if you have a videos on actually sketching a 3d image in Fusion. Cheers",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "That's pretty slick, Brandon.  Hadn't heard of that tech yet, thanks for sharing",
    "likes": 3,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I love U 4 this video....I just knew 8 wanted a laser q your help I'm sooooooooo much closer 2 a choice!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Nice! looks like the type of laser used to remove rust. Do you think this can do the same?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Those lightburn cameras are just overpriced webcams, there is nothing special in them.. expect the price is 5x of what they cost in aliexpress.",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Does anyone know if you can use the same extension kit the A5 uses on the X20?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "This is the same guy that's in (or was in) X-Carve videos. 🤔",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Really appreciate all your info… do you think the Atomstack 20W will be better then xTool D1 20W?",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I reached out to Xtool customer support for a D1 & accessories since I wanted to figure out if I need to pay import duty & VAT. \n\nThey don't seem to be serious about EU law. No clarity on where they ship from. As an EU citizen, I have the right to know. \n\nAs per EU Standard, the seller needs to tell the customer where its dispatched when placing an order, VAT, etc. If I ask about VAT, the Xtool customer support personnel is giving an inclusive response.  What I understood is partly they want to ship from the EU & partly from outside the EU. \n\nThere is a tax obligation, depending on where they fulfill from. This needs to be clear when placing the order, if they ship from the EU, they pay VAT in one of the EU countries where you ship from. Otherwise, it's an export order, either they pay if you have IOSS registration or I need to pay on import extra cost to me. \n\nYou are mixing up, and dogging after the initial response.  Maybe Xtool is good, but not possible to buy from with in EU.  After a week of chatting with them, now I am looking into some other brand.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Flip the head 180 degrees. secure base to underside of cupboard. Put xy bed on counter and seriously increase engraving area.",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Great video. Love incremental improvements. Progress baby!\n Mahalo for sharing! 🙂",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "would you like to test the mr carve m1 laser engraving machine",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Well done and well said I appreciate you sticking to the facts and keeping things unbiased.",
    "likes": 5,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I also noticed Ortur/Aufero have just come out with a 10W dual laser module with air assist, do you plan to review that one? By the way, this channel is an invaluable resource for me as I’m interested in getting into lasers and it’s good to see what options there are.",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Good review 👍. Can I do a video where u exchange the x7 laser with the 20 watt one and run it or is it just plug and play onto the x7.",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "All over their website it says it can cut .05mm stainless... that's only about .002\" of an inch?  Do they really mean .5mm stainless?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Thanks for the review.  I am really waiting for the XTool review of their 20w module.  I am leaning with the XTool with all the add ones for my start up business.  I really like to buy a AP Lazer but the price is a big factor.  Thats why I am looking at Diode lasers.",
    "likes": 6,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "I recently placed an order for one of these exact units, so I’m pleased to see it seems I made the right decision. Any “gotcha”s in the setup or running that you found? There isn’t a lot of info on this unit around as it’s so new!",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Are the Atomstack or Xtool 20W Lasers also usable with a DIY laser engraver? Or doe they have proprietary connectors etc.? \nI have a big cnc gantry which i use for plasma cutting and a 20W diode laser would definitely be a great addition to it.",
    "likes": 5,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Thanks for the review. Good info. Maybe say \"actually\" a bit less so that it is easier to listen to?",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Will you be looking at the new Xtool 20w module for the D1??",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "CO2 half the price and 40 watt? What is the life of the module at full power?",
    "likes": 1,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Download the test files I use on all my lasers here: https://pages.makeorbreakshop.com/laser-test-file",
    "likes": 2,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Review the Wabeco Lathe D4000 it's worse crap then the Snapmaker",
    "likes": 0,
    "video": "Is this feature worth $2400?  The Snapmaker 2.0 Ro"
  },
  {
    "text": "Have you tested the laserbot engraver from makeblock mine just gave up, I'm now after one just as good but with a stronger laser that will cut 3mm ply",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Great review! I am assuming it could mill HDPE or UHMW?",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Would've been awes without that dumb goose constantly in the way.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "This video taught me more about diode lasers than the one he was “reviewing”.",
    "likes": 2,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "As a newbie I’m debating between this and the glow forge",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Do you think it makes more sense to have a high power diode and one of the cheaper fiber lasers or one of the new MOPA lasers?  I am building a maker space for myself and my Scout troop.  Also the High School plans to come see my maker space after I get it up and running, hoping to use mine as an example of what they can do at the school.  If you know any of your sponsors or companies that would like to help me my troop is located in Northern Arkansas troop 639.",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "is there a way to add a camera like the Glowforge so i can place the lazer on the item perfectly without mathematical plot points?",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro "
  },
  {
    "text": "I'd like to see you look at comgrow's congo z1 10w. It's pretty budget oriented( 300-350 typically)",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Interested in the physics and deeper dive! Love your videos!",
    "likes": 2,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I dont think you know how sangerious that was! At a minimum use a zero clearance blade insert. I know it is dangerious from personal experience. If the wedge falls between the blade and opening, well, just imagine putting a wedge there.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "Yup, lightburn is really a good investment. Very nice review!",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Where can i see a comparison between the results of all the lasers?",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Question:  I already have a cnc machine that i use for making aluminium modular panels, I am looking at getting a laser for marking the adonised panels with text and legend markings. Is it possible to see one of these lasers do marking on adonised panels, also which do you recommend? I have looked at the atomstack x20 pro 130w and have watched the video on this one also. I am a little torn for which one to invest in, also then is getting the laser at the right origin X/Y point. Could you possibly do a little tutorial info on this?  thanks again for another great video!!",
    "likes": 1,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I love my laser! Yours looks darker than mine though. Mine has a blue tint to the coating. Have you heard of color variations from XTool?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "he wants your email address for the test file dont do it dude not cool put it on google drive or github etc dont assk for emaill addresses",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Hi! I wanted to download the file, but unfortunately it doesn't work. I press download but nothing happens.",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Light burn for Fiber comes out on 6/30!!!!!!  And, its a free upgrade for current license holders!",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "That is such a cool laser setup.  We have 50 watt OmTech like you showed in the video.  This would be a great portable laser.  I’m always worried that we are going to kink the fiber from the head on our current one.",
    "likes": 1,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Since this laser creates an angle between the surface being cut and the beam output. Does it CUT through 3/8 thick material at a slight angle since the laser beam is NOT CUTTING from Directly above at a perfect right angle to the surface being cut.  I would like to make a whole bunch of wood puzzles and I do NOT want there to be any angles of any sort on the pieces. I want the pieces to be truely Square to the surface. So since the laser is NOT MOVED directly above I would guess that the laser is always cutting at some varying angle to the surface of material being cut which for my uses makes it a worthless device for me to have.    Thank you for your time.",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "I want one of these so badly! But I just can't afford dropping $3,000 to $5,000 on something I would just be using for fun/hobby use.",
    "likes": 4,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  },
  {
    "text": "Good day Nick ! Just un boxed the honeycomb table (which I purchased through your link as with the air assist) ! Funny thing is that the side rulers are in Imperial (inches) but everything else is based on MM . Also my air assist only came with one nozzle ...But mine did come with a switch . To solve the issue with all the extra hose as you pointed out I was able to add a small shelf above the D1 and added a loose fitting wire tie around it and the wire harness so they travel together , no issues so far. Time for a clink and install table . as always thanks for all your videos and help ! Keep up the informative and entertaining stuff ! Cheers !!       John in Florida    A.K.A.  Fla Dude  🙂✌",
    "likes": 1,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgr"
  },
  {
    "text": "I will add this to my list for future purcahse and have an eye out for other MOPA Laser Engravers",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Sm"
  }
]