[
  {
    "text": "The progress light should be a progress bar. At one of my jobs the 3D printer had that so from across the room without even walking up to it. You knew about how much time was left.",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "The regular OMTech Polar as well as the Polar Plus both have a DSP controller. Just because there is no screen on the Polar does not mean that it’s G-code. The controller is a Ruida 6442S. A lot of people, including me, are just adding a controller panel to their Polar to have the screen and controls. The video a bit misleading. I hate my Polar and want a OneLaser but fair is fair.",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Thanks for your great video!\nMy question is, can you do cuts with a conveyor add on? Like if I had a 4 foot long piece of wood, can I cut coasters along its length as it passes through automatically?",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Great video been waiting on this 1 I’m brand new to lasers Brandon I’m interested in buying a desktop like right now but would like to be able to get clean results on glass with no treatment as well as other products I’m stuck on xtool because of there software I’m wondering if I go with a better machine like thunder or One laser will I struggle trying to learn light burn any suggestions?!",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I read that the RF tube in one of the demo videos was actually a 30w. Could you verify if these will be a true 38w? Thanks",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I would like to buy one but I live in Germany and unfortunately the support said that they will not send the laser to Europe for the time being.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I know most won’t find it a big deal, but as a designer I can’t help but cringe hard at the terrible kerning of their logo. Seeing the uneven gap between the LA and AS in the logo every time I look at my machine would drive me nuts. 😅 Someone in the know please tell me they did this intentionally for some reason I absolutely do not understand?!",
    "likes": 8,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Is it stepmotors or DC motors?\nSize of motors... alot of these questions come to mind if it´s going for 3G... if it´s a cheaper stepmotor the X motor will brake sooner or later depending of the weight of the sled.\n\nI looks decent enough, wonder how i would go head to head with a similiar GCC laserpro?\nWould have been nice if you showed a little bit under the hood of it,  the laser may look cool but it´s the components that counts!",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Don’t forget you have to pay sales tax with onelaser also. That puts you only about $300 cheaper than the bolt. Did you find any issues not having the beam expander on the xrf?",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Excellent review! \n\nI've already got my “touchdown ticket” for the Hydra series after an hour-long phone conversation with them. It was wonderful to gain so much insight about this company and their team, which alleviated my skepticism about them; very professional and friendly.\n\nI hope the Hydra review is coming up soon; if it's good, I'll proceed with the payment.",
    "likes": 5,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Thank you for this!\nI’m trying to decide between XTool or this new One Laser (although the thunder bolt seems good too!)\n\nMy application is for sports award medals (with ribbons to wear) using round 2” surface. I can’t seem to find good documentation of similar application throughout my research.\nCan One Laser handle this material?",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Great review of the features and options... I'm always mentally debating over the RF vs Tube version of these 'desktop' lasers...I have a F1 Ultra already and really been waiting for updates on the OneLaser products before I decide what large format laser I want to get.",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "might wanna add some captions to clarify air assist vs exhaust fan.",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Thank you! Been VERY excited to hear your thoughts!",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "@11:00 The thunder bolt ABSOLUTELY has a removable lens... it's one of their main features. Not ONLY is it removable, but it changes its placement, so that your auto-focus/focal distance doesn't change. \n\nFor $700, you're MUCH better off buying the Thunder, specifically due to their history and customer service. I wouldn't trust a brand new no-name company with that chunk of money or support, as things with these lasers can definitely go wrong/need replacement parts.\n\nWhy buy from a company thats trying to trim/cheapen the item, when you can literally buy from their supplier? Its like buying a knockoff.",
    "likes": 2,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Been waiting for this review! Thanks for posting it!",
    "likes": 4,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "Would love to know what questions you've got about OneLaser!  If you pick one up use code \"makeorbreak\" to help support the channel.",
    "likes": 6,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "What's the best laser to cut though rock and concrete?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Where is the phecda in here ? It’s just so much better that the 20w garbage of your video and way less expensive",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Great video.  What settings did you use on your laser for the veneer portion of the engrave?  Thank you!",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I once used a Mazak Optiplex 4020 Fiber III laser to engrave the image with Vader in the middle on stainless steel. I was the lead laser operator at the job at the time lol. For the record those are like a million dollar laser. It engraved insanely fast. Like a deep engraving in 10 minutes or less for a pretty decent size.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Great Video and Product.... Just a pity that Wecreat are rubbish with email answers or communication........ More than 2 weeks and guess what, Still no replies to my emails to marketing etc. Looks like I'll be buying an xtool laser instead. At least they answered my emails etc. Looks like I'll not be advertising Wecreat at the next commercial fair in France on the 29, 30 and 1st December and then the Christmas markets for the next 5 weeks.",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "definately like the detailed step-by-step approach.  You got the correct level of explaining LightBurn.  I hate the videos that treat experienced LightBurn users as if they were just beginners.",
    "likes": 5,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "What watt c02 would you need to cut thicker material?",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "Good format as an older person I have an attention span greater than that of a gnat! Keep up the good work.",
    "likes": 4,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Where did you get the map of Middle Earth? I can't find anything that's suitable for engraving.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Nice job! This will be a great comparison piece to do on the Onelaser.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Very nice. Never used the Center of the wood as origin. Saves a lot of framing time. Would you make a cutting board this way?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Great video.\nI have an application that involves cutting plastic about .080” (2mm) thick.\nThe plastic is not flat, but has a contour.\nWhat would you recommend?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I want to get a laser to engrave on fleece jackets mainly. Maybe on normal cotton Shirts and sweaters too. Does maybe someone know if this is the right tool? And if so, wich laser modul?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I want to make custom tote bags, tshirts, stickers, keychains, posters, the like - would this be a good machine for all of that, or would you recommend a different one?",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Is the XRF really using a 38W RF source, the below email from the manufacturer kind of says otherwise.\r\n\r\nThanks for your inquiry. This is Michelle from SPT Laser. I am sorry that I don't know this ONE LASER company. \r\nIf they are telling you they are using our RF, it is possible to be true.\r\n\r\nAs for the 38w, I think it is 30w, sometimes the machine supplier keeps telling customer about the Max. output of the laser. But we normally tell customer the rated power.\r\n\r\nMichelle Wang - Sales Manager\r\nDongguan SPT Laser Technology Co,.Ltd.",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Nova series can do 1000 dpi with the compound lens system, you dont see much improovement with 1000dpi on wood materials,  as grain does not support the detail available, odin can now do 2500mm/second",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Great video sets.  Amazing the amount of information you provide.  Thanks!  I do have a specific question... I want to \"engrave\" aluminum, not as you mentioned 'etch'.  The aluminum will be engraved with characters for displaying outside to identify plants in a community garden.  What would be the best type of laser?  Based on what I have learned from the videos, I would assume either CO2 or Fiber.  My budget is between $1000 and $2500.  Thanks in advance.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What's the best bang for your buck when it comes to the latest mopa lasers?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Gosh this seems like such a damn hassle to do this. Im trying to make a box with a mesh in it but my computer keeps taking forever to load it. Im skipping the facing and going straight to roughing but for some reason it does not cut down to the bottom height im giving it and is also leaving out some of the meshes I have selected to machine.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "1:42 I don't have preloaded materials. It's just blank. I recently just got an S1, I am new to the whole laser thing. Just got the XCS downloaded, did a few material test. How do you get the preloaded materials?\nEdited: 3:45 got it! Thank you for this! More power to you!",
    "likes": 0,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "DAMN, i haven't thought about using aluminium backing for this kind of thing",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "do you share what speed/power settings can/should be for different projects on diff woods?",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Very cool man!  Would love to see more of this style video mixed in!",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "We heard directly from a user that Glowforge charges a monthly fee for their software and you can't use it without? Any Glowforge users that can confirm this?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Sangat berbahaya jika melewati jalur pesawat. Tapi masaalah seperti itu tentunya sudah dipikirkan secara matang sebelum melakukan eksprimen",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "To be clear, when using lasermapmaker, they are also using opensource map data called OpenStreetMaps",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Lang verhaal. Maar alle voorbeelden in de video zijn van amateuristische kwaliteit. Een amateur plukt plaatjes van internet net als jij. Een pro ontwerpt zijn eigen dingen en levert veel betere graveringen.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "yes keep making more long form videos...this is the best one i have seen on inlays...thank you",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I see why we’re lacking sponsors. I highly suggest researching the art before judging and actually putting criteria on it. This is the first n my many years of YouTube I’ve seen that is just ridiculous and desperate. I gotta go judge some YouTubers.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "If you're getting charred edges, you're using too much power and/or too slow off speed.",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "We just did the vector outline trick while laser engraving on leather and it turned out awesome.  Takes some experimentation, but once everything is dialed in it really makes things pop.  Thanks!",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I can think of a theoretical hack to improve the print quality and lower the price of ink:\nThe cartridge used is the same as the HP 62, and there are two of these, the CMY and the black. If you open the image to be printed in Photoshop and convert it to CMYK and save one copy with only the K channel as grayscale and the other as CMYK but leaving the black channel empty, then you print the color first and then the black one, you will have a real CMYK print. And on the other hand, there are cheaper compatible cartridges for the HP 62 cartridges.\nIt would be a good video to make.",
    "likes": 11,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Great video,  I just watched the comparison between the OneLaser X Series and the P2, and it completely outshines XTOOL. Truly impressive!  https://www.youtube.com/watch?v=C2FDjGpLEDA&t=3s",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Hmmm, i wonder if my 5 watt diode would be able to handle this",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Love it ❤ I actually was wondering about the mirroring but then saw it in the comments. Made me feel not that stupid😊😂",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I would like to purchase a budget friendly,  user-friendly software laser that can cut metal, wood,acrylic, and leather but also can engrave.  This was a great video, and I'm somewhat a bit overwhelmed because you provide great info, but I'm new to this and would like to purchase a good quality laser that won't break the bank. Any advice would be appreciated.",
    "likes": 16,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Great video. I like the step by step and how you drop in small tips along the way.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Sweet video man! I didn’t know you could do inlays with a laser!! I just got my x tool P2 set up so I’m looking forward to trying that one day.",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "your advertising the companies that give you money\nyou could get AMAZING laser.engravers for much more cheaper in aliexpress. or other sites like that.\nthats my advice",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "What changes would I need to do on the xtool creative space to make this?",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Totally awesome, have done some veneering by hand but now that i have my laser i have to try this.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Yes I like this very much, Can this be made with M1 10W?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Definitely like this style of video especially on the laser. I have a Thunder 35 100watt I use to cut acrylic. It's a shame to leave it setting 90% of the time. I'm good with a CNC not so good with the laser. I could use some help with the co2 laser.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "This is a really neat idea.   You explained it very well.   I need to buy some veneer and a roller.  Thanks!",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Use a press when you glue your inlay. That’s what the pros do for cnc inlays. It just looks so good. If you dent any wood add water and heat with iron to make it swell, then when dry do your sanding. Hydraulic press is best. Cool video btw.",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Been looking for this exact tutorial for a while now! Thank you. Could you maybe walk through how to do this in xtool creative space for those of using that on our P2 lasers?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Like other people commenting, I was interested and got as far as the subscription screen, but then I checked out.  A \"free trial\" that requires a credit card is highly suspect.",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "can't wait to see your image engraving video, definitely something I've struggled with!",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Hey 👋 great video. I was wondering how come Sculpfun never gets mentioned in your videos? In my environment those seem pretty common, and I think it's kinda cool that you can get a infrared module for the open gantry type Laser. \n\nIn any case, I'm really appreciating the info you put together here, since I'm in the market for a new diod laser this black Friday. Thanks and keep on going 😊",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I own a scaffolding rental company.  All of it is Aluminum.  I'd like to engrave my logo & a barcode if possible, probably about 2 x 3 inches. We have long planks with large flat areas & 3\" C channel to engrave on.  Can you steer me towards a portable machine or at least one where I can clamp the engraver \n to?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "OUTSTANDING video!  Great info and you get right to the point without a lot of verbal diarrhea.  Clear explanation, fantastic examples, super useful content in the text description section.  Please keep up the great work!",
    "likes": 5,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Update....any ETA on when the machine is coming yet so we can see this much anticipated demo ha ha?!?",
    "likes": 5,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I would be 100% into this if they used a refillable INK tank module instead of what they have. Being able to use sublimation INK would have been a game changer.",
    "likes": 37,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I absolutely love this type of video and beg you to do more of them. However the problem with these style of videos is where a key piece of explanation is not covered. So when I get halfway through doing what you showed, I get stuck. How do you line up the taped up image when gluing it down? Do you use some sort of registration marks or are you just eyeballing it? I have a hard time imagining that I am going to be able to line up something even half that complex and get every little part in the right spot just by eyeballing it. Please tell me you had some sort of trick to get over this that was not in the video?",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "this was a perfect length video. i’m inspired gonna try this out tonight",
    "likes": 2,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Really fantastic content will totally help with my own project... love to see more how to...s",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "and now the K40 just comes with all of those upgrades from the start... I even got the water chiller for 500.  I am very interested in the camera and camera mount that you mentioned... Also lighting... the lighting on my K40 is absolutely horrible.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "how can you peferctly along the veneer to the piece of wood? It seems impossible to have all the details ... but you did. How. (Great video)",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "*Great Video, Please make more of this Detailed Tutorial Videos!!* 👍🏻\n*These Tutorial Video Helps a lot!*",
    "likes": 3,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Really nice!\nWhere did you find the tiger and star wars logo?",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I need to try this! I only have a Snapmaker with a 40W laser, so maybe I won't be able to get it to work, but I think it might!",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Love this type of video! Exactly what I was looking for for reverse inlay. Subscribed!",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "So why isn't the reflection off the aluminum  ruining your laser.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Wow, are you on drugs, or do you move in hyperspeed normally! Hard to follow along. Sorry.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "wow I loved it, this is a great idea, although it could only be done with the Trotec Rubi software, great I hope you make many more, could you put the laser parameters in a pdf, Can this be done with all laser machines?",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "This is the style of video I think a lot of us look for.\nMore of a how to step by step without the assumption that we already somewhat know how to do this.\n\nPlease keep ‘em coming!!!",
    "likes": 59,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "OK, this was cool. I, for one, would like to see more of these. Thank you!",
    "likes": 5,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "This was very informative, and \"Yes\" more of this style of tutorial please.",
    "likes": 3,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Actual making tutorials like this one are always invaluable. I would love to see more of these. Thank you so much.",
    "likes": 3,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I don't see a link to the file as stated. Am I missing something? Great video, keep it up.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Maybe a darker veneer on a lighter wood would have a little more contrast. That said, I think it looks good. Job well done.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "That looks amazing! Haven't got a laser yet, but I appreciate your content. Thank you.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I may have missed this but, I assume you did this, did you spread the glue over the whole engraving before adding the inlay?",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I got a prescription for cowbell! I think you see where I’m going with this. More please!",
    "likes": 2,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I’ve done a few of these. I saw the video from Troec also. Do you adjust the inlay for the kerf? I’ve done 1/2 the kerf for a tighter fit. Love the process.",
    "likes": 3,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Would like to see this done on the new 1one laser. I have one on order to do this exact same thing and would love to know if it actually works and what settings to use.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I definately appreciate a longer video to explain things in detail😅",
    "likes": 7,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Great video.. Love the way you explained what you were doing .. Keep up the good work...",
    "likes": 3,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Good idea. I'm going to head over to my local HVAC guy and see if I can get a sample of the tape before I spend the money for an entire roll. About how deep is your inlay?  I'll be using a 10/30W diode laser and will need to do a materials test to get the correct depth.",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Great tutorial and yes more videos like this one are great 👍🏻",
    "likes": 1,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "This was great, and yes more of this style of tutorial please",
    "likes": 17,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I totally missed putting in the part about mirroring the veneer!  Make sure and do that so they fit, sorry!",
    "likes": 53,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Very informative I like it and would like more like this",
    "likes": 3,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Did you not have to mirror the veneer layer in Lightburn? Both layers are facing the same direction in lightburn, but the veneer layer was reversed on the machine, which allowed you to glue  the bookmatched layers together.",
    "likes": 4,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I think you've missed the part about mirroring the Veneer layer",
    "likes": 4,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I saw that same Trotec video a couple of weeks ago myself and very much had the same reaction, their video's started popping up in my feed recently, handy really seeing as we've got a Trotec machine at work.",
    "likes": 3,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Hello!  Just found your channel and love this video. Could you please answer a question I have.  My wife and I want to build miniature houses (7\" buy 6\") with a wood cutting machine the wood would be 1/8\" thick. We also want the machine to engrave beautiful detailed 2 dimensional  people for the houses.  What is the best machine in your opinion that can do this?   We need it to be able to upload images we have from our desktop.  We are new to this technology so it has to be simple to understand as well.  If there is no such machine please let us know regardless.  Hoping we can get your expert opinion.  Thank you so much for your time!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Your code for 1onelaser doesn’t provide any discounts. Was going to order it, but wanted to see if there was a discount code that actually worked first",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Dude - that veneer inlay technique is next level. Cool format for a video too.",
    "likes": 21,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Trotech put out some amazing tips.  That inlay process is really cool.     Also, I've had success with using Powder Coat Paint and curing it with the laser to fill engraves.   Deep engrave, fill with powdered paint, engrave again (different power settings) and you've got a perfectly detailed paint job.",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Way too fast for a rank beginner. From the start, couldn't follow which dropdown/key, etc you had pushed to get to the next thing, so I was lost almost immediately and turned it off. Seems like there needs to be a super slow (sorry-boring for you) instructional video before this one! Thanks!",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Hi, congratulations for the video. I would like your advice! My son has an Atomstack x20pro, he would like to buy a more professional laser. You are a professional which do you recommend between xtools1 and Omntech 70w? Thanks!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Sir, I do not turn my air off when I am engraving, it causes smoke build up on my lens and that will create a hot spot and ruin the lens. Instead I use a air value that bypasses  the regular shut off, I use in lightburn  ( and turn off the air when engraving  that and  extra valve allows a small amount of air ( however I much I wish) to pass through the head and keep the lens clear. I got mine at cloudray. (this is a stand feature on thunder lasers. ( I dont have a thunder) if you google you will see it (Cloudray Ultimate Air Assist Set) this was a good video thank you.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I just need a 4MW pulse laser which is water proof and compatible with a Shark harness.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "That inlay trick was very cool. Inlays are one of the main reasons I wish I had a CNC. It would be very cool to pull off an inlay with my diode laser and do much more intricate designs that I think a CNC can do.",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Great video with some good tips and final bonus great idea. Lets hope the Youtube God rewards you so you can make more of these and less laser reviews.",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "*Great Video, All the Tips are very useful!* 🌟\n*I'm getting xtool P2S in Next week so probably going to watch your videos again!* 👍🏻\n*You will hit 100k very soon, Good Luck* 👍🏻",
    "likes": 3,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Hi thank you for this. Very useful.  \n\nDid you include the links to the veneer and the metal tape?  😢",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Seharusnya chanel chanel seperti ini lah yang banyak ditonton,\nBukan chanel chanel sampah yang tidak jelas",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "I bought a Glowforge (40w) during the kickstarter, and while I don't regret buying it, I certainly wouldn't buy it again if it broke today.",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "You forgot to add a source for the aluminum/adhesive backed tape and the veneer assortment. Thanks",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "The editing jumping around is so distracting. Like, you jump around in arm and head locations almost constantly... do another take ibstead of 8 cuts in less than 7 seconds",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Thanks for sharing, what kind of laser printer would you recommend and wattage? I’m asking as I would like to try doing something like this.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Great video really like the inlay projects.  I use Gorilla tape to remove/weed the masking tape off the engraving.  You waste tape but it saves a ton of time.",
    "likes": 4,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Very clever way of using veneer with a laser. 👍🏽 I do this with my CNC but the level of detail you can get from a laser is very impressive. I will probably try this on my XTOOL S1 this weekend.",
    "likes": 3,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I have to say, I appreciate every bit of advice that you give. Even a quick hit help video like this is incredibly insightful!\nOwn a small wood and craft business and have been looking deeply into laser machines, with this channel being #1 for honest resources. Whenever we save up enough, will definitely be using an affiliate link of yours.\nAlmost to 100k!!",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Awesome thanks. I'm sure I'll watch this again. Loads of good information for a relative newbie 😊",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "That looks great.. I love the veneer idea.... Thanks!!",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Great job like always! The tip about engrave against the grain was genius, that is going to help a lot!",
    "likes": 2,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I don't know why you haven't hit 100,000 because, I've always been interested and now I really want one! I want a laser engraver❤😂\nIt would be awesome if I was the man that put you over 100,000! Good luck with your channel! I will be glued to your channel whenever I get a chance and I will spread the word!! You're doing awesome.",
    "likes": 1,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Looking good! Can't wait to see the onelaser video.",
    "likes": 3,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "tu parles trop vite du coup on s'en va et on ne va pas au bout, bye bye",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "After 3D printing for my wargaming hobby  thinking \"oh why not add a laser cutter for the hobby ,, for unit trays and such\"  opens this video \"yeah you want atleast one of these and are about 1000-1500 dollars\"  ... well never mind i will stick to printing then.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "i literally just need something for glass panels.....",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hello! Thanks for the great videos. \n\nSo, I have a $15k budget and could use some advice!\n\nI want to purchase a couple machines that give me the largest selection of material I can work with. Right now I’m looking at the xTool P2S and F1 Ultra full bundles.\n\nEnclosed machine with filtration along with pass through and rotary capability is a must!\n\nI know there are tons of different companies just like to ask you if you had $15,000 what would you buy for what I am needing? Would it be xtool or a combination of something else! \n\nI’d really appreciate your advice or anybody’s advice thank you!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Great video and great list. The only thing it was missing is Z axis work space and the ability to add a Rotary for glasses and tumblers and such. I know the We creat Vision does but do any other enclosed desktop diode lasers have that?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "the printer add on is shocking bad quality. prints are unusable better prints from a decades old printer",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Not to be confused with the US government’s MK Ultra. 😂",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "First ever tutorial that made me so frustrated that I didn't finish it. Things go way too fast for absolute beginners.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "I love seeing someone who knows their stuff. Good job.",
    "likes": 4,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Halo sir.can you advice where i can repair my xtool f1.or where i can buy the.power.adapter.tq",
    "likes": 0,
    "video": "The xTool F1 Is Actually Pretty Awesome!"
  },
  {
    "text": "Scanning through this...can someone please tell me where in the video the question is answered which is promised in the title: The best one?",
    "likes": 1,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "I'm thinking of an 80w Omtech. I looked at Monport and I couldn't even contact them with the supplied number, so it was a huge red flag when they aren't even available to take a call.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Do you think the Ultra do a good job at laser engraving guns?  From research they say 20 to 50w can do the job.  I am seriously buying one of these and been looking at the bundle of the P2S and the F1 Ultra package.  I currently have 2 D1 pro 20w systems one is set up normally and the other one is set up as the extension.  I think by adding these 2 new lasers would really help in the shop and be able take the Ultra to shows on the weekends and add customization at shows to improve sells.  Like to hear your thoughts and opinions.  Enjoy watching your videos keep up the good work.",
    "likes": 3,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "This is SO informative, thank you :) My husband and I are starting a biz and very much need guidance on the best option.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Dude, you're awesome! Thanks for putting this video out for the community.",
    "likes": 9,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "What would be best for doing slightly curved surfaces in high detail? Typically wood or polymer",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Can the 40 engrave a gun slide or stipple the plastic grips for a pistol?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Love your channel. Such great info for us beginners. Thanks!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Xtool is like apple the way that idiotic people are some how willing to pay insane amounts of money for a product that should be a quarter of the price.  Make it shiny, give it features that only it has because they do not mean anything, produce some fancy marketing material, promote it to people without any common sense, and boom... a whole bunch of incredibly stupid people are pay a fortune on something that could be sold for a fraction of the price and still have a good profit.  \n\nXtool is another example of how lack of education has killed common sense!",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Curious as to why you don't include ComMarker machines?  I've noted there are only a handful of videos about the ComMarker Omni 1 UV laser engraver so far.  Is the company difficult to deal with?  Anyone else have any experiences with them?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Cheap diode laser machine is nice for hobby. Is it.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "i understand the diferences between that 3 tyoes of laser, but co2 its too expensive for me to start whit it, and fiber it like a on trick pony and is not cheap either so i will start whit a diode 20w becouse i have to see if i can make some money whit it befor decide to go up in my investment, nice video!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Is it a good idea to insert a sacrificial black metal liner into the lower tray to protect the tray from being burnt?",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "i really don't want anything to do with tools/machines that tie you into an ecosystem and require their software.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "@makeorbreakshop Its concerning how little information is actually out there on this company or laser. No videos (one 15 second IG reel doesn't count). No products in anyone's hands. No company information that is actually relevant (who are these people? And yes, I get that you imply who they are but why isn't that information elsewhere like on the company's \"about us\" page). Yet the consumer is supposed to believe this company is able to ship this laser within 35 days for those that place an order? Right now it's hard to believe anyone has actually seen this machine work. I'm totally tempted by the specs of the machine, but this amount of information is less than we get with a standard failed Kickstarter campaign. @onelaserhq",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Score, engrave and cut. Looking for a laser that can cut 1” pine.",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "I gave this video a thumbs up, but then saw the lists needs a email... Hence the word \"gave\". What do you want my email for???",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I wonder if this guy realizes that Android has a far bigger market share than Apple does. Apple is primarily only popular as much as it is in the United States than any other country.  So I think he means to compare it to the Android system and not Apple.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "AEON sounds like a LEGITIMATE  quality machine and brand.  I'm not sure why though!  😂",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I was wondering about cutting of thin, printed cotton fabrics or 'fake leather' using any of these lasers?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Buy a CO2 laser cutter and an individual LED laser head Strap the LED laser head to the 'flying' laser gantry - you get both, CO2 and LED if needed.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "For me, S1 belongs on the S Tier because of the things it can do: like the conveyor belt. I mean, which one of these machines can cut and engrave materials up to 3 meters in length. This is perfect for me as an interior designer. For the first time I was able to engrave intricate details on cabinet door panels that is, sometimes, as long as 3 meters.",
    "likes": 2,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "What  another tutor used that made the video much easier to follow was to put a bright yellow highlighter around the cursor so it was easy to follow when you are learning where all the functions are located. Especially as some tutors tend to speak too quickly for newbies. ( I had to slow the playback speed to 75% so my ears could keep up with your speech.) I iearned some good tips from your video. I will watch it again when I have more experience and the tips make more sense to my addled brain.",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "hey man watched your video its great , i m just confused little bit i want to buy an paper laser cutting (techinically colour chart 80 gsm  paper) which one should i prefer like low budget",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Except it’s made in China. I would avoid buying from China at all costs, particularly if there’s any software involved. Remember all the concerns around Huawei? Same thing. The ccp will use any method, any means to spy, the same as it does to its own citizens.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Always super helpful; bought an XTool F1 and love it but already see the need for more power as I do a lot of marking on metal.  If I were to buy a 2nd machine, would you recommend the F1 Ultra or a standalone Fiber Laser?  Thx!",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "First of all, great review and categorization of thoose lasers! However, as a beginner, I feel like some essential information is missing, especially for desktop models. Next year, I plan to start working with small parts, around 1-4 cm thick. I mostly need engraving, and I’d like to work on multiple pieces at once (potentially different sizes but the same height), letting the laser run while I do other tasks. For this, the laser should have the capability to automatically detect the position of the workpieces and center engravings, like texts or QR codes. Otherwise, I would have to manually measure and align each piece to the 0,0 point. For example, if one piece is 50mm wide and another is 52mm wide, and I want a QR code centered, the laser should be able to automatically center it if needed. This is especially important when dealing with multiple pieces lying next to each other. I can't rely on precise X, Y coordinates because the pieces might not always be perfectly aligned, or there could be a 1-2 mm gap between them, which could throw off the centering of the engravings.",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I would love to hear from you on how easy/difficult it is to take the head apart for cleaning or even how much that is required. I have an atomstack and I have had Ortur open gantry machines and even with decent air assist, the head gets pretty crusted after a while and the fan at the top sucks in particulates even with good exhaust. This has, on the Atomstack, caused the fan to seize up if left go too long. Taking the Atomstack apart is tricky and I have had wires snap after long use as they get older (a year of consistent use). So I am wondering how you have fared in this with this machine?",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "What metals will the RF engrave/cut? And, will it engrave on curved materials?",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "What about adding co2, diode, and IR to a large cnc router base, like 5’x9’ or bigger? Like a 6 in 1 or whatever. Besides needing to improve accuracy. What challenges do you foresee? Or do you have hindsight in this area you’d like to share?",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "As always, you answer so many questions I have. I still very interested into a fiber laser, powerful, but with limited budget. Love the F1 Ultra but will like the same power with lower budget ;)",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Awesome video and I appreciate the dicussion being more to the point and less 'fluff' than other video reviewers. I am looking to purchase my first laser as a hobby maker and one critical element I want is to be able to engrave the inside of a ring(stainless, wood, tungsten, ceramic, antler), but I see very few videos on this. Due to the working proximity of the laser module to the material and having to 'tilt' the ring on a rotary, I don't have enough knowledge to choose which ones are compatible with this function. The 2 I have seen have some less desirable reviews from a customer service standpoint.(I would also like it to cut thin wood and engrave various materials, of course) Thank you for any expert advice you may have!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "After years of rebuilding imported laser systems like the Ship of Theseus, I went all in on Epilog and haven't looked back.  Pricey, but reliable workhorses with great output.  Really the number one factor I can't stress enough in business is reliability - especially during busy seasons & short deadline projects.",
    "likes": 5,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Wow those are amazing prices for having support and what not located in the United States",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Great video! I love my Vista. I've made a lot of cool stuff with it so far.",
    "likes": 2,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Can all the lasers you mentioned in the video also do laser cutting?",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Can all the lasers you mentioned in the video also do laser cutting?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I would be interested to know size of the Hydra 7 minus the base; as well as, the stripped weight since I have to bring it up stairs.",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I've been watching your stuff for years and really appreciate your videos! I always stop here first when trying to learn about new and innovative lasers on the market. I have an ambitious project idea I was hoping to get your opinion on.  I'm thinking about building a really large work area diode setup for cutting thin fabrics. These will likely be polyester, nylon, and dyneema fabrics for cutting tent patterns. I will need it to have a 72\" usable width for the work area and probably at least 140\" length or the ability to easily and accurately index the next section of the cut (floor panels will commonly be 108\" long and need straight edge cuts). Due to the crazy size, i'm trying to find a way to make it collapsible, something i could put up and take down easily. Another idea might be to rig it to hang from the garage ceiling and drop down as needed. Hoping to go lightweight and establish rigidity with whatever i set it on for cutting (possibly concrete driveway or lightweight ply base if mounting to ceiling). Lastly, it wouldn't hurt to prioritize speed over accuracy as a cut line within an 1/8\" of the intended cut is plenty accurate (no engraving needed with this setup) Any thoughts on how achievable this would be? Not sure how the belt drive accuracy would be at that scale. Also, if you're aware of a smaller machine designed to index quickly/accurately for large prints that you think could work well in this use case, I'd love to hear about it:). Thanks again and care!",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "The only thing better than having your own laser cutter is having a friend who has a laser cutter.......find a friend who has an Xtool P2 or similar.\n\nFor safety reasons, I will never be anywhere near an open-frame device even if I'm wearing OD6 (or higher) laser goggles. If you have one of these, at least put an enclosure around it. BTW, a pair of laser safety goggles is a lot cheaper than eye surgery, or living the rest of your life with impaired or no vision.\n\nAir-assist. You really need it to reduce the fire hazard, as it squelches flames that try to form while cutting. Remember, a laser cutter works by burning-away material.\n\nSmoke. You dont realize how MUCH smoke gets produced till you do your first cut. Even a few small cuts on thin MDF or plywood will stink-up your entire garage. Which goes back to the first point: You need an enclosure for safety reasons as well as to gather the smoke for your exhaust fan (or air purifier).\n\nCooling. We havn't done any lengthy processing on the P2 yet. It's water-cooled and I've only seen the temp go up 1-2 degrees during usage, even when the laser is running at 100% power. A 55W CO2 laser is around 20% efficient, so you probably have 300 watts coming thru the laser tube. It's going to take awhile for that to heat-up a water tank. But if you're using an air-cooled fiber laser, it's going to heat-up faster even though it's a lot more efficient than CO2. Probably a non-issue for hobby work, because your cutter will pause a few times if it needs to cools-down.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "When you showed the resulting Atlanra laser cut, the interior of the buildings was a rust color. How did that happen?",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Help me. I badly want to cut cake toppers in acrylic but have no money😂. What is the cheapest machine i can buy",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Curiosity question with the xtool s1 and m1 would I  be able to change out different  modules in for example  m1 modules in xtool machine and vise versa I want both but don't have 4,000.00bto throw into machines ect.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I purchase the S1test files and downloaded, it looks nothing like the files you show",
    "likes": 1,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "please fix the title of the video its driving me nuts every time I see it. \"Is a 40W CO2 Laser Cutter Worth?\" is that proper English!",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "What would be the minimum watt  fiber laser to cut brass?  Like, a sealing wax seal?  I guess it would be considered a deep engraving?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The first step really is to decide what you want to cut/engrave and why - business or hobby/ side hustle?  Bear in mind too that not all lasers are Mac compatible or Wifi enabled, which may be important. Size of what you may want to engrave is also very important for cost - do you need a rotary or riser?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Has the laser been delivered yet? I’m interested in getting it but can’t find any video reviewing the actual machine… Only spec sheet reviews. 😢",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I wish Xtool sales reps on the phone actually knew what they are talking about. Instead, you ask them a question, they have to flip through their 3 ring binder of facts to give you an answer. Grrrrrr. This makes me hesitant to buy from them.",
    "likes": 45,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I have found boxes py to be very useful. I can’t make the direct link, but a search on the name works.",
    "likes": 0,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "ooh. OOH. OOOOOOHHHHHH holly eff. I LOVE it - that is a LOT of capabilities in one machine. that burnishing head!? I need to know how many combinations you can do at once and/or if you can get good registration on multiple heads with the same substrate - e.g. I want to drag knife cut, burnish/crease, and print (and laser) on the same piece.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I want to do detailed engraving on  8-9 ounce vegetable tanned leather.   All pieces would be pre-cut and smaller than 7 x 10 inches.  Not a production shop, just 50 or so items per year.  Could you please recommend some lasers that would do the job?",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Can you cut pieces larger than the bed size using the automatic conveyor or is it only for engraving? Thanks",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "How long are they offering their early bird discount?  I'd like to see some actual reviews or videos before committing my money.  \nAlso do they offer a chuck rotary?  Didn't see it on their website.",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "What’s the best option if you need it to be quiet? Also how is the quality of the mills it makes? Did you actually test it on making some real world parts?",
    "likes": 0,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  },
  {
    "text": "Let's be real. If you receive a free machine and expect to keep receiving more updated models from a company, you can't afford to tell what is really wrong with a machine. They might not be paying you, but you get a free machine, which in itself is a type of payment that also should be declared on your tax return as a new asset with a specific value...\nAlso it would be great if you could provide information about the real continuous maintenance on these machine, especially the honbeycomb bed and laser lense, etc...",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "One issue is Etsy. It's a very cutthroat area where you are under selling your products. And eat you up with fees to pay Josh Silverman his salary of $16,577,104 in total compensation.",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "How can a gantry machine move with that big accuracy to apply 4000 DPI?",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Are you able to use a flash drive to upload files at the unit or does it have to be linked via usb port to transfer cutting/ engraving files",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Couple questions:\n\n1. Can I engrave on glass with a 20W laser \n\n2. What base comes in the laser engraver at the base package",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "15:10 I have never seen anyone flood the screen pre-print\nflooding the screen is only needed so that the thin layer of ink that remains after a print, does not dry and clog the screen...",
    "likes": 0,
    "video": "The Easiest Way to Start Screen Printing!"
  },
  {
    "text": "There's one small error on the spreadsheet. Goal/based on profit/human hours (Q7) got copied from the cell above, and therefore has the wrong range (doesn't include the first row of human cost, and DOES include the printer cost). Otherwise, it is going to be very helpful! I'm actually using it in the 3d printing realm, but most of the factors are the same. \n\nOne of the biggest benefits, aside from \"is it worth it to get to that goal\", is \"is it possible to produce enough units in a month with my current equipment\". Love it!",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "I would be very interested in seeing a video comparing RF vs Glass tube power like you mentioned. Thunder Laser markets the Bolt's 30w RF tube as being equivalent to a 60w glass tube, but when you look at the cut settings they publish, they say their 30w RF tube can cut through 3mm birch ply at 10mm/s at 90% power, while the 60w glass tube can do 45mm/s at 90% power. That doesn't sound very equivalent.",
    "likes": 2,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Can it cut metal ? say 3-5 mm thickness of stainless steel ?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Pardon me for my ignorance but what do you mean by \"coating needed\" on the laser engraving for stainless steel? basically, I would like to start making custom-engraved metallic business cards from home and I don't know where to start.... hope you could give me a bit of advice, I'm loving your channel!",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Great and informative video...  One option you didn't cover with regard to desktop machines is the CO2 machines sourced from China, typically available on eBay.  I went this route about 4yrs ago.  Purchased a 12\" x 20\", 50W sealed tube CO2 machine for about $1200.  It has many of the features of the more expensive domestically sourced (US made) machines.  It's not quite as refined, but it does the job just fine.   Worked for 30yrs in the industrial laser field and this machine, even though it's a lot cheaper, is every bit a \"real\" machine as the more expensive ones.  Though I don't use it for \"production work\", it could...  That said, not sure how long it'll last for with that kind of use, but for hobby users like me, it's the perfect low cost, nearly full featured machine.   The only thing mine doesn't have is a chiller and auto focus.  I use a large bin full of DI water that can be cooled by tossing in a few frozen bottles of bottled water.  Though it doesn't have auto focus, it does have a manual Z-axis table feature and I use a dial indicator to set the height based off the material thickness used.\n\nAgain...  Great and very informative video.  Continue to be amazed at the scope and quantity of equipment available to hobbyists these days!",
    "likes": 36,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The simple reason I would never ever consider a glow forge is because the software doesn’t run 100% locally I mean what kind of bullshit is that that you need an Internet connection depend on their servers to run it I mean that is so beyond messed up.",
    "likes": 16,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi thanks for the video. Do you have recommendation about laser engraver to cut an A5 magnet paper (about 0.4mm thickness) ?\nsomething pretty compact, safe and cost effective.....",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Oh man..boys and their toys. Im a hobby tinkerer and love tools and learning how to use them..but its getting expensive...it all started with an ender 3 and learninh 3d modeling..then the printer had to be bigger, then it needed an enclosure.. \"You can print with uv epoxy??\"..gotta try that..2 resin printers later i heard of a toy named cutting plotter..must try and make vinyl stickers and shirts..oh..there is a metal engraving module for it? An emgodding and debossinh head? Gotta have. Then god knows why i wanted to learn how to sew with a machine..so i bought one and learned..computer sewing machine is a thing? Welp..lets see..and take the embroider machine aswell while at it. Last month i got me a small cnc mill and next week it get this X20 (half the prize yay). My place looks like a sweatshop that produces 1$ ali express decor 😂",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "You overranked xTool for support. Thier support is horrible, they buy off bad reviews on third party groups and sites, and they heavily moderate reviews and issues on thier official sites and groups.",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "appreciate the videos, was curious if you are familiar or have heard from others on ( HT-460 40W/60W RFmetal tube CO2 gantry laser ) from Haotianlaser. any info would be appreciated, currently in market for co2",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Great video but it’s more for an advanced user as you go so quickly and half the things we still trying to learn",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "They need to make one thats in between them to in size but has the power as the ultra",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Can you make video review for SweetShape 3 in 1 laser cutter machine?",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "\"Why is xTool so popular?\"  It might have something to do with the fact that they've sent free lasers to just about anybody with a YouTube channel. 😂",
    "likes": 19,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I am sort of thinking about this, or their hydra, mostly because of bedsize",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "hey man, i am curuous what are your thoughts on the new kickstarter project Tyvok Spider S1",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I kept my eye on the xtool p2s since mine will be here in a few weeks. I think the riser would help the z axis scoring, but not much else. However, I was happy to see it not vary as much, thanks ANOVA! Good review. Much appreciated.",
    "likes": 2,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Great info for someone new to this. I might be able to purchase a Thunder Nova 51. Any suggestions on what to consider for pricing? Run time and basic condition of the unit?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I think it would be nice if you could include expected maintenance costs, for my laser engraver parts are very difficult to get.",
    "likes": 2,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I have the GlowForge standard 40W.  What a giant piece of shit this machine is along with the miserable online required software.  Have to be online or you won’t work,,, ever.  I’ll never buy anything GlowForge again.",
    "likes": 9,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "How is this for cutting intricate patterns out of brass",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hello do you know if I can put an A20 watt laser head in this body.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "20W is not power!!  lol  for the money its a pile of junk!",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "I learned a lot from this and even if I made every one of these mistakes it’s still better than a table from China",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "what the hell is this crap? why does this adhd afflicted child have a goatee? where is his mother? out buying him another laser to shut him up?",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Really like your video's it been helping with narrowing down what i want to buy for my starting small buisness. been going trough most of your reviews in my search!!",
    "likes": 5,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Oh for fucks sake, i just bought the regular polar!",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "As a Glowforge Pro owner, there are a couple things that you did omit. I have looked at light burn and believe that I could certainly use it. But, for hobbyists and those who are not using their laser printer day in and day out, Glowforge has a remarkably easy to use interface, one that my mother could figure out.\n\nAnd let's not forget, Apple made there reputation based on software interface and ease of use .\n\nBut that said, the detractors are significant and includes several you missed. Important among them is the fact that you have to pay $240 per year just to be able to save your files to the cloud. Because they have you locked in, any file or project you create will disappear within 30 days unless you pay them their ransom. \n\nFurthermore, and this is a very little known issue, there is absolutely no way to save a project from glowforge's cloud to your desktop or any local storage device. This means that if you spend your time setting up the perfect print and go forage, you can forget about saving it unless you are paying their yearly subscription fee. I am so surprised that nobody has mentioned this as I quit paying my yearly subscription fee and lost hundreds of project files. \n\nSimilar to this videos conclusion, I would not recommend this product to anyone at any price.",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I Think You Should Have Figured In Cost Of Accessories / Add-Ons / Upgrades With This Video. \ni.e. Risers (Mentioned) + Rotary (Touched On) + Pass Through + Air Assist + Air Filters + Exhaust + Fire Safety + Ease Of Maintenance = True Overall Cost Of Ownership!",
    "likes": 12,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I am looking forward to what Onelaser shows in a few days.",
    "likes": 8,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "So... The very BEST laser, does not, and may not EVER, exist.  Brilliant.",
    "likes": 13,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "If I could ask one thing, this would be it, when you folks(influencers/Youtubers/content creators in general make these types of Videos - reviews, info on products etc., is that you would include your opinion (or test results)on the maintenance processes, are they the same or is there a brand that has out performed the rest with how little maintenance or even the level of difficulty is between all these difference \"similar\" products.",
    "likes": 3,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Can't get ahold of x tool to save my life... There AI email response system basically gaslights me with empathy, if that makes sense.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Impressive video! All those numbers, the information and the details. Thank you so much. I learned a lot more about lasers today thanks to you.",
    "likes": 7,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I would have given Glowforge a 1 for speed and acceleration. The fact that they won't publish those values is deceptive. I also would have given them a 1 in the software category, as their app is just awful.",
    "likes": 2,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Have you heard of the swiftshape lx30. It's on kickstarter right now and looks interesting, but I'm a little skeptical.",
    "likes": 6,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Xtool support is a 1-2.  Ignore the forums and FB groups when judging support and Xtool is (at best) a 12 hour response time with only online support based on their location.  You started by saying Support shouldn't be ranked on what you can find online then supported them for just that.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I'm very much looking forward to seeing the aeons. I've got a crush on the Mira 7s RF because of its size and prettyness. Thanks for the information on the power of RF lasers relative to glass tubes. Saves me some money, should I ever fulfill a very expensive hobby dream.\nAlso: Amazing list of lasers you made. I browsed around a while ago and looked them up based on your information - very helpful.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Hi did you already get your Hands on the Monport Onyx 55W CO2 Laser? Is it any good?\nIf no, what didnt you like about it?\n\nThanks!",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Thunder Bolt is best bang for buck by far, especially for an RF. Should be #1.",
    "likes": 4,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Would be interested to see a comparison with the Aeon Mira series.  Considering my first laser and I'm looking at the Aeon and now possibly one of these.",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Hello, what would you recommend for engraving pigeon bands? Thank you.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "my 20w diode cuts 10mm multiplex so why you crack diodes off saying very very thin wood ;-)",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I think I'm putting the pieces together now of what when on behind the scenes.  Interesting.  Looking forward to seeing if these are really hitting specs. If so, super impressive!",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I want to cut wood for signs but I also want to do tumblers.  40w?",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Thanks for sharing. I have been looking for something like the hydra. Didn't know this was out there.",
    "likes": 0,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "OUTRAGEOUSLY OVER PRICED!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "We got the Thunder Bolt, and couldn't be happier.  Our old non-working Glowforge is unplugged and out of commission.",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Can’t wait to see more info on this laser. Depending on the quality, it may be exact what I’m looking for.",
    "likes": 3,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "love to see a direct compairon of features nd engraving next to the thunderbolt",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I'm not sure whether to choose this or the Xtool S1 10w. I primarily will be using this for veneer inlays for my woodworking business. I currently use an Xtool D1pro 10w and really need to switch to something with  an enclosure, and am already familiar with the Xtool creative space software. Also with the new software update, I am liking the program sooo much more.",
    "likes": 2,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  }
]