[
  {
    "text": "Can Fusion 360 creates drawings to cut the materials from that 3D drawings? I mean all the parts that I need to cut with skill saw, saw table etc.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "It would be a lot better if the measurements were given in inches or feet which are lot more intuitive than mm, cm or mtrs.",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Roly’s customer service is second to none. Regardless of how long they’ve been around they will schedule one on one to troubleshoot issues, they respond directly and quickly in the Facebook group and just take really REALLY great care of their customers overall. I’m confident that none of the other companies will come close to Roly’s level of service \n\nThe chuck is fantastic as well.",
    "likes": 16,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "I think it's important to remember, when comparing the price to S1, that the LaserMATIC has air Assist and honeycomb included in the price. Which makes it an ever better deal.",
    "likes": 24,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "For the price, thats a fantastic deal.  I would take this over my D1 pro an its enclosure hands down.",
    "likes": 5,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Have you ever seen the WeCreat work on Lightburn? Also, the WeCreat software is not even in the same league as the xTool at this point (not an xTool fanboy). Full disclosure, I have the Roly LaserMATIC 30/10, and it is amazing. It also has far better customer service than the rest. The xTool seems pretty good though, and the new Creality 40w Pro seems like it will be a great contender. It is a good time to be into lasers!",
    "likes": 1,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "What was the new machine you mentioned coming soon?",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great video as always.   Is there any chance you will be reviewing the new AtomStack A70?",
    "likes": 2,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Can these diode machines cut carbon Fiber plate? Anything from 1mm to 8mm thick (multiple passes).",
    "likes": 1,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "I am looking to buy my first laser. I don't expect it to do everything. In the beginning, I'd like to do small leather cutting and engraving and possibly tumblers, etc. Would the F1 with the slide extension be a good choice? I've seen it engrave, but haven't really seen it cut. I'd probably be looking at 2mm think leather at most.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I have the xtool S1 40 W.  the machine works great but I have an issue with the xcs program. \nany chance ( have you had a problem with the vector not showing the setting for Power % / Speed  & pass count) ? this is with XCS  program",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "This was extremely helpful and I loved the Thor clips mixed in 😂",
    "likes": 1,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I built some copy cats out of 1/8 and 1/4 inch MDF. I cut them using a circular saw with 60 tooth blade and hand saws for the joints. It was a little work but they turned out beautiful and functional. Still on my workbench for over a year and great. The price for materials doesn’t really justify it since the Hobby Zone stuff is very affordable. I do have 6 HZ units and plan on adding more, who knows, I may build some of my own again just for the challenge of it. Great video bud.",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "Hobbyist help to make it and an attempted snubbed. I stopped using SketchUp for some of these reasons. I am considering learning Fusion, and I want the knowledge to last some decades.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "i just want to  cut out crosses and   charms  for  charm  bracelets and  necklaces,, with  the circle tab on top,,, out  of  silver  and  gold plate and 14k.. 100 at a time..\nout  of a sheet of the  material.. any suggestions",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I find Creative Fabrica has just about everything you mentioned and much more. Thanks for the video!",
    "likes": 5,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Może i osiąga 22000 mm /m ale nie zdąża się rozpędzić do tej wartości i do tego trzeba wliczyć hamowanie. W skrócie czym szybciej tym wolniej, najlepsza wartość to 6000 - 9000 mm/m. Idealny grawer 6000 55%. Wkurwiają mnie takie reklamy - naciągactwo",
    "likes": 0,
    "video": "Can a 3D Printer Giant Conquer Lasers Too? Crealit"
  },
  {
    "text": "I'm so glad I came here because this is something you want to enjoy straight off the bat with your projects and it would be sour to be duped. First thing I looked at was the Laser Power and its sneaky",
    "likes": 1,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "do you need to go through copyright or is this free use to sell? would love to do these on my CNC",
    "likes": 0,
    "video": "Carved Wooden Football Stadium Signs on the CNC //"
  },
  {
    "text": "That groove in the laserguard isn't there for the material. It is an air intake so the ventilation fan can provide sufficient airflow and your lense and material aren't dirty from the smoke and soot. ;-)",
    "likes": 1,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "you mention at @4.33 upgrade of board to use Lightburn. Any chance you can elaborate... maybe a link on what to upgrade to... and then a how ;) got a friend that mentioned the 40W is the low end, as you also indicated, is it worth considering upgrading the laser in this unit... the K50 is like 3-4x more expensive for us. you mentioned the upgrade video ?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I know nothing about these but I’m thinking of getting one. A lot of the advertising stays they can do so much in one pass. I’m not in a hurry with anything . Can, let’s say a 5w laser cut through 1/8 ss with multiple passes with delays in between as to not burn any thing up",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I have some designs in Solid works, how I print those design with M5C?",
    "likes": 1,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "I really want to watch these but its tough when you end. Every. Sentence. Thesame. The cadence messes.  With.  MyADHD.  And it becomes the only. Thing.  I. Canhear.",
    "likes": 10,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Hi can i engrave photo on steinless steel with that laser",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "On the OMtech website I see a \"K40+\" With a built in Air Asist and compatibility with Light burn / Laser GRBL. Any updated reviews with this new unit? seems almost too good to be true.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "They are all China imports.  Only thing on these that is made in the US is the logo!!  Same parts inside all of them.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "It's worth noting that Creative Market offers a few different (non-commercial) downloads for free every week. Not always the primo stuff, but I've collected quite a few interesting fonts there.",
    "likes": 0,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "I am impressed. I do have an Epilog laser and considering adding a second machine. This is a real contender. I am a home hobby person and make gifts for my family and friends. However, once in awhile I do sell things . I really like lasers and CNC machines. I think this Bolt is a winner.",
    "likes": 3,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Heritage Type Co. is a great resource for vintage style, highly ornate fonts and other decorative elements. Their Vintage Font Bundle is worth every penny, plus they have a ton of free stuff, too.",
    "likes": 7,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "One of my favorite “hacks” for fusion 360 is the ability to take any surface I want and generate an svg file using the shaper origin plug-in",
    "likes": 6,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Thanks for the list! I'm just starting out and this gave me a huge step up and saved me a lot of time.",
    "likes": 3,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Love your videos and now the resources.  As you went through the list I remembered some of them from years past that I forgot all about but I just got a new laser and am chomping at the bit to get it working (today is unboxing day since everything finally arrived).",
    "likes": 2,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Xtool advertising is misleading. They say the P2 works with Lightburn (with exception of auto focus, cameras and curve feature). Given i already have a D1 and Lightburn works perfectly with it, I had no reason to assume Lightburn wouldn't work with the P2 with the exception of the explicitly stated limitations above.  I can understand not having the curve support, but all other functions should be available. Also, the XCS software is horrible. I would not expect it to be on par with LIghtburn, but there are a multitude of little things like being able to easily define layers or remove the close up view when not needed. All in all, unless you are happy to only work in XCS (assuming full support for Lightburn never comes), save your money and buy another brand CO2 (Monoport, Omtech) and get a fiber laser to go with it for what you pay for the P2. I am posting this comment not as a criticism of the this video, but in the hopes that someone watching this video in trying to decide whether to buy the P2 or not, are more fully informed. I did a fair amount of research before buying the P2 and everyone either intentionally or unknowingly failed to mention just how limited LIghtburn for P2 is nor just how bad the XCS software is.",
    "likes": 1,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I find it almost impossible to sign in to your list so I just gave up.",
    "likes": 0,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Fantastic video. Lots of tips for any creative outlet. I'm going to look at some with an eye toward just art and animation.",
    "likes": 2,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "I inherited one of these that had only been used for one project before the owner passed. I have a 3d printer collection with 3 Prusas, 2 Bambulabs, a Voron 0.2, and a CocoaPress, so I’m familiar with the basic construction and Cartesian mechanics, and gcode. As best I can tell, it is complete, except the water chiller hasn’t turned up yet. It’s also missing the manual. I am interested in learning about the machine and the process. Thanks for producing this video.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "On the font side, may be worth discussing the difference between regular fonts and single stroke fonts (which can be really important for engraving).",
    "likes": 8,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Yours link does not work for me for the resources list !  I get the email, but the link say I don't have access to the page !",
    "likes": 2,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "You just can’t have an edge anymore, with dingleberries giving away all the trade secrets.",
    "likes": 1,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Good stuff!  I am new to Laser and I was just asking these same questions.  Thanks for answering.",
    "likes": 3,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Would you say this machine is like the glow forge as far as taking it out of the box and starting for a beginner?",
    "likes": 0,
    "video": "Why do these lasers cost so much?"
  },
  {
    "text": "Looky there…the horizon is equidistant from the camera for 360 degrees 🤔 Only one shape allows for that condition, flat earth booger eaters 🌎",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "A question my friend, between the longer ray5 10w and mecpow 10w, which would you recommend?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "For ax and hammer shims, I glue up a bar of hardwood and , using my mitre saw, set it at 2 or 3 degrees and flip the bar over and over. From the same bar of wood, I make 4 deg to 7 deg. shims.",
    "likes": 2,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  },
  {
    "text": "I will never buy anything neje ever in my life. I bought an 30w laser from lasertree. The sales and support were out if this world. Neje can learn a thing or two from lasertree.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "the basic laser is 3018.... if you want 2cm larger. get the 3020 pro max 😂",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "The cable is not why there called fiber lasers, rather it's the coil of optical fibre inside the machine, that stores the output from multiple diodes, and then realeses it in a pulse (which then travels down the external  cable)",
    "likes": 10,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "Must be being Marketed by the Liberal MSM, Pharma or just using DOMINION VOTE technologies….\nAll they do is Lie, Lie, Distort, Lie, Cheat and Gaslight…\nLeftist Lasers..",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "If the software doesn't do everything you want, there are a load of free SVG creating software for both desktop and iPads, and also free or very low cost picture editing apps. There is also Sure Cuts a Lot (designed for plotters) that has many, many design features such as tracing, node control, warping, effects, line fill etc and is low cost (also has a free trial so you can look at the features) that you may find handy. I'm a plotter user but I'm waiting for this machine to be in the EU so I can add it to my craft room....2 or 3 months I'm told!",
    "likes": 0,
    "video": "The Features all Laser Software Should Have - WeCr"
  },
  {
    "text": "How thick of a piece of material can you place in there? Specifically, would a Jar lid fit roughly a 1/2 inch think. I don't want to cut it, but simply engrave or etch my logo in the top of the lid.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "So i guess the longer ray5 runs in that category? Not....😅",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I’m debating between an xtool s1 or omtech polar as a first laser to start a small business, which would you recommend ? Thank You",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "can thin metal sheet  (0.5 -1mm) be cut with these small laser machines?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "I'd love to watch this video, but 25 minutes is just too long, sorry.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I need this in my life. I just got the Laserpecket 2 and already wantbto up grade. Thanks for the review. Im loving these machines.",
    "likes": 2,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "How much are you guys getting paid for this crap.  This is number 5 so far and you guys are kicking off all the common sense  - so you guys are getting paid. Time to stop this crap.  How much were you coached to make smoke.  This is bogus crap",
    "likes": 0,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "Please help, can you suggest a laser engraving machine to do watch dials for a hobbiest. I'm trying to make a custom dial for a watch for my dad. Would really appreciate your recommendation.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "how long did that mando helmet take to print for you ?",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Is this engraver good enough to engrave and cut through leather hat patches?",
    "likes": 0,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "Super helpful video. Where would you put the Xtool S1 in the lineup now that you've had a chance to play around with it? It's a diode, but it's enclosed, and it's pretty powerful, and it can swap with an IR head. It feels like it doesn't really fit well in any of the categories. Thanks!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "The Best clip about Engravers I've ever seen on YouTube . Thanks and Best",
    "likes": 15,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I had up until last Sunday a Full Spectrum 40 watt CO2 laser.  It was about 6 yrs old and the startup board crapped out and FS wont answer my request for support.  So, looking at my options, I really like the S1 based on what I do, but I cant decide if the 20 or 40 watt is the way to go.  I do cut some wood, but usually thin basswood.  I do more along the line of engraving signs.  With this, which is better, the 20 or 40?  Thanks!",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Where do you get the brass colored powder? I have other colors but not that one",
    "likes": 0,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "Is theee a laser you recommend for cutting boards, stove noodles, or wooden utensils? Looking for a laser under 800.00",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "What you recommend for a guy just starting out on engraving, that would like to customize cutting boards and wooden spoons, ladles, forks, and noodles (stove covers), etc.?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Great video and very informative,  How does the Creality 10W CR Laser Falcon compare with the OmTech B10?",
    "likes": 2,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Thanks so much for the videos. They have been really helpful in helping me decide which laser to buy. I tried to use your code for the s1 - 200S1 - and it said invalid code. Is that because the machine is on sale right now?",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Thanks for the idea my planner is only 11\" and I'm going to use my old oak cabnet doors for the butcher block .\nAfter watching your video I feel confident on doing UT thanks so much",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Hii. I just want to ask if you encountered or tested or known \"Daja?\" particularly its budget ones which is dj7 or dj6. I am just curious if its good as it is more available in my country but it is more portable with less powerful than the budget ones in the list.\n\nIt is more for hobby and engraving, not much of cutting thick stuffs. Thanks",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Which honeycomb panel did you use in this video ? It seems to fit the Sulpfun S9 perfectly ?",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Even though this video is 4 years old, the information given, was easy to follow. Thank you so much, no more snazzy maps or mapbox, this software does so, so much. Plus once you get to grips with it the possibilities for laser cut maps etc is limitless. Again Tanks",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Can I get a robot to make the fence on my Rigid tablesaw square to the miter slot for more than 2 seconds?",
    "likes": 0,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "Great video you wake up people, but you were one of the guy commercial those machines in your channel lol",
    "likes": 0,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "I want to start engraving things such as tumblers and firearms parts(slides and lower) both polymers and metal. Something to do as a little side business, is there an engraver anyone would recommend but NOT be in the 2000-10000 range, looking to stay under $1500",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "It's a bummer you didn't go into why you gave Glowforge such a low score for its software. GLOWFORGE forces you into their pay-to-use cloud-based solution. They offer a bare bones free version, but it is atrocious, with almost no ability to adjust or change your images. Its terrible. NOBODY buy glowforge... ever. Period!",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "This is the most interesting video of yours I have seen.",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "Love this. You should do more of these types of videos in addition to your other videos. Informative, entertaining and thought provoking. Keep it up.",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "I think you are spot on in your analysis. You went back to 1928, but let’s go further back: We saw the same trends with new technologies like electricity, the steam engine (revolutionised the weaving industry), the wheel…. Each time, we have seen new jobs emerge as a result.\n\nFor woodworkers, we can be divided into two categories: Some are production focussed, churning out the same chairs, tables, coasters every day in as high a volume as possible. For them, automation will be a God-send as they will be able to produce more a day. The other category are the more “creative” (no offence, producers) that hardly ever make two identical products. Here, machines may replace certain steps, but not the entire creative and assembly process. It’s especially the creative work that AI cannot replace - at least for many years to come.",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "You asked for feedback, so here goes with the caveat that not every channel should be for everyone and every creator should have the space to evolve.\nI'm just here for information about tools and process, not the larger context. For the current machine learning wave as a topic, I'd be interested in seeing what you can *do* with it but if I want a historical or economic perspective (both topics notoriously filled with misinformation) then  I'll go read or watch a historian or an economist.\nBut, like I said, just because it's not for me doesn't mean it's not for others and it definitely doesn't mean that you shouldn't head in new directions with the channel.",
    "likes": 2,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "I remember the days when humans made their own thumbnails ❤",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "I can’t disagree with you at all even if I believe we prob stand for different parties.  Ty for saying your truth and imo the truth.  Too much scared people.  Yes. We will have to change jobs but there’s often more to choose from.",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "Wow man, love this so much.  Such an interesting and relevant conversation for our time.  Thanks for putting this together!",
    "likes": 5,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "I love tools but I’m sad by so much use of cnc’s and lasers… don’t get me wrong they’re cool but I see the hand made craft becoming smaller and not to mention all the other jobs taken by stupid tech. I don’t want to get back to the stone ages but I think we’ve prioritized tech beyond what’s right. I know many will disagree but I think it’s a real threat",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "Sounds to me like it a case of figuring out how best to use this new tool.",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "people like to make the argument that because the industrial revolution didn't decimate jobs the ai revolution won't either. these aren't even close to the same. industrial revolution was the creation of machinery that did specific tasks. ai revolution is the replication of fluid human intelligence and senses while also leveraging unimaginable quantities of data. 80 percent or more jobs will be gone at a minimum. white collar will start to go first. universal basic income will be rolled out at some point. the majority of those who work in the future will be either enhanced or fully dedicated to climbing dominant hierarchies - top 5 percent achievers. mega corporations and government will fully merge. globalism fully implemented - elimination of national sovereignty. i estimate around 50-100 years for the ruling class of world to get this done.    \n\nthere's no direction away from the current trajectory because public awareness is shifted into left / right tribalism and whatever the news cycle dictates.",
    "likes": 2,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "If any machines are looking for a job you guys can replace me Id love to go home 😆. I like this content and its always good to experiment!",
    "likes": 2,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "This was a nice addition to your normal fare.  I personally would prefer not to lose the usual topics, but this was very interesting.   Thanks.",
    "likes": 1,
    "video": "You Could Lose Your Job To This."
  },
  {
    "text": "Sorry , late to the party. Can you still use Lightburn software with this ?  Thanks",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "I am wanting to purchase a laser cutter to engrave yeti mugs/tumblers/glasses, etc. Not wanting to spend a fortune, any advice on what brand I should purchase?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "You said 8000mm/sec for both, what did you actually mean? 8000mm/sec and 8000mm/min?",
    "likes": 1,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "I can understand how focusing works for the engraving function which is more or less planar, but how does it work when cutting? When the beam had penetrated a millimeter into the material, one would need to lower the focus by that millimeter, but then some \"sideways\" rays that come at angle wouldn't reach deep into the groove and will hit the material around the groove instead. Heating and possibly graying them. Is there a place where I can find explanations on that matter?",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "thank you for this amazing and specifically video! \nAppreciated a lot! 🙏",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Are you stupid or just think we are stupid? No one lies and even first listing you showed in the video says 5W in the title. Just open your eyes.",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Hi Brandon, I'm starting up a small business for cookie stencils. I want to make my own at home. Can you recommend a laser cutting machine that will cut 10 mil/250 micron Mylar? Thank you.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "So mant affilate videos of these brands boost their price up which is acfually not the value of the product. So youtubers actually help companies not the viewers.",
    "likes": 2,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I want to cut glass. Both clear and colored. What laser machine would you recommend? Liked and subbed!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Can this laser engrave galvanized sheet metal. Looking to tag our production parts",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Do you have anything specifically for Sculpfun, I’ve got a S30 ultra 33w",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "encloser is not a problem. i would not buy an enclosed one since limits space, also would make it more expensive. you can always make yours also.. would appreciate tho if they included a right tinted glass when you make yours to use it. also people can buy ready made enclosers as an addon (those who want)",
    "likes": 1,
    "video": "Is the future of lasers?  -  WeCreat Vision Laser "
  },
  {
    "text": "Hi, we have been following your YouTube channel and are impressed by your professionalism and creativity. We really enjoyed your unboxing video. NymoLabs is a new CNC brand and we hope to establish a cooperative relationship with you. Our channel has information about our machines. We hope to communicate with you further.",
    "likes": 0,
    "video": "Should You Get a Fiber Laser?"
  },
  {
    "text": "I want to engrave on sterling rings. What would you suggest? Also why won’t the x tool machines cut sterling silver",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "Which one would be recommended to do custom engraving on pistol slides ?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "woops, lost your adjustment layer. Great video though.",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "personally i'd prefer to have separate machines. 1 cuz i dont have to keep switching out lazers print heads etc.. 2 - easier to maintain (if my lazer gets my printer too dirty or has a problem im out 2 machines instead of 1 3 - can print and do lazer cutting at the same time",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "What are the copyright and image ownership aspects to know about when using AI in creating images or modifying images?",
    "likes": 0,
    "video": "This Fixed My Biggest Laser Problem"
  },
  {
    "text": "What an incoherent video. Jump to this tool, then this other tool, then back. Edit it as a story, not as stream highlights.",
    "likes": 0,
    "video": "This Fixed My Biggest Laser Problem"
  },
  {
    "text": "Can you please make test cards for light burn c02 for purchase please",
    "likes": 0,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "@makeorbreakshop\n14:16 Great info\nThose limitations you mentioned about engraving metal was what i wasn't sure on.\nPlanned on buying the full combo to etch on Aluminum.\n\nWould you reckon the 40w would be effective at removing cerakote to expose the alloy underneath instead?",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Dude you’re serious about this stuff, I’m making a purchase off your advice, thanks!",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Can engrave notes or serial numbers on cream Stainless steel metal tubes Φ16 Φ20 size?",
    "likes": 0,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Neah waiting for xtool to step up the UV laser game with cameras for positioning ❤",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Great video, but not sure if there is a good reason to upgrade from the F1 ultra... Faster? Better Camera? Removable fan? But at twice the cost, I just don't know... Is there anything it can do, that the F1 ultra can't? (Except for colour, which I don't care about).",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Can I engrave 100*120mm logo on 310*310mm material?? I mean, a 310*310 material can fit in it?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Definitely was helpful I was stuck for days. still don’t understand how to just put something on there and just engrave",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "For somebody who just wants to use basic engraving for their light burn this really isn't helpful I was looking for how to go from Kraft paper to metal there needs to be a more beginner friendly than this please and thank you",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Hello. What I am looking for is a device that can print text, image, and barcode on metals or steels, basically for an inventory management. Target surfaces include pipes, drillings tools, jars, etc. which may be difficult to move around. Therefore, a hand-held accessory will might be deeded. Which deices would you suggest?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I really appreciate this video and I do not find the title clickbait-y at all. I’ve been trying to figure out if I want the extra modules and this video is pretty much the straw that breaks the camel’s back. I love Bambu and will be buying an H2D very soon but I’ll be trusting xTool for my laser and cutting needs for sure.",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "is there a video where you explain how to center your designs on the project? I can never figure out how to get the laser centered perfectly",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "I'm tracking prices on over 200 laser daily, find out when they really go on sale here: https://machinesformakers.com/deals?utm_source=youtube&utm_medium=video&utm_campaign=yt-2iehedwahow-the-fiber-laser-to-get-in-2025&utm_content=pinned-comment&utm_term=deal-alerts",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Would love to see a comparison between the Boss HP3655 and the OneLaser HYDRA 16",
    "likes": 0,
    "video": "Should You Get an Industrial Size Laser?"
  },
  {
    "text": "well while this is a \"neat\" new printer.. Im gonna wait for the market to get over run and see whose left standing in a year? maybe less... being STUCK to their \"ink\" does NOT sound like a machine that will out last the storm that is to come... specially at the \"asking\" price- I'd bet these machines will be more like 500$ ish in no time at all- with refillable options... its fucking 2025- one brand to rule them all.. isnt the way >><< DO YOU KNOW THE WAY???? also... 3 months on that kinda price tag? GTFO!!!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "It's reassuring to see I'm not the only one going through a convoluted process to generate profile outlines! Instead of PS to AI, I just do it in one shot Lightburn. Marginally faster, same result.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete"
  },
  {
    "text": "Currently not active in the EU, shipping cost and VAT will add  600+1200 euro to the price, plus long lead time.",
    "likes": 0,
    "video": "Should You Get an Industrial Size Laser?"
  },
  {
    "text": "Currently not active in the EU, shipping cost and VAT will add  600+800 euro to the price, plus long lead time.",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "The big question with print ink, is how long does it take before the cartridge dry out over time when not in use?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I have the opportunity to get a 50w gweike cloud NEW for 1500w......should I do it 🤷",
    "likes": 0,
    "video": "EVERYTHING About Lasers Will Change"
  },
  {
    "text": "email confirmation never got sent wouldve loved to look at lasers but rip me",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Anyone tried slate as a material for etching/engraving on this curious to see if it is capable of it",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Great job! Is there a diode desktop laser with a reliable pass through that you could suggest? My use case is foam sheets and thin plywood for RC planes but would be nice to cut longer pieces. I doubt more than 40 watts would be needed.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Great video but… Why does every sentence sound like a question?",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "In 25:42 of the video you did some head math. Not quite sure where the numbers came from to determine your dot width correction. Can't really make out what you said. Could you elaborate? Thank you.",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "Is there any good laser for less than $1000 that can cut 1/8” thick acrylic?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What glue do you recommend for doing those detailed ink inlays?",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Whats the life of the print heads ? Cost of replacement ? How many print heads in the unit ? Whats the model of the printhead ?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "You missed Epilog and Trotec.  Truly high end lasers.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What one is best for cutting leather and burning small detail letters and other things onto leather . Also like to do zippo's would that be a different machine ? Thank you for your advice anyone that knows .",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Wecreat is not Lightburn compatible with the camera.. from what I seen that is the only reason I won’t get it",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I believe you can just move the head to the 4 corners to calibrate rather than the material guessing.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Just know the laser version has horrible plastic windows and the front one is slightly milky. If I had known I would have saved the money and gone for the base combo with glass windows and then added the cutter and plotter",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Will any of these machines cut thin aluminum? Thanks for your videos!! Just subbed",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "its possible in all fiber marking softwares or only in Lightburn Software ?",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "This video is 11 months old. We’re in August 2025 now—eight months into the MAGA Era. Most of these machines are made in China; the rest are made of Chinese parts. So, with the MAGA tariffs, does that mean prices are now 1.5 times higher?",
    "likes": 3,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I've been checking fiber lasers and now most laser companies are cutting their 60w mopa's price below f2's $4499 line. Great thing I must say.😆",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I had to download a driver that was on the included USB card to connect automatically with my Mac.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "I do direct to garment printing with the Ricoh RI 4000 a full set of ink runs me about $900. I can do approximately 500 shirts. I don’t think the ink cost for this resin printer. Is that bad at all!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Dunno if you will have time to answer this, but in your experience, if I was deciding between a Thunder Nova Plus or a OneLaser Hydra, do you feel one has any advantages over the other?",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Great video. It helped me a lot. A general tip that is valid for most instruction videos. At least use a yellow halo around your cursor (can be created within Windows). Since it is so small and the screen is packed with functions it is often hard to see  where the cursor is on the screen. I have worked with Camtasia in the past that would automatically zoom in at your cursor position which is even better. Camtasia is pretty expensive but I bet the cheaper options like OCB (free) will have similar functionality.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "For one thing your 2 boxes are different sizes so naturally the bigger box is going to take longer. You don't have to click on the offset to use the offset fill either it will work just by changing the cut mode to offset fill.-",
    "likes": 0,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "But a single F2 cost $6499. If I get a separate commarker B6 with 4299 and a 40w diode separately. I can save about $500.",
    "likes": 2,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Hey, help me get ahold o accelaser and see if we can get a unit to test for us.  I work with the Scouts and local schools bands and arts programs.  Can't afford it, but it would be great to teach with and make items to sell to raise money.",
    "likes": 0,
    "video": "Every Laser Has This Problem (Except for One)"
  },
  {
    "text": "If people want to save money on ink, they can just buy the cheapest white primer rattle can at their hardware store. The UV ink will stick even better to the primer so it's a win-win",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "If you're thinking of buying from wecreat - make sure you want it before you buy and don't make the mistake I did - their 30 day money back guarantee is very limited and will cost me several hundred dollars to return unopened.",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Love it, was looking for a different technique for my art work. Gonna give this a try \nMade more vids please",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "My Cannon is 2k  for the ink with 12 ink cartridges .  300 is nothing, I don't plan on printing anything raised, but if I do I will price it accordingly",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Just a very beginner user. How did you fill in the square with a color? I am looking to make Printed Circuit designs and usually make the pads and runs black. Just didn't know how to fill those shapes in.  And is there a way to make lines really thick to be runners?  Thumbs Up!",
    "likes": 0,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "I have a xtool f1 ultra. It works great when it works. I am finding that the Galvanometer (mirror array) is failing in quite often per the different forums. Mine went as well a few weeks after the warranty expired. Many others said theirs failed sooner. Customer service is recommending a new machine and will not honor the warranty. I am currently not looking for a new machine.",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "been binge watching your videos and overloaded now with all this new (to me) info.  Was pretty much narrowed down to omtech polar (debating lite and +) but just came across the gweike cloud with rotary pro II for $1659 and it seems like a super great deal.  I also know there seems to be new desktop lasers coming out every day lol - so is this still a good choice? especially at this price?  thank you for any input",
    "likes": 1,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "lots of really good info - thank you :) I certainly prefer the cost and usability of a diode laser, but I want to be able to cut white and blue acrylic, which diode doesn't do well apparently.  With all the new desktop co2 lasers hitting the market, is there any you would recommend? (Still going through your vids to see if you have a comparison ;) )",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Fantastic review bro! I love those slider shots in the beginning!",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I want to get one for engraving custom print onto stainelss steel business cards but also provides colour?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "If anyone reads this, I need some help, I have 2 different Galvos, a CO2 and a UV running both on the same laptop and on Lightburn. Every time I switch from one laser to the other I keep losing my settings. Like it does not save the settings (it forgets my foot pedal settings, the image inverts so on....I have the lasers on two different \"Devices\". Any help would be appreciated. TIA",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "How to do this on diode. Most of us just using a laser for fun and have only diode.",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "ton article manuscri ne  précise pas la version (20 ou 30 Watt)",
    "likes": 0,
    "video": "The Best Laser Engraver for Metal? - ComMarker B6 "
  },
  {
    "text": "Thanks for the vid!\nI'm looking for a small engraver to put over a convoyer belt to engrave roasting dates on coffee bags while they are sealing? What suggestion do you have?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "I wish I had never gotten that machine.  Its like pulling teeth to get technical support.  When I upgrade it wont be with them again.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "first of all i just want to give you one big THANK YOU!!! this video is sooooo helpful. i just bought my first lazer engraver for fun. this video is a must watch in my opinion. i dint even know where to start. may God bless you. keep doing what youre doing.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Você é muito bom. Apenas me deixou tonto com a palilalia",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....Then... Then.... Then... Then... Then... Then... Then....",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "I'm more lost now,,,,, who can help getting a laser that can engrave on Mylar Bags?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The trick to not using so much white is either using a base that's already white, or cheap spray paint enamel..",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "It all depends on oxide coating on metal , aluminium and copper oxides are reflective but iron oxidees are of amber color , so it absorbs as blackbody,, as diode laser can engrave on steel hence can also cut if properly adjusted",
    "likes": 0,
    "video": "EVERYTHING About Lasers Will Change"
  },
  {
    "text": "I'm so glad i found your video! You are getting a sub from me!\nI have been looking at getting a 3D printer, but had to put the purchase on pause due to another big purchase (an affordable house!) and then this bad boy dropped! My partner got excited and asked me if i would rather save up a little more money and then get this 2 in one, because i would like to try laser cutting but its not my main focus and the machines are rather expensive. \nSo here i am trying to research if the printer is worth it or not and from your review, which was sooo much more helpful since you know the details about laser cutting and most other reviewers are 3D printers, and i think i feel like this is a 100% the route i should go, i get to have the 3D printer i wanted but as an added bonus i can play around with the laser cutter function and it sounds like the quality and what you get is quite good even though the size is a trade off.\nBut i am also a hobbyist, i love trying my hand at many hobbies and i don't think i need a bigger surface to cut on to begin with, so honestly it really sounds like a great fit for someone like me, who needs the 3D printer but would love to try a laser cutter too :)",
    "likes": 2,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Hi, the \"contact us\" link on your website is a 404 error. I'd like to talk to you about my situation. Please let me know the best way to get in touch. Thx!",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Hey! I sent you a quick email if you wouldn't mind checking?",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "not really a vinyl cutter i run 18 inch long cuts sometimes im no pro but it seems like you can only cut a small design inside the confines of 12x12",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "nice video, amazing ..can s9 upgrade laser? please link bro ,file download inactive",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 L"
  },
  {
    "text": "Thank you for the review, it sold me on trying this machine out and honestly on getting light burn as well.",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Yeah no thanks, $2500 just for the UV printer?  I remember looking at full sized UV printers a few years ago for $8,000-$10,000 which do larger items and larger quantities.  This thing is pretty expensive and only serves a niche set of people.  I think what businesses would benefit are cellphone shops for people that want some cool design on their plain phone cases.  Or maybe designs on their gaming consoles, or desktop gaming PC.  Etsy is full of stuff, and I wouldn't be surprised if someone already has a shop full of random offset UV printed projects.  But I personally don't see any use case for this.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I just need a machine that can cut 3/4 inch wood, and 1/8 plexiglass. In sizes up to 24” .What’s the cheapest option?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi, I am hoping that you respond to my questions.... My husband and I have been considering getting the H2D and possibly the laser add-on. Can you please tell me if you can cut real leather using the H2D? We currently have an A1 but don't have any lasers yet. Would the 40 watt H2D laser be able to cut out real leather pieces to make small purses?  Thank you very much.",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "I’m super grateful for this video. Thank you. I will be buying this printer and I just need an idea of what my ongoing costs would be. Truly, thank you.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "yes you CAN do full colour 3D prints with millions of colours with Polyjet printers.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "Is there a better Fiber (non MOPA) for sale that is faster for engraving or cutting metal. I know the xtool software sets it apart but are all 60 watt fibers going to complete something like a coin in the same amount of time?",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Hello. How are you? I hope everything is fine.\nI have a question for you. Thanks in advance for your answer.\nAre the xTool P2 conveyor and the S1 conveyor the same?\nAs someone who has seen and used both machines, could you answer this?\nThank you! :)",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I own a printing business that does die-cutting from traditional dies. Sometimes we have a request for die-cutting that is too intricate with traditional dies. Do you have a recommendation as to what would be suitable to do laser die-cutting of cover-weight paper? A typical quantity would be 100-200 pieces of a  5 x 7 card. Can you put several 5 x 7 cards and walk away and come back when they're done? We'd need something that didn't take baby sitting all day to do 100 cards. Thanks!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Lightburn in 37 minutes - nah to get full value from Lightburn it takes months. You can do basic functions after this. Still an excellent video just managing expectation from your video.",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "When starting a business or a hobby getting a machine that's going to take most of my budget because of being high end so what would be a best option to grow a business and not suck up most of my budget.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "My driver to get into lasers is etching on curved glass.  I didn't really see this qualified on the site.  Recommendation? I'm entry level.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "i just got the G2 MAX 50W Fiber Laser Engraver and am going to try the 3d then use my eufymake uv printer to print color on it.. hope it works out",
    "likes": 1,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "So a 13 minute video to just say Yes it costs $300 end of story!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I wonder how long it takes until we see the first stolen passports, ID Cards where they just print on with this.",
    "likes": 0,
    "video": "Is THIS the Future of Printing?  - eufyMake E1 UV "
  },
  {
    "text": "crazy expensive, who buys inks from roland...\nplus:\n- cleaning\n- when you will have to replace the printing head and for how much, they already started giving discounts on those if you buy early...so this tells you a bigger cost is coming",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Be aware that many people have problems with the F1 Ultra recently. It´s kind of having a problem losing the power on the fiber laser. Meaning that even you put it on 100% power it runs like its only at 5%.\r\nCheck the xtool support community and search for \" Loss of power with the F1 Ultra",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Be aware that many people have problems with the F1 Ultra recently. It´s kind of having a problem losing the power on the fiber laser. Meaning that even you put it on 100% power it runs like its only at 5%.\r\nCheck the xtool support community and search for \" Loss of power with the F1 Ultra",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I'm hearing the Polar OmTech recommends to have a dedicated 110V line ?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "How uneven can a surface be to  be able to print? Like if I wanted to print on a pencil… that has a diameter below the minimum of the rotary accessory. Could you just use the flat printing stage and overcome slight height differences due to the curvature or could you still use the rotary printing stage for smaller diameter objects to print on? Main question is can I print a face on a Lego minifigure head piece?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "That Roly looks like a 20 year old laser compared to what we've already seen of the HD1.",
    "likes": 0,
    "video": "EVERYTHING About Lasers Will Change"
  },
  {
    "text": "Just saw this up close at LBX 2025 in NYC. Not sure why XTool was there as their own rep said it will NEVER be compatible with Lightburn! The machine is robust and “pretty” but at that price point and with that amount of power not being Lightburn compatible is ridiculous!",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Would appear that there are creators with elliptical patterns suggesting the angle and direction of impact. Very interesting. What area is this? Reminds me of the Carolina bays",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Would take a long time to make enough back to break even",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "With 145% orange man tariffs it will be USD 735.00...",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Also, what would I need to make an enclosure out of to go around a monport style Mopa galvo laser?",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Can you recommend a source for brass coins?  I have orders some from different vendors and several have just been coated when they said they were solid.",
    "likes": 1,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "What recommendation to you have for just a 60+ watt MOPA other than this?",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I've seen other videos where the ink this thing lays down can be scratched off with a fingernail. It seems in no way permanent.\nNot worth any money, let alone $300 for \"ink\" that won't last a day.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "Definitely interested. Now just need to find the cash for one... 😅",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "So you're saying the best companion to the p2s is an f2? :) \n\nThanks for your explanations. Much appreciated.",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Thank you great video just starting with lazer so appreciate the step by step",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Great video!  Hopefully you'll make a comparison video when this and the Roly GalvoMATIC are released.  It would be very interesting to see how the two of them compare and contrast to each other.",
    "likes": 0,
    "video": "Every Laser Has This Problem (Except for One)"
  },
  {
    "text": "Thank you for showing this software. It is really going to help me with making maps for my side business. I love the QGIS software and its ability to give me all the data but the time it takes to use it waists what is left of my weekends. I am trying the trial now and I will give an update soon. Just so you know, the promo code you gave does not work for the business version.",
    "likes": 0,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Isn't this a problem that can be solved by reducing the output?",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I have the H2D Laser but now I need the purifier because I no longer can vent it like I originally planned, looking for a cheaper alternative for occasional (maybe once a month or less) laser projects, $700 is just too steep for something I'll rarely use, but safety first argh",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "So because Bambu doesn't have an official honeycomb bed, they do however mention on the wiki and documentation that there are optional 'laser grid panels' which sit on top of the slats (which you can buy more of btw on the store right now) the grid panels are a very nice addition but according to support are not available yet, they cover the bed with up to 3 of them, see the wiki for photos (I can't post a url in YouTube comments it just deletes the comment) you can also 3D print the grid panels, search MakerWorld for 'Printable Grid Plate for H2D' its by 'CutMaster', it's almost identical to the Bambu ones but they are available now of course for printing.",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Great video! I already own a very nice gantry CO2 laser and an open-frame (split fiber) 60W MOPA, but I've been looking for a (relatively) portable machine for doing on-site engraving. I pulled the trigger on an F2 Ultra ultimately because not only does it hit all the requirements for what I need in a machine for on-site work at shows (both in versatility *and* safety), it's work area is large enough that when needed, I can supplement the workload handling of the split fiber MOPA I have. So for me and my use cases, the extra expense of the F2 Ultra made sense.",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I can see this merging with UV resin printing. Print one layer, instant curing, move bed down, print next layer. I don't see why this wouldn't be possible. And it's full color!",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I have found that if you put in the time and effort to perfect your color engraving, you can find clients willing to pay more to engrave items with their corporate colors because the resulting items are more unique versus the usual swag. YMMV",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I was under the impression that \"galvo\" type machines were less prone to malfunctions since there are less moving parts (no gantry etc) - but instead you got a bunch of mirrors that can break.. oh and 6K is a bit much. I'm actually still looking, most likely around the 1000-range. As a hobbyist I can't defend going all-in on an expensive laser.",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Great video!  It's expensive but I really have been happy with my F1 and F1 Lite. The software and user-friendliness is a big plus.",
    "likes": 5,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Great video ! However i would loved to see the comparison of details between 20W diode and 40W diode, i have a 60W co2 galvo, even with 8x beam expander and 210 mm lense, i find that the details are not great, dot size is too big for detailed work. For instance if i am doing tumblers and i am engraving where the engraving is supposed to leave out a thin line of powder coating, its simply just engrave the thin line away.",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I pre ordered the Accelaser Ultra HD1 or else this would look pretty appealing.. now I need to wait until November to have it but will have air assist and a better work area.",
    "likes": 0,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Nothing to see here. Just a xtool salesman trying to persuade you to spend $5k every year while they get their machines for free. Sorry but as a \"laser enthusiast\", you should be slamming the practice of annual launches",
    "likes": 8,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "We are all waiting for ACCElaser, a moving fiber or diode laser. and with a much bigger workspace.",
    "likes": 2,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "I’m waiting for the “flying galvo” machines - combining the two seems like a great advantage if it actually works :) I’d hoped to see a lower-powered F1 Ultra-sized machine (F1 Ultra Lite?) since the 200mm square bed is the sweet spot for the kind of wood engravings I do. The color stuff is neat, but not something I’d ever use.",
    "likes": 2,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "Just an xTool ad from an xTool rep! Please be honest and state early your affiliations and or sponsors.",
    "likes": 14,
    "video": "The Fiber Laser to Get in 2025? xTool F2 Ultra Rev"
  },
  {
    "text": "i have a question.. which laser is best for beginners? the xtool s1 or m1?",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "This cost estimation stuff should be built into the Eufy software just like it is in most 3d printer software... But thanks for building this tool.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I am looking to purchase an engraver to engrave key blanks - have you engraved any key blanks? it would be great to see examples of the results - my application would be low volume for a home office - would the OMTech Galvo 20W Fiber Laser be a device I could consider? as opposed to the more expensive OMTech Galvo 20W Split? What is the difference in the first device and the \"split\" device - for my engraving key blank application - thanks for the advice",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I video because I do remember you stating that the price is locked in if you are an early backer today is July 18 and they finally sent out the survey so that we could add our address but they are charging almost everybody tax. Everybody is pretty upset about that. Have you heard anything on that note?",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I believe that opening the vent enables air INTO the machine which can then go to the exhaust. Without the vent opening, this sealed machine will have no way for fresh air to get into the machine at a high enough volume to not starve the filter. It’s clever, as the vent is in the front top, while the exhaust is in the middle height at the rear. So this gives you an air flow that goes right through the shortest distance, which happens to be the area where the laser is working.\n\nIf the size of the bed is ok for people and you just don’t have the room, then this is fine. The quality seems to be pretty good. As far as the different time scales for the laser or the printer, well, you just have to manage your time. If you know what you’re going to be doing, then do the short job first. These things are a compromise. If you’re willing to accept that, then it’s great. If you can’t, then this isn’t the machine for you. But don’t forget this also cuts and draws. This might be useful and it may not.",
    "likes": 2,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Very good 👍I am a Chinese small format multifunctional industrial printhead UV printer manufacturer, and we are looking for agents worldwide.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "buen video gracias, sin embargo la herramienta para anidar ya no es funcional. aunque se instala en forma local todo parece indicar que usaba un hosting el cual ya no es funcional, todo el tiempo saca el error de tiempo de espera agotado",
    "likes": 0,
    "video": "Lightburn Tips I Wish I Knew Earlier!"
  },
  {
    "text": "You've reviewed the full spectrum muse in the past but these day I dont see it in your (and a bunch of other youtubers) comparison videos anymore. Is there a reason for that?... did something happen with them?",
    "likes": 0,
    "video": "How to Pick a Laser Cutter & Engraver - Flux BeamB"
  },
  {
    "text": "i would never put my laser and 3d printer in same box STUPID idea. when you cut the smoke leaves a film inside laser not what you want in your peinter",
    "likes": 2,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Honey you talked so fast I’m totally lost…..now don’t know what I need!😂 dang it! I know what I thought I wanted? But none of it counts",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "These are really overpriced, but it's a new implementation of this technology so it's expected",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "I do have a question I 3-D print little flat circles made of PLA black filament and then I engrave these with my fiber laser. Do you know if the Dio laser would be engrave on PLA plastic. Essentially the fiber, laser removes the color of pigmentation, leaving a perfect laser engraving that’s almost flat.",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "If I want to get darker marks on wood, is using paint a better way or adjust settings? For uv lasers like Commarker omni if this is an issue.",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "hey great tutorial, one question what about kerf? do you need to apply it at the end face by face? thank you regards",
    "likes": 0,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "Hi, what do you think about the commarker b4 20w for 2.5d engraving on metals? Is a 30w better?",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "what you lot are missing is.....what printhead does the machine use.\nink cost is irrelevant.",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  },
  {
    "text": "How thick was the coin thy you used? (And where did you get it 😄",
    "likes": 0,
    "video": "3D Engrave Any Image Onto a Coin (Step by Step Pro"
  },
  {
    "text": "They can also add a 3d printer to make it a 3 in 1 machine.😆",
    "likes": 0,
    "video": "How to Save Thousands on Lasers in 2025"
  },
  {
    "text": "@19:35 XCS is so much more complicated than Lightburn.",
    "likes": 1,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "If I didn’t have a laser already, it is an efficient way to start.  The bed size is a limiting factor.",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Reminded me of the bambu lab with laser. A black box.",
    "likes": 1,
    "video": "How to Save Thousands on Lasers in 2025"
  },
  {
    "text": "This printer is listed on bestbuy with 11 reviews and all the reviews have this statement: \"This reviewer received promo considerations or sweepstakes entry for writing a review.\"😏",
    "likes": 0,
    "video": "Do Lasers Ruin 3D Printer’s? Bambu Lab H2D Laser R"
  },
  {
    "text": "Currently saving for a ComMarker UV. I need something to handle really fine, detailed engraving on wood and glass.A mark on metal would be enough for now. Fiber is the second on my wish list.",
    "likes": 0,
    "video": "Which Fiber Laser Should YOU Buy?"
  },
  {
    "text": "Would add this to my wish list. Currently saving for a ComMarker UV. I need something to handle really fine, detailed engraving on wood and glass. Hope I will make enough profit for a fiber laser soon. Wonder how much f1 price can drop, sounds like a great news.",
    "likes": 3,
    "video": "How to Save Thousands on Lasers in 2025"
  },
  {
    "text": "remember 300 is the introductory price. It's proprietary system. They can increase it to 600 if they want, and all you can do is buy or sell your machine that nobody wants anymore",
    "likes": 0,
    "video": "$300 Ink?! The REAL Cost of the EufyMake UV Printe"
  }
]