[
  {
    "text": "Good breakdown. I watched this a while back on my tv and forgot to comment.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I love fusion 360 way more then sketch up. I use it for woodworking 👍🏽😊",
    "likes": 17,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "you can do some decent stuff on these things,  I use it to cut out my kids pinewood derby cars.   I have to use a jig to hold the block on and the limited z causes me to have to run the derby car block thru the table saw first to bring the height down and do it in 2 parts if its a taller car. \n\nalso with the laser, I've laser engraved a flour tortilla. LOL",
    "likes": 1,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Where did you buy your butcher block? Did you make it?",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "A plane with a larger shoe will make flattening top easier",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "That rounding with the CNC is NICE! Great build (and love the final result)! We found you on Instructables, by the way. ;)",
    "likes": 0,
    "video": "Building a Bluetooth Speaker into a Side Table"
  },
  {
    "text": "Depends on what you want to do.\n\nTo mess around and learn a bit while possibly making useful trinkets... these little machines are a good start.\n\nLow cost and see if you are actually going to do anything at all with it.\n\nWhen you find that the stuff you want to CNC carve is not going to be able to be done on the little machine, change it to a laser engraver and get a better CNC machine.\n\nThese little things will make some nice looking coasters and key chains and carve the color layered plastics for small signs.\n\nNot good for engraving brass really.\n\nIf you want to make a small number of thin aluminum sheet metal parts for RC models, the 3018 series CNC can do the trick.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "I do polished axes and blast the design on the head using vinyl as a mask. Would this etch the surface like sand blasting would?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "the engraving could be \"raster\" (the one you are using) or \"vector\", raster \"shoot\" on multiple spots and Vector follows the path, the firs is ideal to shades and the other one for silhouettes, you could change it on the software. gib it a try!",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Fusion rocks!  I tried Sketchup when it first came out and I hated it. Parametric modeling is the way to go. I’ve used Pro/ENGINEER and Solidworks at my various jobs. Fusion is free and does what I need and more.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Like your style. Well done addressing your errors and thanks for sharing. What was the tune when you were explaining about using glue and dowels (at 2 minutes) please? Thanks. 😊",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Thank you for all the information do you know if Fusion can do a PP as I have a DSP A18 controller",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Great video bro, that was awesome. What camera did you use that was about to record that long? Was there any temperature issue for the camera?",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Hi! What 's the color-effect of laser on black-finished metal?  Is it still black? Thanks!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I have a 6012 2.2kw machine. Yet to get my garage set up for it. Interested in a small machine like this, maybe a lil larger. What would be a dream machine with all the features you would want ?? Please link. This way i could keep my bigger machine for bigger projects.. ( now i wish i would have gotten a big machine ) \nWhat best engraver/laser for $500.\nWhat best in $1K price point.\nThanks!",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Laser input is 15 watts\nThe actual output is only 3.7 watts",
    "likes": 20,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "i do leathercrafting, can i use this on lasering text and simple designs?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I enjoyed this as well, and your candor at explaining mistakes (and not getting defensive in notes below) is super refreshing.  I signed up!",
    "likes": 5,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "I wonder if it would cut out wood veneer.  That's usually really thin.",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "buy some better safety goggles, you can still get light in around the sides",
    "likes": 3,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I've only made the 1 table and I made almost exactly the same mistakes. 😂",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "I hate YouTubers that make videos just to make money from. This laser is junk. unstable and too powerful for engraving. No seller or other co-seller don't tell you don't need big power for engraving. For nice engrave on cardboard or wood or leather 1 Watt is enough. over 2 watts burn and laser diode with big power have issues to focus. With 5.5 W u need minim 5 passes to cut 3 mm plywood, and edgy look ugly. This is just a commercial video. NO-VALUE for us!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "been using 360 for a couple years and still learned a trick or two, thank you!",
    "likes": 5,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Thank you so much for this!!!! I’ve used sketchup for years for all my projects but I wanted to learn fusion to take my projects to another level!!",
    "likes": 3,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Nice video. This seems needlessly complicated though when comparing to https://mapstyle.withgoogle.com where you can achieve the same effects, easier (at least when it comes to making laser maps)",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "what program do you use to create the grey scale images that you etch?",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "AWESOME! Thank you for your hard work and sharing this unique experience with us!",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Very cool!  Found your channel via Instructables and just subscribed.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "The air assist on C02 lasers is to keep the final lens clear from smoke residue and other contaminates.  It's to protect that lens for longer use.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Nice content across your channel! Thanks for making clear, easy to watch videos!",
    "likes": 1,
    "video": "Is a Budget $250 3D Printer worth it? Alfawise U30"
  },
  {
    "text": "Just wanted to thank you for sending me looking for \"Pulsar\" by Jakob Ahlbom. He needs the credit for the music. It was an awesome choice, really added to your great video. I had a lot of fun watching and replaying. Good work!",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Very nicely done. I realy liked it. Looks like a good project for school. But, as every flat earther can tell you, it's all fake. :-)",
    "likes": 7,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "OMG, you are soooooo talented, do you need a colleague? I want to make these things with you man. just wanted to say great job and pleaseee continue 😊😊✌",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Very close to ending up in the lake!  Cool video, actually saw 4 fighter jets fly by one after the other unless it was the same one looping around.",
    "likes": 9,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I'm surprised the aviation authorities did not come knocking on your door. Do you realize how irresponsible that was to launch in a populated area? There are things in the sky called jets and airplanes that this could have collided with - or got sucked into the jet's turbine causing engine damage or failure. So irresponsible.",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Is that a flat earth I see..?\nGreat video tho. Thanks.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "I would really like to know what those F-16 pilots had seen on the their radar scopes!!\nPretty sure there were scrambled to check out that object that was not declared! :D",
    "likes": 25,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I think the jet going by under the balloon while on it's way down was really cool. Great that it captured the sound as well.",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Get more lift with hydrogen and you can make your own just have to be a little careful.",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Ha, I only realized 20 mins into the video that you can pan and see all around...even after the video was over. That's pretty cool!",
    "likes": 117,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I think the military plane was not accidentally. Maybe it was scrambled to check who is flying. In such case your project cost rises significally (tax payers money.. ).. haha :)",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Wow, it could have been a lot harder to find if it went into the trees.  Into the sub station I bet you'd never get it back.",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "I wonder how high it did went up before balloon pop",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Nice views with the camera glad you were able to recover it.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Wow that's cool. How much did it cost to send yoda in to space. I wouldn't try that here in greece because it would end up in the sea or top of a tall mountain 😆",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Do you do all these cuts freehand? Or how do you program the laser to cut?",
    "likes": 1,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "That is so cool. I didn’t realize you could move your phone and look around. That was really cool. I especially liked the launch and the balloon popping. \nIt’s great to see you finally made this happen. I have been listening to your tribulations on the podcast. That was a ton of work!\nThanks for everything you share!\nStan",
    "likes": 9,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "nice timing the piano note to the balloon popping. nice touch! @ 0:54-0:55",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Im at a total loss for words. I got a rylo for a few 360 vids and some better b-roll on my channel and this video completely kicks my a**. Kudos man, this is phenomenal!",
    "likes": 3,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Excellent work!  You can pause the video and still pan around the full 360 image which is one of the best bits of 360 video for me 😊",
    "likes": 2,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Can it cut stainless steel sheet metal? About 1mm thickness?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "That is so fantastic, Brandon! I was hoping to see a jet fly by...",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "The 360° view at the end is really cool—great job!  I’ve been hearing about this project and your setbacks for a few months now. Glad you were finally able to pull it off.",
    "likes": 11,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Your video is good and the final product turned out nice. But for what demographic is this? I don't know very many people that own their own jointer or planer. Unless that's your job or something you do quite often. I have a whole Workshop of tools and don't own a jointer. Maybe simplify it a bit for your everyday average guy. Other than that it was a great video.",
    "likes": 1,
    "video": "Build a Baby Gate (for cheap) // DIY Woodworking"
  },
  {
    "text": "This is all sort of awesome and the view is absolutely breath taking WOW!!!! Thanks for sharing your ups and downs on this one.",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "If you are watching this on a mobile devise you can spin around and see everything. Mind blown.  Well done.",
    "likes": 5,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "That was epic. Loved seeing baby Yoda spin around.  Amazing how small we really are compared to the earth.  Thank you for sharing.",
    "likes": 5,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Brandon, this was incredible!!  I mean ever launched a balloon like that, but I want to watch all your other videos on the subject LOL. This is way too cool!",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Pretty sick - and you picked a great day for it!  How'd you track it down when it landed?",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Almost landed in the water.   Guessing you weren't planning on swimming for it.",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "That is really cool wish the GoPro would have worked but still cool.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "I liked the 360 and being able to pan around. cool!  I've been wanting to do one of these for a while. Living near DC and its no fly zone make it a difficult process to make sure the launch and landing occur far enough away from DC.",
    "likes": 2,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Why didn't you upload all the footage from when you released the balloon?",
    "likes": 3,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "Civilian GPS trackers are typically restricted to working under 18km, 59000'. That's to stop people like Joe Barnard from making operational ballistic missiles in their back yard :P \n\nhttps://en.wikipedia.org/wiki/Coordinating_Committee_for_Multilateral_Export_Controls",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "So great man Id love to give this a shot I almost cried seeing the footage from that it’s so beautiful the perspective you get",
    "likes": 3,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Well done.  I've been following your updates on your podcast.   I'm surprised there aren't more regulations on doing something like this.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "Hahah that was awesome! Your neighbors are probably like wtf! Haha",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "What did you do to split the grayscale image into each individual layer?",
    "likes": 1,
    "video": "Laser Cutting Eleven's Head From Stranger Things ("
  },
  {
    "text": "I would be very careful in buying from them.\nThe first time I used one the 3D printed part broke down, after some hasles they sent a replacement part which arrive broken, on sending them an image of the part, I have since had no replies to emails. I must say that it was the worst 3D printing I have seen, holes everywhere.\nThe Machine they sent me was nothing like the one being shown here.",
    "likes": 1,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Maybe it's been answered... Breadboards obvious purpose is to help maintain the flatness of the top. The term comes from the style of the old bakery's cutting style boards that used similar construction.  The long table top looks like a giant breadboard.\n\n😃",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Will you upload the lightsaber model somewhere, i'd love to print my own.",
    "likes": 2,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "Thanks for sharing! Your CPM is in line with what my well performing videos get",
    "likes": 0,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "Love your channel ❤️ working on building a diy  laser cutter! Fanatic information!! 👌",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "I'm about to say something that will make the wood movement police go crazy. But whatever. Lol. My experience supports it. \n\nWood movement... It's a \"common tale\" that as external humidity changes, so will your projects... Well... That's honestly not the case if you have your home well insulated and at a consistent humidity. Which most houses are. Most antique furniture doesn't break from wood movement when sitting in a house.... They break from wood movement when people put them in garages and barns where there is no climate control. Then the wood movement starts setting in and everything gets all crazy. And also .. wood movement can be overpowered and controlled. Just look at high quality sheets of veneer ply. \n\nIf you are building something for an interior job, honestly it will likely shrink a little over the next 1-6 months when bringing it in from your shop (especially if your shop isn't well controlled with it's humidity and temperature .)\n\nI've sold very expensive veneered signs, laminated chess boards with highly figured cross grain, and even tables with cross grain on them. As long as you expect a little shrinkage and it's gonna be climate controlled.... You honestly don't need much for wood movement. \n\nYou don't believe me? Go to the Las Vegas airport and go to the Jamba Juice inside the terminal. There is a hickory table there with no proper breadboards, held all together with glue and dominos. Breaks all the rules and it's perfectly flat and strong with perfect joints. \n\nAlso, the Samurai Carpenter and many of my fellow pro woodworker friends agree with me. Yes wood moves. But not as much as people think on indoor furniture. And a little known fact about wood glue.... It's actually not a true solid once cured. It can allow for a surprising amount of wood movement and shifting and still keep it's bond. Honestly man you could have just glued and mortise and tenoned that baby on for the breadboard. The bigger issue isn't the breadboard... It's the fact that you are using construction lumber. The 2x6s are gonna get way more contraction than just going down to the hardwood store and buying poplar. And it actually will be surprisingly similar in cost. But the moisture in that framing lumber may be enough that it blows that a perpendicular wood joint out. But if you are using dry high quality woods... My statement stands.",
    "likes": 3,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "What topic did you registrr your youtube-channel under? Or do you know from where Youtube picks up what kind of channel you have to get the right kind of ads?",
    "likes": 1,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "Good breakdown, Brandon! Thanks for sharing your numbers and some good things to look at.",
    "likes": 1,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "Very interesting.... ! I hurried a look at subs per the top 20 you had listed, looks like maybe over 50% from the top 20 videos... that seems pretty good to me.",
    "likes": 2,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "$12 CPM? What the how? I'm lucky if I get anything above $2. When my ninjago videos took off, I got over 1.1 million views one month and the total for those was $114 in revenue. You're doing a lot better than I am. Congrats.",
    "likes": 2,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "Very interesting and thank you for breaking it down so anyone can understand.  I too have affiliate links with Amazon and my channel has just been monetized.  Looking forward to 2020 to see where it will take me.",
    "likes": 1,
    "video": "This is How Much YouTube Paid me for My 300,000 Vi"
  },
  {
    "text": "When the laser bulb wears out ...how much are replacement bulbs?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "Great tips. I made some of those mistakes on my first as well :)",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "How much was the overall cost of this project (assuming you picked the right stain the first time)? My wife wants to buy and I want to build. Trying to figure the cost benefit.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "I've used Fusion for some time now and I wondered if I should make the change to SketchUp since it is so popular. You've just convinced me to stay with Fusion, I can't imagine working without parametric design, I thought it was the standar.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "what does that gear at 8:53 do? sorry for the late comment :)",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Check out Law Tactical AR-15 folding stock adapter. That has quick latch and de-latch mechanism and it’s extremely sturdy",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "Great video. Thank you for sharing!\nAre you planning on making a video of how to design and cut a topographical map?",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "i know it can engrave aluminium but can it engrave harder metals like steal? i'm looking to engrave knifes, will this engrave a knife blade? what type of metals can it engrave if so?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Fantastic information.  I'll probably try something like this with my cnc router.\n\nI couldn't help but think that is one massive freeway right next to campus.",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Enjoyed it, Brandon! That was a great walkthrough of how to do this type of thing. I think I'll try to come up with one...maybe where my wife and I got married. One thing I'll have to get over as a hurdle is that the Glowforge doesn't recognize clipping masks. Not sure how to get around that in the software.",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "sketchup is more used for architectural building ; fusion for manufacturing",
    "likes": 12,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Hello, do these work on titanium? For example a titanium dog tag?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Looks like a cool machine. It cost half as much as the CNC machine I built myself. My machine is a bit bigger and more robust. Was a whole lot more work than assembling a kit. So this is far cheaper and easier to do. Which makes it a lot more accessible.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "What is the laser power of this machine? Thank you, It looks very cool",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Would this work on unbaked polymer clay or baked polymer clay? It’s basically plastic",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "VERY inspiring!!! I am actively gathering ideas for my own tool wall and like how you added the light above, sticker section, and the contrasting colors with your logo centered. I appreciate your work and this video! Also enjoyed your presentation style so I subbed and look forward to checking out your other content. Thanks!",
    "likes": 0,
    "video": "How to Make a Simple Tool Wall for a Garage Worksh"
  },
  {
    "text": "Hi, do you have any advice on choosing between the 7kw and the 15kw version of the engraver? Thanks",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Please forgive my ignorance, I am a little confused as to what the jig does as opposed to the standard sliding adjustable guide that came with my table saw, other than holding the board down.",
    "likes": 0,
    "video": "Cut Straight Edges without a Jointer on the Table "
  },
  {
    "text": "It always looks easier than it is. 10 years in my business making what you made, Great Job!!",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "I was hoping it would have a sub-woofer channel snaking around inside and coming out where the tweeter ended up.  Oh well.  Great build!  Thanks for the video!",
    "likes": 0,
    "video": "Building a Bluetooth Speaker into a Side Table"
  },
  {
    "text": "Hello do you know the life span of laser unit ? I would use it for small buissness so can you guess how much it will last ?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "I picked one up over the holidays based on your video here and I've gotta say I dig it. I'd love to see an update with some recommended settings for various materials and your testing process. I created a gradient to test grayscale conversions and engraving but never got a good photo image from it. Vector images are no problem though.  Thanks for what you do, I love the podcast, once I get a few videos up I'll message you again.",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Yo! Those \"vcarve\" bits are NOT \"vcarve\" bits....lol....Those are ENGRAVING bits. Not meant to go very deep at all.....",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "There is only TWO reasons you moved over:  1) You've got loads of money -- (Like $400/year!); 2) You don't know about Blender!",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "i made something like this and used it to duel with my friends. I made mine so it can switch from closed to open really fast and it works well",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star "
  },
  {
    "text": "If and when the laser, touchscreen, etc. go, does the whole unit have to be mailed back like with the Glowforge, or is it something that the owner can do?  I heard you said that yours had an upgraded laser; did you swap it out or did you buy it that way?  What is the maintenance involve; how hard is it to clean and maintain?  I am not tech savvy and worry about things breaking down...",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Can you or anyone else let us know what the lifetime is on the diode lasers. I know it differs but on average what would the life time be for the ones you reviewed. Would make a big difference for making a decision on a purchase. Thanks",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Ouch my eyes! Never point a laser at someone's eyes. Have you learned nothing?😜",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Time for air assist, you'll cut those cuts probably in half",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Informative video. One thing I want to add is that you should always be wearing laser goggles when The machine is on. This is true even if the laser is in low power mode. Even in low power mode I'm sure it could blind you instantly if you got a reflection just right. Given the price level of these things are built to it's also entirely possible for the laser to just go into high power mode on its own to do some sort of circuitry or programmatical failure.\nA good quality set of laser goggles is probably the most important thing you can buy when dealing with anything laser. Also make sure it is the right goggles for the wavelength of laser you are using.",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Check the description I believe you have the number of the laser module wrong or the link is wrong  it goes to the A40640 not the A40650 that you have it listed as",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "How about compared to the Sculpfun S9?\n6W laser power but effect is 90W CO2 laser.\nLike to hear your review regarding this.",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Is there a way to get the test file you show at 06:12 ? The one that show the results for multiple passes?",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Is there a link for the lite burn site? I had problems with the grbl site u mentioned",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I’d be curious how this would compare with a k40. Obviously the enclosure and being about to use lightburn are big differences, but I’m trying to decide if I get a k40 or upgrade the module on my Ortur LM2",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "If I get an MPCNC going I want to put a laser on it and this seems like the one to get",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Which laser will engrave on food. Good example cakes.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Blugh on the NEJE minus the dual laser beams. :) But, as always, your review videos are top-notch and I aspire to make mine as cool as yours! Esp. the lighting... you've got that down pat dude! This content creator would love to know your studio setups.",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Are you doing anything to exhaust fumes… Nevermind, you just said.  😂",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I noticed you didn't do your normal tests with this review, how does it compare to the Atomstack X7 pro?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Wasn’t the xTool D1 achieving a 0.08mm x 0.08mm cut line?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Hi. I'm unable to download your test burn files. I've attempted a few times and am not getting the email for them. I verified that it is not hitting my spam folder. Is this download not working?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "on the short 2s pls, u can use the included leg holders that keep it from wobbling!!",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I was really interested I this laser because with the optical power and the tiny spot size it should be able to deliver 6000W/mm^2. \n\nBut now I’m not so sure. Do you think smaller spot size could achieved by refocusing it? Or is that as good as it gets?! \n\nThanks for a great video.",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Awesome.  Do you have a flat-bed scanner?  That would be a great way to share the results of your test cuts.",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I love the dual Diode Laser idea...next year we'll have 3, and so on... Wondering if Ortur makes a 2 Laser replacement for their Master 2 system...",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "I need a Lazer for back glass removal on iphones, they appear to be fiber trype lazers but could any others work? needs to melt glue through a glass back on a phone.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "if this could melt glue under iphone back glass is buy on for sure!!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Do you have the file for the engraving and cutting test available?",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "The Comgrow Z1 is even worse. 4 thumbscrews and 2 U channels. I'm working on a better method.\n\nI took the red shield off of my Z1. It was getting crudded up w/ debris. For cutting thicker materials it also gets in the way because there's only a 2mm gap at optimal surface focus.\n\nI made a temporary enclosure out of cardboard and piped in a 170cfm (advertised flow) exhaust blower. It's not ideal or the safest enclosure material, but I never leave the laser unattended when in operation and have a small ABC extinguisher nearby. The blower is marginal for extracting the smoke, but that's likely due to the \"enclosure\" having an open front.\n\n\nMine is good to etch at faster than 9000, but at those speeds I haven't tested the accuracy. For slate coasters, it will even produce a textured surface at medium speeds.",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Brilliant episode, many thanks for this invaluable information.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "How about use laserweb? Have you used it on a raspberry pi to run your laser cutter like octoprint for 3d printers?\nI haven't tried it yet myself but I have it installed and ready to connect when my laser comes in.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I've worked with wood since the early 80's and now I have pulmonary fibrosis which will in time kill me. SO now I am looking for something different to satisfy my creative nature. I am thinking about acrylic and this low cost cnc might just be what I need. With acrylic there is shavings but no dust to hurt my lungs,",
    "likes": 4,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Your link to the laser gets to a 404 page. OOPS... THE PAGE YOU LOOKING FOR CLOCKED OUT!",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "The issue with glowforge, as great as their machines are, is the software. \nIts cloud based and if the service ever has issues or goes byebye completely... well... you cant use the glowforge anymore.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Can you use lasergbrl? I have not really gotten into gbrl settings yet. Can you do different burn strengths also?",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "just one thing that id like to point out! Your version \"Reviewer Version\" Brings the 3 laser modules but when a regular costumer buys it we have to choose wich one of the three we want and each separate module is arround 200€",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "can you use it to engrave your name in power tools?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "Wish I could say I'm a fan of Full Spectrum.  Bought a Muse Titan clearly no QA process at Full Spectrum prior to shipping....gantry was even missing several screws and customer service after the sale....good luck!  Such a shame for the price they charge right now it's a very expensive and very large paper weight.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Wish I could say I'm a fan.  Bought a Muse Titan clearly no QA process at Full Spectrum prior to shipping....gantry was even missing several screws and customer service after the sale....good luck!  Such a shame for the price they charge right now it's a very expensive and very large paper weight.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Complete newbie to laser cutters- is it possible to upload images and have the laser cut around the outlines of the images on felt? If this cutter isn’t able to do that, what would be a better option? Any tips would be much appreciated. Thanks so much!",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I would like to know how long the diodes last.  At $600 it's seems like a good intro deal.\n\nI know that the co2 laser cartages have a limited life span (whether used or not). I think they have a 2 - 4 year life and have big costs for recharging. But do cut faster and thicker material.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "I got in on three Kickstarter projects . All three took over two years, one was d.o.a. I was sent instructions for soldering a battery connection. I will never participate in any mass funding project ever again. Socialists have no time frame or required to provide good quality. Free money right?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I'm interested in using one for back glass removal on iphones. Lazer- pecker is another one I'd like to try:) thx for the video 👍",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Wow, they jacked the price up $200. Maybe the review you gave it, was too good, lol.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "I am primarily looking for a laser engraver to cut paper (intricate designs that would be difficult and time-consuming with a knife/scissors). Would you recommend a diode laser? Have you tried the Two Trees brand?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "What software do you have to use with this type of laser?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Would you have any recommendations for 100-130w CO2 lasers? Did you like the omtech? I had been looking at king rabbit, but doesn't seem very popular. I don't know if it's because hl yeah and the r\ned and black are much cheaper. I'd love to see a video with lasers this size. There are so many producers.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "@Make or Break Shop - Did you sand or plane the inside edges?  I saw you planed the outside edges.",
    "likes": 0,
    "video": "Building a Picture Frame Ron Swanson Would be Prou"
  },
  {
    "text": "Hi do you know when the ortur double diode version is coming out?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "Hi … Iv been watching ur videos… Thanku… I would really like to etch acrylic… is this machine suitable?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I am lost but have about $1,500 to invest in a laser to engrave and cut. Please give me some direction, what would you recommend?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "can i have the model number of the machine that appears at 15:46",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great informative video & some good viewer comments to learn from. I am also a rookie when it comes to finishing butcher blocks but this helped a lot.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "great review. could you suggest to me a machine which would be good for making logos on chopping boards or hardwood? we usually make wooden utensils and need to do company logos on them, which we get outsourced. thanks",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "What's the point of toys like this, if you can't cut 12mm steel with it then it is just a toy... :D :D",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "On the website, the 2nd version is able to cut, and I watched another YouTube video demonsrating cutting wood. This is the statement from the website: \n\n\"Thanks to the 5W semiconductor laser with the upgraded version of compressed spot technology\nYou can have a higher standard and more powerful laser cutting with LaserPecker 2. Wood, paper, acrylic, leather goods with a thickness under 5mm.\"\n\nThe website also provided images as well,",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Dude your content is awesome! I bought the xtool d1 and your info has helped me leaps and bounds keep it up man!!!",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can you recommend a Non chinese, affordable laser cutter? I am a hobbist, dont want to spend too much money. Thank you.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can you recommend a reliable and cheap NON chinese laser engraver for a hobbist. I dont want to spent too much money on a LE, because I just want to discover how it works, but also not a chinese bargain. Thank you.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I’m looking for an affordable laser. That I could use to cut acrylic sheets. I would like make acrylic jewelry. For example name plates. Could you point me in the right direction?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Will a model be available in the near future capable of engraving bare metal surfaces? The cost would increase considerably for such a device, but would be worth it.",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Bro you look like the guy in the \"like a Bosch\" commercials !\n...Shawn is his name...\nYou have to try the mustache 🤣🤣🤣",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "hardware woodworking project for teen woodworking .",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Nice device. How does the beam remain focused when scanned from the vertical? The focal distance will change from the center (vertical) to the outer limits of the scan, so is this corrected for inside the scan head?",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Scalpers suck. Can't find one under $500 with dozens of copies going around the same price",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Would you say the Muse 3d or the glowforge pro is better?",
    "likes": 2,
    "video": "Should You Buy a Glowforge?"
  },
  {
    "text": "Does anyone know a link for any uk sellers of the Laser Muse 3D? I cannot seem to find any!",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "I would like to use it on polymer pistol frames. Do you think it will work on them?",
    "likes": 1,
    "video": "SparkMaker LaserPro: The new King 👑 of budget las"
  },
  {
    "text": "I know basswood is pretty soft, do you know how well this would engrave hardwoods like maple or walnut?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "So which one do you recommend for a beginner. The Atomstack A7 or the Ortur LMP?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "I want to engrave yetis, would this work? Would u get a 10w or 5w or would it necessarily matter ?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Ive owned the aeon lasers and they are just Chinese lasers with features.  Still junk really.. I finally stepped up to the epilog fusion pros and while I dont recommend people spend 50k on lasers, they are really in another league when it comes to lasers.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great video. This is very helpful. I am looking to purchase my first laser unit so this is part of my research. Have you looking at or tested the SCULPFUN S9 Laser? I would like to know your thoughts on that unit if you get a chance.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "What would you suggest for a laser if I only wanted to cut acrylic sheets? I'm leaning C02, but there's not a lot of videos that specifically state \"if you want to cut acrylic, this is the laser for you\".",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Which is better between diode lasers and CO2 lasers to engrave on acryclic to make edge lit LED signs?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Yet again China using Kickstarter as a sales strategy and you guys blindly support and encourage. Pride is underrated when you can save a few dollars right,  I'm not saying it's a bad product I'm just saying ill never buy it because of the unethical sales strategy.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Will I be able to mark silver? so I have lines to trace it with my hand graver?",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "uh oh so many personalization options  in this modern age ...  you need everything to be personalized and have your name engraved on  all your objects  only then you will find true happiness ...",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Thank You! Way cool informative video' and your really cool also!🖖😶👍",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Great video. Thanks for posting it. This might be a silly question, but why is that diode laser don’t have enclosures like the other kinds? Do they not need ventilation too? Thanks again.",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "We have a 2k ££ limit what machine would you recommend?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "It's looks partially photo shopped.   Look at the end of the black cord, it just fades, and the logo on the container. The edge of the container doesn't line up.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "any reason for that container to hang in front of the camera all the time?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Afternoon Brandon can you do a sample how it will do on a yeti 32oz Please I want to know how it will perform.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Great review.  But \"Potato\" is not spelled \"Potatoe.\"",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Comprehensive. Great video. Answered a lot of questions.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I have same machine 10w I notice you more images on your pulldown menu than mine and I did upgrade firmware, still same group of images. Any ideas?\nAlso is there a site to download free images 😃 I did buy this after watching your reviews",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Very helpful video\nI appreciate all your efforts\nThank you very much",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "DAM VOICE-TO-TEXT I TRIED TO SAY EXCESSIVELY EXPENSIVE",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I SEE GRIZZLY TOOLS HAS ADDED A NUMBER OF GREAT-LOOKING BUT EXCESSIVELY LASER CUTTING MACHINES THAT YOU MIGHT ENJOY CHECKING OUT , I KNOW I WOULD ENJOY THEM BUT I AM NOT GOING TO SPEND THAT KIND OF MONEY AND OF COURSE I'D WANT THEM MOST POWERFUL NOT KNOWING WHAT I WOULD COME UP AGAINST IN FUTURE AS I AM INTO CUTTING METAL. NOT WOOD OR PAPER OR PUMPKINS\nD . A . G . BOULDER COLORADO USA .",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "So can you ACTUALLY use this machine I mean ACTUALLY. lol",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "if you change the way the unit engraves you could use just the small size",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I’m looking for an engraving machine that would engrave stainless steel. What would you recommend?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "This is the first laser you could use for graffiti. Just hold the thing. Also, with a camera you could weaponize it. Nifty. How horrible.\n\nBut seriously about the graffiti thing it's potentially awesome.",
    "likes": 4,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Do you recommend it for cutting polyester twill fabric ?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Your videos are the best. Thanks for all your time and effort on them.\n\nQuestion: what parts of a laser (let’s say a diode tier) will need to be replaced on an ongoing basis?",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Do you know that only a few years ago it was not legal to sell lasers such as this without a heavy duty enclosure? Do you know why? Because of the high radiation levels they emit. Your leaders raised all of the radiation exposer limits so high that companies can now sell these death machines. Enjoy.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I'm between this and the D1 from XTool. Now that the D1 can use lightburn, which would you say is better for the money? I will mainly be using it to engrave metal, wood and leather.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Like I'm not trying to be mean or anything but if your someone who makes stuff out of wood for a living shouldn't you be at least able to make a good looking wand cus they look like mushrooms along it, Im hand carving mine and it's turning out really good and I only do woodwork in school like these people on YouTube should at least try and make it look more natural and stuff",
    "likes": 0,
    "video": "Making the Elder Wand from Harry Potter out of Wal"
  },
  {
    "text": "hi just wondered if you had heard of the gweike cloud. it is very similar to the glowforge and makerbox but much cheaper, would you think you might take a look at one for a review cheers Tim",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Did it land in the same place where it started??if not how did he find it",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Great vedio!  Thanks!  Question, looking for a good quailty laser, a little on the higher end but trying to stay under $5k. What would you rocommend?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Sure i'm not the first to comment on this, but all of you outer tongue pin holes should be elongated along the width axis of the table, otherwise they will fight the expansion of the wood and you could end up with some weird movement.\n\nAlso, offset the breadboard holes 1/16\" out compared to the tongue holes so the pins actually draw the joint closed when they go in (called draw boring).\n\nObviously this is more of a \"tips\" video than a full on how to, so you probably already knew/did these things. Just thought i'd share in case you didnt :)",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "A bunch of reviews said the software updates change the lasers parameters and skews the designs and script. Was that corrected?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "You are joking right? a 5W for 1200? granted i see a big use for the portability but 1200? Was looking at a 3 axis CNC for that price range a few more $$ and you can get a 7 watt laser output attachment way over priced.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Would this be better if you could get air supply in??",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hi, what laser engraver do you recommend for engraving coasters like wood, glass, slate and materials like that ?\nI will only be working with coasters. For home gifts. Thank you. Go Army.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hey quick question. what file should I use for me to write quotes save and engrave ? I can’t figure it out if I write something or costume make something and save it is telling me not fund on file need help please",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "just a head up it is not a good thing they only run on ther own softwear why are you trying to sound like its a good thing ????????????",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Thanks for the great tutorial! I recently bought an SVG file from a shop on Etsy that custom creates these sorts of maps, but I'll have to try this out myself next time.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Use this to rapidly make permanent business cards on or next to the cork boards that let people hang up their business cards.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I’m very interested in the size of your shop. I also have a small space that I’m barely turning into a shop. It’s a 12x12. Sometimes I question if it’s going to really work out. Can you show give us tour thru you shop? I’d like to see the layout. TIA",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box"
  },
  {
    "text": "I would love to see some more practical engraving examples ... YETI mug, glass, black granite tiles",
    "likes": 41,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Sounds like he's more of an 'unboxing guy' than a tech guy.",
    "likes": 4,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "But will it cut 1mm Ti sheet? Asking for a friend...",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Hi. I am looking for a Lazer engraver that can work on plastic, stainless steel, aluminum, iron, surgical steel. How hygienic is an item after it has been engraved and sterilized?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "is that bad for your eyes seeing the raw blue lazer like that??!?!?!",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "would you happen to know how the laser can last if a person buy this product how long to you think a person can keep creating projects before the laser goes bad or need replaced",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Love your videos! Can you tell me what laser brand and size to start a business solely engraving large wine bottles? Size range from 3” to 8” in diameter and 12” to 24” tall. I’m assuming a rotary attachment is necessary..\nMuch appreciated \n\nJP",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I’d rather be hardwire to the unit that is compatible with Lightburn than having wireless capabilities using their proprietary software that can’t do much for $700.00. Sorry, let me know when that happens otherwise it’s not worth it.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "do the lasers ever run out like buying a machine like this or any other ones how long does machines likes these last",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "You really need to pay attention to what you say, particularly with numbers.  Is it .16mm or 1.6mm?  You said both, and multiple times each.  And is the coverage 100mm or 1000mm, because you also said both.  Numbers matter.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I have been waiting for this to unlock the potential I needed an engraver for",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I asked my wife to get me a Laserpecker for christmas. Her response was \"Hell no, you aren't sticking a laser pecker in me!\"",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I LOVE YOUR VIDEOS! I’m about to buy a laser. Should i get the xTool (10w) or the Foxalien Rizen 20w?? I haven’t seen your vid on the foxalien so I’m jw!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "Great review. I didn't hear anything about cost? That would be nice in a review.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Great review. I've been waiting for galvos to become affordable. Great trend right now.\nAt 13:17 you started saying the width was 1,000 mm. Is it really 100mm?\nI finished the video and you did say 100mm. Nicely done. I'm hoping we see a lot more galvo laser offerings and reviews from you. thanks!",
    "likes": 3,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Wow expensive. Seems like this also cries out for a vacuum table to suck down the card stock. I take it the base can be removed and it screwed to your own base that might be a vacuum table.",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "So if you slide something through that slot, it won't be in focus.   Because the focus point is below the cover.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Can you please share the ironman helmet template's link?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?"
  },
  {
    "text": "I think your  speed units are wrong. 11,000 mm/sec should be 11,000 mm/min.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hey Brandon, great video and content, I didn't know about this til now. I have a question for you, I recently bought the Atomstack a5 pro and I noticed the x axis where the laser module mounts there is play in it where it rolls on the rail, not sure if I'm describing this right but simply put is the suppose to be play in that? It can rock back and forth but the few tests that I've done it doesn't seem to be rocking, just smoothly rolling on the rail.  You're my go to laser guru. Thanks for the help and God bless you and your family and our entire YouTube family.",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "So does it have a F-Theta lens to be able to focus flat over the whole work area??",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "ORDERED THIS AND PAYED  FOR IN FULL OVER A YEAR A GO  , IT STILL AS NEVER  ARRIVED!!!!!\nPLEASE PLEASE DO NOT ORDER OR SEND ANY MONEY TO THIS COMPANY.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "ORDERED THIS AND PAID FOR IN FULL OVER A YEAR A GO  , IT STILL AS NEVER  ARRIVED!!!!!\nPLEASE PLEASE DO NOT ORDER OR SEND ANY MONEY TO THIS COMPANY.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Have you read the comments on Kickstarter?  Very very negative.  Makes me concerned that your review makes people trust the company and they get disappointed by the actual purchase security.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "what about safety? remains a laser, stronger than 0.5mW, so it is a class 4 type? Is there a warning on the device? Not sure if you can even sell this officially in USA since safety with lasers is a must and most of these chinese lasers look great, but if you loose an eye, then nobody home in China.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "When cutting plywood with a 10W machine like this, what is better - setting it to a higher power and doing fewer passes, or going for a lower power with more passes?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Thx for your preview appreciate it. What about engraving realistic picture in nearly photo quality?",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Very informative review, thank you.  Will this cut 0.75 Baltic birch?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Hey i have been using a xenetech 912 (it has finally died 😩) I make plaques and i don’t want to spend 10k. Any suggestions of a machine ?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Would it be easy to do tiling with the D1? I would like to use it to cut patterns in fabric but the cutting area is a little small for my use.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Thanks for your review.\nThe correct term for the \"bit\" is a cutter.\nThe big negative I saw was that the lead screws are not protected from dust and swarf, especially the Y screw (under the table).\nThat would be my FIRST thing to do is cover it.\nI would imagine the accel/deceleration can be changed.  You just do not want to make it too short of the steppers will miss steps.",
    "likes": 1,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Tks for the review. How will a Newby like myself know of the upgrades ie short coming to do something about them. Seems like  a pig 🐖 in the bag buy.  \nPlease advise of a functional buy as I would like to print large items.",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "If you ever want to give away a laser set I would not mind being a recipient!",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Mas"
  },
  {
    "text": "How does it perform on hardwood materials just purchased one and the end result is very patchy on some reclaimed oak flooring",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Wow! So I can actually take this laser etcher into a bar, have a drink , proceed to the toilets and laser etch a penis onto the wall?? What about air assist?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Nice video on a cool little laser! Looks like it’s performing well for you, too!",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I like the machine, hate using phone apps for creative work. Can you use it with Lightburn or other desktop software?",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "That laser looks really cool, however, would you recommend it to someone who has never used a laser and is looking for a small one to learn with? Thank you for your time, Gentle Hugs",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  }
]