[
  {
    "text": "What the fk is with the “ up talking “. Are you a soy valley girl?  “Um the laser is COOLED? The diode is SLOWER?  🥴",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Talks too fast, he assumes his audience is as knowledgeable as he is about laser engraving.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Wouldn't buy cohesion 3d boards they have NO support and you don't set wattage with the meter you set millamps  as for control boards I know took my cohesion board out and got a board that has support",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Goodness, that's a lot of fun toys! Just out of curiosity, how many amps do some of these machines pull, from the 20W or 40W desktop Diode, RF, or CO2 to the industrial heavyweights - speaking as just a homeowner with a small shop who would love to have 1 or 2 of these!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I can see using this and a CO2 laser together. The CO2 to cut the blanks fast.. and the XTool for the Engraving/Metal functionality",
    "likes": 2,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Interesting technique, but the final result looks for all the world like it was just simply printed onto the wood, or maybe printed in a layer of wax, then stained and the wax removed.\n\nWhat makes inlays look good is that you can see that they are inlays, you can see the amount of work that went into it, the precision, the tediousness of the process. That doesn't show here at all.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Good video, but it actually made it harder to choose what laser to get. Didn't realize there were so many different kinds",
    "likes": 17,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Can the same CAD software be used, whether your final material is wood, plastic, or metal?\n\nFor example, some CAD software is tied to the shop that will fabricate it..  eMachineShop or Protocase Designer CAD..  but what if you want to do it first in a different material?\n\nWhat CAD software do you recommend?   From what' I've seen:\n\nFusion360 is great for design, but the cost/license might be a deal-breaker for many \nParametric (i.e. ability to undo as many steps as you want) is a must-have feature\nFreeCAD might be a bit difficult for the beginner\nOnShape supports exporting without having the $2500/year license\nPro/Corporate Users should stick with Siemens Solid Edge , Solidworks, Catia, Pro-Engineer\nThen there's other that don't have nearly as much users.. Moi3D, OctoPrint, etc.\n\nbut for most beginners, it seems TinkerCad and Plasticity are the solid choices?\n\nBTW, do you recommend any low-cost 3d printer service?  Sculpteo , Shapeways, CraftCloud, xometry, protolabs?  How about for CNC / Laser ?",
    "likes": 0,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "I'm just getting started and I'm looking for a laser that will cut double sided tape. Probably need a software to cut out all the letters. What would be best machine for something like that?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Looking into this laser, how much space do you have to engrave if you don't get the raiser base? Will it cut through 1/4\" ply in one pass? Do you when when the conveyor is coming out?",
    "likes": 1,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "the title is \"How Good is the Atomstack Hurricane Desktop Laser\" yet you slip in that it's not a review, so so anyone skipping around may not see it. Not cool. The title should reflect what it is, and \"how good is it\" certainly implies an assessment/review.  my $.02",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Can anyone help me please?! What’s the best laser engraver for me I just need to burn my logo multiple times on the back of 18mm Mdf (200x200mm wxl) but quite small logos. Am in the UK.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Notice that missed step.  Thanks.  Looks amazing.  I’ve got to try this.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Do you have any idea if there are removable areas that will allow the OMTech 80w pro 2440 to fit through a residential door??",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I would love to see a side by side speed comparison that isn’t fast forwarded or sped up. Or take a cutting job and compare completion times with CO2 lasers",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "This video has helped me out so much, I went from zero knowledge to knowing what to do right away. Thank you so much",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "RF lasers are only new for hobby grade machines but is an old standard for sign making lasers and are common among architect model builders. SYNRAD have made CO2 RF lasers since 1984. For detail work it really beats glass CO2 lasers by far. RF lasers can be operated from 0-100% duty cycle and a glass tube laser (10-15)-100%.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I struggled to get halfway through your video and now I need at least 12 hours of COMPLETE SILENCE...\nI haven't seen something this hard to listen to in a long time...",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Youtube is ruined with all the dick heads shilling for china. Can’t trust anyone",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Question ..newbie here..is light burn software that part of your laser cutter or is it a editing tool any laser cutter can use..",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I think this is good information, but you are taking to fast. Slow down and stop the frequent editing.",
    "likes": 0,
    "video": "3 Levels of Laser Engraving - Beginner to PRO"
  },
  {
    "text": "Is this Co2 laser suited for cutting jewellry?  I was under the impression a fiber laser was the better fit for cutting sterling silver into names for necklaces.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I have the xtool M1 and it was great until the laser head started falling out. I've been emailing support about it, but they definitely lose points for not being able to buy spare parts. You have to email support about any problems and hope they will send parts. But if they do send the parts and send them for free, I'll give points back. lol",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Best video yet for beginners.  This video really helps.",
    "likes": 5,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "@ 2:40 Absolutely EVERY cnc based product like 3d printers, laser cutters/engravers, etc. will ALWAYS be g code based.",
    "likes": 1,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Thanks for a great review! I took the plug and ordered this machine.",
    "likes": 0,
    "video": "Great Deal or Overpriced Hype? - Carvera Air CNC"
  }
]