[
  {
    "text": "Looks interesting but I'm in the UK so guessing I'll miss out again",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Will they have a rotary attachment available at launch and/or which 3rd party rotary attachments work with it?",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "The marketing material sounds kinda unprofessional to me.",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "The brandlogo looks familiar, something like OnePlus (the smartphone company)🤫",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "You should have kept it secret until you actually had something in hand, birds and bushes not withstanding.",
    "likes": 3,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I thought I heard u mention fiber head as option on hydra, but I never heard power. Or perhaps I misunderstood. Very interested to see these…",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Must be the most secret laser company ever, i have been fine combing the internets and there is no information whatsoever on the company or the machines that you show, the company registered at the 29th of august is what i could find.\nNot saying it´s a scam but usually you bang on the big drum if you are releasing a hole line of new lasers and a new company.\n\nI also did a little dive to check which China might be manifactoring the machines, they usually don´t venture of that much of their original design but all will be revealed when we get a look at the inside of it :)",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Very interresting, do you know if they have plans for a fiber laser or diode, or are they going full tube laser?",
    "likes": 2,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Would love for you to show the mirrors in this machine and how to line them up when you get the laser",
    "likes": 7,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Sounds fantastic but I'll wait for the reviews to see if it actually lives up to the expectations. It wouldn't be the first device that's perfect on paper but less perfect in practice.",
    "likes": 16,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Very similar to Trotec features and tech wise on the rf unit.",
    "likes": 2,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "I spent over 10k with x tool & I've been waiting weeks for an answer I will probably never get.\nSo frickin frustrating.",
    "likes": 1,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Fir... wait, are we still doing 'first'?\n\nGoing to be really interesting if they can achieve all these features reliably. Can't wait for your review.",
    "likes": 7,
    "video": "Too good to be true? - OneLaser X Desktop Laser"
  },
  {
    "text": "Atomstack Hurricane Desktop VS XTOOL P2S, how do they compare with each other??",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Basically, don't leave you day job!!!\nNothing to be proud of business wise in this adventure. If you don't like selling, then why trying to convince other people that what you failed yourself will work for others? Your plan was flawed.\nAnother youtuber telling people they can live from a business that did not work...\nEasy to be rich on an Excel spreadsheet! Too many IF conditions... Maybe you are selling here or there, maybe you will do this or that... but remember that whatever I am telling you what to do to get a 6 figures yearly, that I was not able to do it myself!\nNot really credible.",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "If you want a better machine you should start to focus how they build the gantry on high-end machines vs the cheaper ones. \nAeon are on the right direction with their gantry but for the most part all low and mid-end range feels that they are only focus on wattage and not the gantry and the chassi of the machine.\nDC motors are also very nice to have.\n\nThe more stable the machine is the better results you will get",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What would you recommend for cutting out a 48 x 32 inches puzzle from cardboard or birch? Can the UV spectrum handle anything like that? Would be nice if it didn’t burn so the image could already be on the base.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Couldn’t see a mention of what thickness of material it could cut",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Where's the file for the image test? All that is included is the engrave test. I purchased it and have the P2",
    "likes": 1,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "Warning! Do NOT buy a low end open frame uv diode laser.   I bought one and the laser kept lighting the material on fire. Because I had to constantly watch out for fires I damaged my eyesight permanently even with safety glasses on.   \n\nNo deal is ever worth your eyesight!!!\n\nBuy an enclosed laser with enough power to cut through the material. Gas assist lasers will prevent fires.  \n\nAgain stay away from uv lasers they’re only really good for engraving on wood not cutting anything.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Can you talk about the quality of post-sales support when you do reviews? One of reasons I'm avoiding xTool for this issue but I may be wrong on my perceptions which are entirely based on various reviews across different sources. It seemed that xTool support was consistently rated  not good. Thoughts?",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Mate, your videos are so snappy and concise but still full of some so much knowledge and information. It's a mark of S-tier quality.",
    "likes": 16,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi, love your videos, so helpful.  Still having a hard time deciding what laser to buy.  I know based on this video I need CO2 vs Diode but which CO2.  I am looking to cut mostly acrylic, small pieces and maybe wood (cutting boards).  Trying to figure out the best value, really do not have the budget for 7-8k.  Any insights would be helpful?",
    "likes": 3,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What machine would you recommend for engraving jewelry, including rings?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What about the exhaust quality? Since the bottom of the machine is that simple to remove and doesnt look sealed, do you have smell or smoke in your workspace?",
    "likes": 1,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "I'm interested in buying the Atomstack Hurricane Desktop Laser. I want to use it to engrave 3/4 in deep bowls. Can I remove the auto-focusing probe so that I can get as close as possible to the edge of the bowl? Also, what is the distance from the edge of the nozzle tip to the top of the material?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Please learn to hold your hands still when you are showing something we want to see. I would not let you hold or touch any of my stuff if you were talking. Or maybe once, then never. I can't concentrate on what you are saying when I expect the flailing laser head to go flying! I can't imagine allowing you in a lab.\n\nI keep picturing trying to avoid the muzzle if you were showing me a pistol.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "What kinds of things can  you make  materials can cut?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "what you think what is best this atomstock or omtech polar co2",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "This guy clearly knows his stuff but he needs to slow down his delivery speed, this becomes really annoying after a few minutes; just take a breath now and then! Less hand waving would also be good. I direct instructional corporate videos for a living and this dleivery need tuning really badly.",
    "likes": 6,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I need some sort of explanation on the wattage. I don’t understand how there are marketed and then how powerful they really are. I want something more powerful and faster than my glowforge.",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Just found this channel. My biggest issue with my glowforge I have is if I want even what I consider basic functions I have to pay for them. When I joined the kickstarter as an early bird I do not recall that being stated. I know I had access to them for about a year before I lost those to their subscription model. Needless to say it sits there collecting dust now which is sad.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I was speaking to one of our suppliers about adding a laser to our shop and his recommendation was when it comes to fiber laser, anything below 8kW are just toys.",
    "likes": 5,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Use a stub bit instead of a long bite and a 3 flu stub bite.😊",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "its a lot of $ for a basic diode laser in a plastic box",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Can you engrave thicker material by removing the crumb tray and using, or making, a riser?",
    "likes": 1,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "It looks a third as capable as my Bolt and 1/10th as capable as my Epilog, but I do like my F1!",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Hi to all here on this channel. I'm a beginner in this field but curious about what those lasers can do.... anyone knows about engraving on motorcycle helmets or motorbikes \"bodies\" (fairings) which are mostly made of carbon fibre, fibreglass or polycarbonate....those products as you probably know or can suppose are not flat and not small.....what type and what minimum power of laser (machine) should I use to do engraving on?\nThanks for your answers people.😊",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "No it’s not awesome junk at best ok when it connects to WiFi their software phone connection is poor and worse.",
    "likes": 0,
    "video": "The xTool F1 Is Actually Pretty Awesome!"
  },
  {
    "text": "I wish this had been out sooner back when I was shopping lasers.",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Something that makes me slightly suspicious is that after all this time WeCreate still doesn’t deliver to Europe, is that because they are unable to meet the more rigorous EU quality and safety standards? Can’t be that there is no market there with almost 500 million potential customers. \nAdditionally is the WeCreate finally 100% Lightburn compatible?",
    "likes": 1,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "may I suggest something for their product page webpage : add a visible in page link, within the first page load, to the specifications of the machine ... scrolling up and down for 30 seconds trying to find out what the working surface, laser dot size, if it is a long beam (seems not to be) , etc is annoying as hell ! ...",
    "likes": 4,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Does wecreate or any laser software work with an iOS tablet or Mac.  For that matter, a Chromebook.  I am trying to find my best way into the market with least amount of cost.",
    "likes": 1,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "I'm new to this laser thing. I'm trying to find something that can do just about everything, engrave, etch and cut. Is there a machine that you can easily interchange different diode heads??",
    "likes": 1,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "Looks nice. I like that there's no side element that makes it wider than it needs to be. \nHow large is the actual engraving area as in the max X and Y in the program?",
    "likes": 0,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "I can understand to help keep cost down that they didn't go with a 40w but I would never go back to just a 10w.  20w is the best bang for the buck and is the lowest power that I would go to.",
    "likes": 2,
    "video": "Big Results in Half the Space - WeCreat Vista Desk"
  },
  {
    "text": "I want a laser for just to cut leather patterns like wallets so all I will need to do is sow the wallets together or any leather projects like making kits so people can sow there own wallet thank you",
    "likes": 3,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Aren't diode lasers typically rated in input power, where co2 is rated in optical output power, or is that a myth I've heard?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Based on reviews, the big concern for me is post sales support. It seems that all of them have issues with support to varying degrees; however, I would have went for an xtool but support reviews are horrible. I have some time since I'm holding out until black Friday.",
    "likes": 9,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I’m really leaning to the AtomStack x20 with extensions to do hat patches it’s faster than most and has a smaller dot size, I’m in the market if anyone has one !!!!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Thank you for all your informative videos. Now I’m confused as a „future laser beginner“ if I should buy the P2S or the hurricane - help😂 greetings from Germany - keep up the good work",
    "likes": 3,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Like you said “it just works!” … until it doesn’t. I have a p2 and the z axis is not going back all the way up. (Not Going home) making the laser unusable… I emailed support 3 times and even sent PM message on Reddit to xtool and …. Crickets… no answer whatsoever so my business is on hold and that’s not ok… I’ll have to switch to a company with better support and more reliable equipment.",
    "likes": 2,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "im not buying anything from a man whois sales pitch is  \"i swear on my grandmothers grave\"",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "Really enjoyed your video, but ya might want to cut back a little on the java.",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Looking to start cutting and engraving cowhide, metal tumblers, and glass cups.  Also my machine will be in in uninsulated metal shop where we do get a high of 15 degrees Fahrenheit during the winter.  Given these specs can you recommend a machine under $2500?",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Hi i nees to buy laser for metal and plastic parts, which lasers to use ? Bike parts and electric parts of an ebike",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "How is it for tattoo art? Stick your arm in there for a test?😂",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Great video, very informative. I've had 4 different lasers and wondered where you'd rank the FS Muse Titan laser compared to other CO2 lasers? Looking to upgrade or trade for another. Thanks!!!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Where does it say on an engraver how large of a piece it can engrave? if I want one that can do something say 30 inches wide?",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Are you going to be doing a review of the new Omtech K40+?? Would love to hear your thoughts.. I was thinking of the xTool S1.. but then came across the K40+ as it's CO2...",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Do you know which ones work well with cutting plexiglass?",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I am about to purchase my first CO2. I'm looking at the Thunder Bolt (desktop) as well as the new XTool PS2. The laser will be in my garage (in Texas). I was fairly set on the new PS2 until I learned more about the steel tube and air (instead of fluid) cooling on the Thunder Bolt as well as realizing that Thunder has US-based customer service. Since you just put out the new video on the PS2, do you have any thoughts about ease of use and learning for a newbie to CO2? I do have diode experience (with XTool actually).",
    "likes": 0,
    "video": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop"
  },
  {
    "text": "I'd question which machines are class 4 and which class 1.  I'd also question which are truely CE marked or just have a CE stamp on them.  So many coming out of China are claiming standards they just do not achieve.  I'd also question which ones have been tested electrically.  (full stop).  This year I've seen two that would never have passed electrical or laser safety standards.  So beware.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Whats the typical kerf of each type you've outlined?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Needs ability to read registration marks and cut out",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Great, in depth video!!  Quick question:  the fiber laser module that you can add to the xtool S1, what is that in watts?  Is it the power of the F1 or 20 watts like the F1 Ultra? Just wondering which laser to get next.  I have the F1; I'll be looking to upgrade sometime in the next few months. Also, do you think xtool is going to do an \"Ultra\" version of the S1 anytime soon?? 🤔☺  Thanks!  -- New subscriber!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "just wanted to ask! does Easel allow me to draw out my designs for my project\nI tried to install Autodesk version on personal uses, and didn't get a my verify email back, so given up \ntrying Fusion 360, which would have been awesome, because I used for over 25 years 3D MAX, But! I will look into\nCandle, thank you for the heads Sir! I've ordered the 4040 reno, will come by next week. Great info video 👍👍",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I stopped watching when you said the video was sponsored by Anker Make. Genuinely looking into the product but I want honest reviews now one possibility influenced by a payout before buying one.",
    "likes": 2,
    "video": "The AnkerMake M5C -The Best Beginner 3D Printer?"
  },
  {
    "text": "Well, now I'm going to put off my upgrade to co2 until you do the comparisons. Good thing I'm learning patience, I'm just not good at it! Lol \n\nThanks for this review. Good research and presentation style. Keep it up!",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I own a print shop and need a laser to do custom work for our customers and for my own personal crafting. I would like to offer as many options and materials as possible and a good range of sizes for signage. \n\nSo... What would you recommend??",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Thank you for your honest review! It's difficult to get a truthful depiction of xtool products because most ok all, except you and one other allow their freebies to dictate their observations. Xtool makes a decent laser, but their misleading advertising is a deal breaker for me.",
    "likes": 4,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Curious why you do your reviews in the DARK?  Most of the videos you can't even see the machine .",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "Jus thad to come to comment on that thumbnail, lol.  Love it",
    "likes": 2,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Atomstack has had a 70w out for 3 months now. And with co2 lasers are uou not supposed to run them at more than 80% power or risk damage where as a diode can run at 100% of its power ?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I'm sticking with my Atomstack pre-order for my first CO2 laser. The PS2 has some nice features, but for the lower price, red dot alignment & full Lightburn support is my main reason (the PS2 & S in Lightburn doesn't support camera or auto-focus).\n\nThe pull-out fan is handy but probably easy to swap on Hurricane and won't be often. The simple filter on the PS2 was a nice touch but will probably look at adding some strip magnets and fan mesh to the Atomstack for the same effect when it arrives.",
    "likes": 2,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Great video but your Etsy fees are way low.  Yeah, it's 6.5% transaction fee but also a 3% processing fee.  If the order comes in via their \"Offsite Ads\" then it's another 12% off the entire order including shipping.  That's 21.5% and I think I'm missing one off the top of my head as I had figured it up in the \"worst case scenario\" with an order with Offsite Ads at almost 25%.  Since you don't know when those sales happen or have any visibility to how they happen, you have to be prepared for them.",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Do any of the desktop diode laser tools have some sort of z-axis with a dynamic focus so they could process contoured materials?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Great video.  6mo ago,  I bought a 10w NEJE and it was affordable  and so far it's been good for learning. I picked this one because it has a Z axis and I bought their Webcam.  Once I become more proficient and can make some passive income from it,  then I will upgrade to a CO2 laser.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "CORRECTION: There is a red laser beam used for alignment!  It isn’t always on (like other machines I’ve used) it only switches on at certain points of the alignment process.  The walkthrough is still super handy and it’s great that you can use the red dot along with the actual laser beam beam for alignment!",
    "likes": 18,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "with pre order price in mind think the atomstack hurricane cant be beaten. think price, shipping and taxes works out £2.4k",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "If xTool had really thought about improving the P2, the machine would look completely different. The P2 / P2S is simply a bad joke. Absolutely not made for professional use and even less for private use. Way too loud, poor cooling, extremely difficult to maintain if something breaks. And the worst part: the exhaust. When you use this laser, everything smells. It’s not sealed. This laser is far too expensive, and I would always prefer the Turbo 535 from Omtech. This laser is a marketing gimmick and not recommended.",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "The reason I stopped buying Apple products was simply because of their aim to create FOMO by making gradual improvements. If you bought the P2 a month ago you might not be too happy to find out the \"new improved P2\" has JUST been released. If that becomes xTool's M.O then people might start looking elsewhere. Folk won't \"upgrade\" from a $4000 machine to a $4500 machine because it has a better fan and improved software for cups.... would they??",
    "likes": 3,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "This is from an xTool post talking about the P2S and what the \"software features\" mean for the P2 and will they be available on the P2\n\"📌Software Release\nNew features, including X-Axis acceleration, batch processing for different designs, and curved cylinder engraving, will be gradually supported P2 through XCS upgrades, with full implementation by February 2025.\"",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "If anyone is the apple of lasers, it would be trotec. Expensive products, expensive support, locked ecosystem, overpriced parts, does not allow self-service (will void warranty), locked down software and more.\n\nThe defining aspects of apple (aside from the aesthetics).",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "FYI, Roly has a new Roly MK2 XW Laser that's DOUBLE the size and the jig table is now available (to buy separately) for the MK2 and MK2 XW. Also, word on the street is their IR module will be released soon (which I heard in an unboxing livestream video by Light Source Engraving)....Great review!",
    "likes": 5,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "three times bought xTool and three times return it. cheap Chinese fake laser. Even smaller 40W industrial laser will be better x100 times. don't waste your money and time buying xTool products.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Thank you for the great review!\n\nDo you know if they are offering any upgrades to the P2 such as getting the upgraded air pump or purchasing a license to get the curved rotary?",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I'm stuck on what programs did you use for the voice over?",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Well I was going to buy the 40w upgrade. But I'm a free thinker and don't need any apple products.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "OH MAN!!!!   I only recently got my XTool P2!  LOL. DOH!!",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I thought there was a visible red dot that was projected for mirror alignment.  I swear I saw it in their live launch video but now can't find that video.  There was a point where they were adjusting the screw and you could see the dot move.  Edit:  Ok, found it at 1:26:22 in their launch live stream if you can track that down.  I'll have to go back and watch a bit as it's kind of hard to understand them but they do show a red dot that moves as they adjust the screws.  So, you have to go through the whole alignment procedure and at the end it projects the red dot.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "How does this compare to the new Atomstack co2 laser in a price to performance setting? Features seem to be similar on paper but are they comparable in the real world and if they are is Atomstacks lower price related to the build quality?\nGreat video",
    "likes": 5,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Does this \"smart align - take an image and get a proper placement on the material\" really work?\nI have tried so many times to use various cameras with Lightburn (Atomstack x20 pro, including the original Atomstack camera kit) to place content precisely - it's ALWAYS disappointing. \n\nNot only for the obvious reasons: \nIf you use material with different thickness, you need to re-calibrate. \nAnd it's really hard to mount a camera over a laser in a consistent spot: all constructins I have seen with beams and tripods and \"mount to a lid\" just didn't have the accuracy required for it to be useful. The camera will always move a tiny bit out of calibration.\nNot only that, but even if you really mount it as sturdy as possible and have the same thickness of material all the time, it will just by itself loose calibration within 2-3 runs.\nNot only that, even if you use fixed jigs (no camera), the laser itself isn't consistent in positioning, you may get 2-5mm shifts randomly.\n\nSo all in all the Lightburn camera alignment feature is just a collosal disappointment.\n\nIs that what you show in the video - randomly positioned material with accurate detection and accurate positioning - REALLY REALLY reality or is that staged B.S.? Does it REALLY get the content onto the material in the right angle, in the right place?\nCan there be a proper review of this feature, please?\n\nThanks!",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "IT is in the settings.  Go to XCS with the machine connected. The little gear icon next to the machine name - click on that. Scroll down and there are different settings for Cut and Engrave.  But still can't go down to 0% for either of them.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "You beat me to it, Brandon! I was literally going to make a video titled “XTool is trying to be Apple”. My thumbnail wouldn’t have been nearly as good as yours though. Awesome stuff!",
    "likes": 2,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Hello\nI plan on setting shop in my basement, if i am using a smoke purifier with the machine, do i need to vent it outside?",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "XTool as a whole gives off a serious Apple vibe, trying to position themselves as the company that is bringing advanced industrial tech to the homes of creatives using a curated blend of stylish hardware and software.",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Didn't the P2 just come out? Is it normal to have a hardware refresh/cycle in the middle of a brand new hardware release? I was considering a P2, but now with the release of a P2S, I'm confused.",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "The upgrades are great lets get xtool to make a bigger machine 🫡🫡🤝🎉",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "I currently have the P2 and really like the machine. I do not believe that the new P2S would be something that I will be up-grading to in the future. \nI know there are a few up-grades, but not enough reasons to buy this up-grade. \nUnless XTool would up-grade to a larger machine, then.... This would be the reason the buy another.. \nI do like your comparison with Apple.. You really can see or feel like XTool is trying to copy Apples business plan.",
    "likes": 0,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "What!! I thought the same thing about the alignment with the red laser 🫠",
    "likes": 1,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Haha the voice over is funny, fine  let’s wait for the P3",
    "likes": 4,
    "video": "Why is xTool so Popular - The P2S Desktop Laser Re"
  },
  {
    "text": "Wow! I must be missing something. I guess choosing to work in ministry must be the answer. \n\nHow do people afford these machines. I’d love to use one of the entry level CO2 lasers but that’s expensive to me. Not even fathomable to get one of the large ones.\n\nGreat video, very informative. I wasn’t going to watch the entire video but I did. Thank you.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "If this would have been out before i bought my xtool s1, i def would have purchased this!",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Love your video and charts. Is there a way I can export the comparison chart to excel so I can keep for future reference? Thanks!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Top 3 choices between $300 and $500  for beginners? Thank you!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "After using Xtools and WeCreat software I don't care for lightburn much lol",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The stuff I could do with a 20+watt laser machine so many ideas an projects just need the pow pow I'm running a 10watt unfortunately",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "How do I go about testing one on my channel buddy??",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "The  P2S just came out with an improved laser alignment over the P2.  Can you describe the hurricane laser alignment process? Looking forward to your future comparisons with other 55W competitors.",
    "likes": 3,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "2:16 ummm just because you can't see radiation doesn't make it any less dangerous to yer 👁👁UV laser radiation can cause photochemical damage to the cornea and lens, similar to other wavelengths.☢",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "One other category is the CO2 Galvo, also UV Fiber just muddy it up some more, lol",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hey! Do you have test files or templates available for dl? Appreciated!",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Nice reveiw,    very informative and entertaining.     I have to wonder about this machine as far as laser printing being compatible with paper and vinyl cutting.   Lasering is often a a smoky messy process,  the inside of a laser cutter needs a lot of cleaning.     It might be challenging to keep the sort of clean room environment you want for cloth and paper in the same environment with laser cutting.",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "You are always over here slayin' lasers! Great review btw.  Thank you! I'm with @justinlaser on this one, anything that's LB-compatible is awesome.",
    "likes": 3,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Great review. Can the 10w version of this machine etch clear acrylic enough for use in side-lighting? Maybe the 20w version?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "Great video and an interesting machine. Just looking for an upgrade from diode to CO2 and was looking for XTool P2 but will probably wait for the release. It would be interesting to know more about the material feeder that you show at the end, will there be a rotary tool and what is the max tumbler size with this small raiser base.",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Thanks. Do we need to use their laser ? Are we stuck with one size screen?",
    "likes": 1,
    "video": "The Easiest Way to Start Screen Printing!"
  },
  {
    "text": "Did you hear about SwiftShape? What do you think? Seems that price range the second one beats the Hurrincane. Wanted your tought to have an idea if to get that extra early price from Atomstack. Also, do you know when it ends?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "My wife went with the wecreat 40w, almost went xtool but didn't have the room on the bench, and she already has a cricut anyway.\nShe LOVES the wecreat!",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "I think the easiest question would be how does it stack up to the P2 or even the Thunderbolt.......also please have availiability to Japan Market kthx bai :)",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "I'm interested in their piss-on-it approach to fire suppression. It seems like such an obvious way to implement that kind of feature that you'd think there would be good reasons *not* do do it this way",
    "likes": 3,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Buy a cheap Chinese diode, a Good (like OMTech) Fiber and a decent (80watts or more) CO2. Yeah 3 lasers... and while there's a lot of crossover in capabilities, you don't want to use your CO2 (tube replacement is expensive) or fiber for stuff your diode can do.",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Please stop referring to the Xtool F1 as a fibre laser.  It's an IR & visible light diode galvo machine.  Xtool muddied the water by marketing it as a fibre, then wondered why people were annoyed by the misrepresentation.\nThe F1 Ultra, however, *is* a fibre laser.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Just wish it's UV ink and if they use that, it will be a game changer. It made me recall XYZ printing that used inkjet to mix the colour but it's just a gimmick.",
    "likes": 1,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "I am confused by the preorder discount and coupon. Is the $1099 coupon after deposit off the full $3799 or the $2799 presale price?",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Great review.  \n\nJust curious,  why all in one machine? Seems the printing is not economical and mediocre? Why not 2 dedicated machines? What is the application of this? Thanks.",
    "likes": 0,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "I wonder how much would the tube cost when it needs replacement?",
    "likes": 3,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "I cant tell if the laser market just moves so fast or if my timing is just horrible.\n\nDays after i bought my A30, the ikier 70w was released.\n\nWihin HOURS of me ordering my omtech polar, this thing gets announced",
    "likes": 2,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "What’s the maximum dimensions of the workpiece it takes & will they offer a version that has automatic height adjustment, like some diode lasers have, so you can work on curved objects?\n\nCheers",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "as well as if the tube is proprietary, is it a true 55w?  Also does it have cutouts on the side so you can upgrade to a bigger tube if you want to?  For example a lot of k40 style lasers have where you can pop out a circle panel and add a box to the outside to have a longer more powerful tube.",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "1:43 you say fiber lasers are around 290nm which is incorrect - they are usually between 1000-2000nm, as indicated by the arrow on your graph.\n\nReally appreciate the spreadsheet, it is a super helpful resource!\n\nIs the xtool conveyer system the only system of its kind?",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "This is nonsense/ Why is it needed? And for that kind of money?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Great job. Looking to purchase a desktop laser, not sure weather a co2 or diod. Do you know if you will be able to increase to a larger co2 eg from a 55 wat to 100 wat? just curios.\nThank you.",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "2 Questions: Can you engrave on toast? If yes, would that toast be safe to eat?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "1. What is the noise of the machine when it's running? 2. Adding the fume extractor, what is the noise? Want to run it in an apartment. 3. Would you recommend this over to the P2?",
    "likes": 1,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "It looks like the preorder price is pretty good. Is this the best Desktop CO2 Machine for 2999?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "How easy is it to clean the lens at the laser head.  This was an issue with the Omtech polar (and I presume the Gweike Cloud) and gave rise to many third party solutions (at a price).  Have you tried using the Lightburn print and cut facility with the red dot?  This looks like a great machine and if the rotary add on is reasonably priced it could well become a market leader.",
    "likes": 4,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "What is the quality of the tube and how many cutting hours is estimated to get out of it? How expensive are they (Assume they are proprietary so you have to get them through AS?) Can you use a rotary of any kind without buying the riser or is that needed? Would be interested to see another review of this machine after you have used it for a while. Atomstack documentation in the past has been pretty hard to make sense of. Have they done better with this one?",
    "likes": 8,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Are those accessories included in the pre-order package (I guess not)? What is the pricing on the accessories? How does the machine stack up to Gweike Cloud?",
    "likes": 0,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "Full Lightburn compatibility is huge they made the right choice on that front. Also that fire extinguisher feature better never malfunction because LOL, thats wild.",
    "likes": 10,
    "video": "How Good is the Atomstack Hurricane Desktop Laser?"
  },
  {
    "text": "What would you recommend for etching on a small dropper (5mg——) on a 76mm glass dropper top bulb.",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hi, unrelated to this video bit hoping you see this. I just got an AtomStack x20 pro & I keep getting a homing error (alarm 9) Can you help me out?",
    "likes": 0,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "I am looking everywhere for a laser. But its overwhelming how big this market is. But i need a laser for school. Building maquettes as a architecture student. Mostly i use cardboard. Sometimes some wood. The plates are sometimes a little bigger. But i also wont to try various things out. What do you recommend?",
    "likes": 1,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "Snapmaker 2.0 falls into the \"tricked out 3D printer\" category, along with the diode modules you install in your 3D printer.\nAgain no M1 on the list, which is still a viable choice for crafters\nSnapmaker Ray 40 is in the wrong category, it's an open frame with optional enclosure.\n\nThe open frame category is designed for a low upfront cost and not meant to be used as they are but be equipped with accessories later.\n\nThe \"desktop diode\" category has branched in two directions: one is the crafter category (M1, M1 Ultra, WeCreat, Flux Ador, Aura, Spark) and one is hobby/workshop (S1, Falcon2 Pro, Roly, Genmitsu S8). The crafter machines are getting multifunctional with printing/blade cutting modules, while the hobby ones focus on lasers.\n\nInstead of having an always ticked \"enclosure\" column, you should add important parameters missing from your sheet:\n* how the focus works: by moving the module or bed - as this limits functionality, you can't easily do curved surface processing when the whole bed has to move up and down\n* rotary attachment support - out of the box, with optional riser base, etc.\n* pass through / removable bottom plate\n\nBTW as far as I know WeCreat somehow shot off xTool (ex employees?) - their software is basically a clone of xCS 1.x.\nBTW2 you could have waited with this until the P2S review.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I’m probably missing something important but why don’t companies like Canon, with existing tech for precision control over lasers, make machines like this?",
    "likes": 2,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "The Ador is very similar in form factor to the original M1, I'm surprised you didn't mention that and use it for comparison.\nAnother thing I'm very surprised you didn't mention is rotary attachment support and option to process taller objects.",
    "likes": 1,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "You can do this in Snazzy, but also if you Use the Google Maps (plethora of tools)!",
    "likes": 2,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "Fume extraction is a must on any long cut. \nI like the machine. But it's definitely, hobby or small buisness  periodic use.",
    "likes": 2,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "I like your reviews. I'd watch them more if they had chapter markers. It's not hard to do.",
    "likes": 2,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "These machines are awesome, I am in love with how much you can do with them, more and more with each new machine",
    "likes": 2,
    "video": "The World's First Laser Cutter & Color Printer Mac"
  },
  {
    "text": "4:02 This is not how you sand something flat. This creates low spots that you will then have to sand the entire countertop down to get even. Run the sander flat and keep it moving over the entire piece.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Wood"
  },
  {
    "text": "Very nice video. Thanks for all the information. You definitely know your stuff.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "*almost the bluest light possible*\n\"Its actually pretty purple!\"",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Great video! Incredibly informative.\n\nI recently bought a 40K diode laser (Sculpfun SF-A9), but found that the laser spot size was .4mm - .5mm, which for my purposes is basically unusable. The advertised spot size was .1mm - .15mm. In your experience, is this a common problem for higher-watt diode lasers, or did I just get a lemon?",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "great review, but I must have read the words \"Pizza Planet\" about 300 times.",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I have the F1 and like it. The Ultra is just too expensive for what it is. I can get a 50w MOPA integrated fiber laser from OMTech for around $2500 right now. I may lose some work area but power would be more important on what you can engrave. Even the LP5 is a bit cheaper.",
    "likes": 3,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Etsy TOTAL fees are 30% on each sale. (They have way too many fees.)",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "I clicked the link for the Creality Falcon and it takes me to a different website than the actual Creality site. What is the difference in the sites/sellers?",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Great video! Very helpful! Would you consider the desktop Omtech safe for the home enviroment? Thank you🙏",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "They had to replace my xTool f1 machine as the infra red light disappeared after three weeks, unfortunately even the replaced machine also having the same problem. Upon my research what I found is should not buy dual lasers.",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Have you happened to hear anything from Roly about swapable heads for mrk2? I thought they said they were going to be releasing an IR module but can't seem to find any info any more.\n\nAlso, can't wait to hear about the 1 laser info",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "23:54 I'm not sure if I'm more jealous of the amazing amount of lasers and other tools you have in this video, or just the amount of shop space you have available, lol",
    "likes": 89,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I'm so tired of being told the lasers I own don't engrave metal. I've been engraving stainless steel knives since I've gotten both of my lasers one was a 10 W and the other is a 30 watt it just depends on the speed and the settings you use. it doesn't go that deep but it does work and its permanent. There are multiple videos on YouTube proving this, I'm not sure why the people that own CO2 lasers don't want to admit that dialed lasers operate this way, whatever",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Help! Got Xtool F1 ultra. When I Frame on a product the framing is in the correct position. But the finished lettering has moved below the framing box. Any help would be appreciated",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "Great video! what would you recomend for engraving on different type of plastic computer keyboards as well as on laptop keyboards. A lot of manufacturers use different types of plastic and I have seen some excellent results with IR fiber engraving but on other manufacturers the results are barely visible.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Thanks for the great info...really looking at the Thunder Bolt, and REALLY like the RF type laser in that unit because of its engraving detail (smaller beam width). But, maybe you could do a video on the difference between regular RF Tube and the Coherent RF Tube - is it worth the extra $2000 in the Bolt line? Thanks, Charlie in Central Ohio, but soon to be Central Florida !!",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Perfect timing and a great video! I've read that a diode can cut iron on vinyl just fine (PE only, PVC omits noxious fumes) which is all I use a blade for. Would you agree with that? I'd like to obtain a better laser for cutting and engraving 3-6mm? wood than invest in an M1 especially with the ultra out of the budget.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "why OMT TECH doent make a. nice desktop laser like 600x900",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi! My shop newly owns an OMtech Polar, and we have been trying to figure it out. We got your courses and I've watched them all. They were SUPER helpful for learning and mastering Lightburn, but I was wondering if you are planning on doing any more that are specific to the Polar. I haven't found anyone else on youtube who is as easy to follow as you and who is covering the polar. This isn't our first rodeo- our main laser is an old beast from a defunct company in China, but sometimes all the bells and whistles are almost more complicated. I'd love to see videos on the camera, or more explaining how to use the z axis. I've got engraving down, but we're struggling with cutting through material in a reliable way. Thank you for all the videos you made so far!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What a comprehensive guide! his video is truly invaluable for beginners like me. Thank you for the detailed insights! I have decided to choose the S1or F1 Ultra as my first laser machines.",
    "likes": 8,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I’m looking for a laser cutter that will cut fabric letters. I use a cricut maker right now and need something faster.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Kudos for excellent presentation of the variety of lasers for home use!  Can you suggest a 'best' choice for a fairly large gantry to cut single layer cotton fabric?",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "perfectly timed video. will be getting a laser at some point",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "You really should put something in the title saying for XTool only. Wasted time waiting for you to get to something useful.",
    "likes": 1,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "I wondering what One Laser can offer to the market.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "I’m newer to laser engraving and I have a Snapmaker 2.0 with 1.6w diode, 40w diode, and soon a 1095 infrared.  This is one of the best laser engraving orientation videos to show you what you can get and what it’s for I’ve seen.  Subscribing.",
    "likes": 5,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Hi! Great video! I have an Xtool S1 40w. It Works great. Now I was wondering to upgrade to an Xtool p2 but I’m afraid about the integrated water cooling sistem. Is it able to  support 3-4 Hours of continuous Wood cutting? Thanks 😊",
    "likes": 1,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "OOOOMG😢😢 UUUU talk 22222 much.\nShow us ur prodaction plz nd stop talking like a monstet😢😮😮😮",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "How I wish I have that kind of laser for business 😔",
    "likes": 1,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "On the market for my first laser… unfortunately I want to do metal. Considering a Laserpecker 5 or break down and buy a Roly and MOPA fiber. Not cheap!",
    "likes": 2,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Is laser that can cut 3m vhb double side tape with out burning it melting it meaning will c02 do it . I tried with a diode with bunch different ways  fast high fast multi pass.  Low and slow you named I tried it no clean cut and melted",
    "likes": 0,
    "video": "Laser Companies are Lying to You"
  },
  {
    "text": "It's not the total watts, but pulse width, pulse rate, M2 value to maximize your total energy at the focus. So if 40 watt has 100 um spot and the 20 watt has 40 um spot. The 20 watt is going to crush the 40 watt. Also anything over 0.5 watts is a class 4 laser.",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Monthly subscription billed 12 months at a time is a NO GO...$100+ for a few projects is ridiculous.",
    "likes": 1,
    "video": "Finally an Easy Way to Make Laser Cut Maps!"
  },
  {
    "text": "I’m a glass artists brand new to co2 lasers and you just listed some amazing knowledge into figuring out even where to start. I was lost but you lit that path. Thank you friend!",
    "likes": 0,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  },
  {
    "text": "Hey Brandon! Does this screen printing kit works properly with other lasers? In my case, do you believe this would work on a 100W OMtech AF2440 machine?",
    "likes": 1,
    "video": "The Easiest Way to Start Screen Printing!"
  },
  {
    "text": "Listened to the whole video.  Exactly which lies are the BIGGEST lies?",
    "likes": 1,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Some settings  to engrave  stainless steel  I have a fiberlaser20w",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "I cant make up my mind about the F1 ultra or the P2... love the fast engraving features on the F1 but also want to cut out wood/acrylic",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "I’m wanting to cut acrylic sheets approximately 40x40. 1 what type of laser would you recommend and 2 what would be a budget friendly one I could purchase. Thanks in advance!",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "OKAY 3/4 TO THE VIDEO AND I'VE MADE MY DECISION. IT'S A TOY IT'S JUNK IT'S NOT WORTH IT.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Not sure if anyone could help, but I have a Xtool S1 and I scanned an Army plaque picture. When I did auto trace, it traces both sides of the lines of the bit map design, which causes the laser to cut line, then cut again a fraction over. I thought it was mistakenly set to more than one pass, but it wasn’t. I zoomed in and that’s when I saw that auto trace ended up tracing both sides of the single lines.  Is there anyway to keep it from tracing both sides of one line? Ok, sorry, I’m sure that didn’t make much sense.  🤷‍♂️",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "Thanks.   I have the WeCreat 20w.   New to lasers, but love it so far.  I cut and engrave.  I did not know about air off for engraving.",
    "likes": 3,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "The more diodelasers are stacked, the more semi-transparent mirrors the beam has to go through and thus the more scattered the beam gets (polution in the mirrors). So the beam isn't as crisp as with one laser (i.e. lower power)",
    "likes": 2,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Looking for a video on using the pass through with a large piece of wood. Do you have one? Your library is big so might have missed it. Thanks",
    "likes": 0,
    "video": "Worth it? How the xTool P2 CO2 Laser Stacks Up Aga"
  },
  {
    "text": "I have the 40 and 20. Wanted to put the IR in one to stay most of the time. Which would you put it in? I mainly work with wood. So I assume the 20. Thanks.",
    "likes": 2,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "So you said 6000 meters per second…. I’m guessing that is one of the lies? 😅",
    "likes": 4,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "You are very good at making videos. The edits. The rhymes. So good dude.",
    "likes": 3,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Something else interesting you can do for selective area lighting is to 3D Print a Honeycomb Grid to place in front of the LED to limit the spread/bleed over of the light into other areas.",
    "likes": 0,
    "video": "I Made This Book Nook With A Laser, Can You Tell?"
  },
  {
    "text": "lol.... just wondering how these companies still makes $€  after sending those to all these  influencer's  ????  want to believe....think i skip  : D",
    "likes": 2,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Good information and nice work on the rhyming portion I'm sure that took awhile to put together.",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "If I wanted a music video I would watch one.\n\nTechnical video should informative.",
    "likes": 1,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Lie #6 - Links to the table of laser capabilities will be posted in the description below",
    "likes": 11,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "does it have the capability to do round surfaces i.e. cups?",
    "likes": 0,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "This spreadsheet is GREAT!! I have made a few similar for other calculation scenarios so I know it is fairly simple in concept, but to dial it in for a specific idea takes time and tons of revisions. I appreciate your time and effort in this and am looking forward to putting it to use! THANK YOU!!!",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "This vs X Tool F1 Ultra? Which is better overall? F1 Ultra is already higher priced so that doesn't help it.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Isn't the cardboard supposed to go down so that you can properly align the screen to the frame? I don't think I've ever seen it done with the cardboard up.",
    "likes": 2,
    "video": "The Easiest Way to Start Screen Printing!"
  },
  {
    "text": "Maybe actually make $100k before telling others how they can make $100k. 🤦‍♂️",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Hmm..  I already have a Cricut and a heavily upgraded k40.  I'm in to both for around the cost of one of these.\n\nIf I could do it all again, I'd probably just buy one of these.  I like it.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Dude you got a free $1300 machine. Wanna slow it down a bit and give them more than 20 minutes. Thats $3,900/hr. You must think you are pretttttty preeeettttty pretttty valuable.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "After installing the riser base, how the hell am I supposed to use the laser now?  It won't measure the distance, because  everything that I want to cut/engrave is sitting too low.",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great review. My biggest concern is the ability to engrave multiple items at once.. like if I want to engrave 10 dogtags, am I able to do it with these low budget machines? Thank you for your review",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "So you can't engrave multiple items at once? That's weird",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "I have a Chinese K40 Laser cutter. it is standard out of the box and I am very happy with it. FYI I am a model maker and wargamer.",
    "likes": 5,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Comparing a $1500 device to a $350 one is misleading click sit.",
    "likes": 3,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "The way these things go on sale and are constantly updated, it's going to be pretty interesting to see what they come up with next. Great video.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Photogrammetry will always get you far better detail than these \"affordable\" consumer scanners.  These scanners are useful for accurate measurements, but useless for high end VFX.",
    "likes": 1,
    "video": "A.I. Sucks, This Method is WAY Better"
  },
  {
    "text": "6:59 where your hand (with the watch) is, there you can stick your squeegee onto the magnet after \"squeegee-ing\" 👍",
    "likes": 0,
    "video": "The Easiest Way to Start Screen Printing!"
  },
  {
    "text": "THIS is the video I’ve been looking for.. - Got laid off from my corp job working with the same company for 20 yrs and was doing lasering custom work on the side as a hobby.  I used most of my severance ( that I’m blessed I got) on three expensive lasers (diff types IR/ Diode/ CO2) and have been lately doubting myself despite the progress I’ve made in learning and setting up an LLC etc - gives me hope and refocus.  THANK YOU.",
    "likes": 16,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Did I miss it, or was there not even a clue of the price? I assume it must be cheap to be a \"cricut killer\"...",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "No tht is NOT a killer of cricut because it is SUPER expensive and you have to vent it outdoors so NOPE. When you try to do everything you end up limiting yourself FAR more than doing anything better.",
    "likes": 3,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "yes yes yes, but who on this world cares about plastic every cheap machine can run plastic and wood basically. We reach the top so we should measure what we reach the top with and thats metal / alloy cutting and its accuracy doing that.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Do you think you could successfully start and maintain a business with the MK2? Or do you think a diode laser would be outgrown?",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "If you see this, would you be able to tell me which you’d recommend for starting a laser engraving business please. Looking at the Lasermatic MK2 or Omtech Polar. Or anything similar around the $2k price range that you would recommend. Please and thank you! Thoroughly enjoy your content!",
    "likes": 0,
    "video": "A.I. Sucks, This Method is WAY Better"
  },
  {
    "text": "Love your videos. I want to try my hand at making my own small jigsaw puzzles for kids. Any advice on what machine I should get? Thanks!",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Hey! I have the laser pecker LP4. I have a small jewelry store and would like to cut out name plates for necklaces out of .8 to 1.5mm of sheet sterling silver and 14k Gold. Do you recommend any cost conscious lasers. The Laser Pecker LP4 just does not engrave deep enough in metal for my customers to love. My customer want the engraving to be deep and in a very similar script like traditional manual Engravers.",
    "likes": 1,
    "video": "Engrave Wood AND Metal with the Laserpecker 4"
  },
  {
    "text": "Can the F1 or F1 ultra engrave on gold plated stainless steel?\nI'm looking to engrave photos, such as portraits of people, on gold plated necklace pendants.\n\nWhich would you recommend for this use case?\n\nThank you in advance!",
    "likes": 1,
    "video": "Worth the $2,400 Extra? xTool F1 Ultra Review"
  },
  {
    "text": "I knew it would be expensive but $1200.00 I was not prepared for that.",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "I'm looking at purchasing the xTool S1 20w for a very specific task.  I need to be able to paint flat objects with two different colors, say black and white, and etch off the top color in a pattern.  Do you think this laser has that capability?",
    "likes": 0,
    "video": "How to Find the Best Laser Settings"
  },
  {
    "text": "What if I want to engrave rocks? I want a machine that will automatically calibrate the size and curvature of the rock and to be able to do 12 to 20 rocks at once. All I have to do is program the picture or words to be engraved. And I’d like to do several hundred rocks in a day. Does such a machine like this exist?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "It’s amazing how much the capabilities and specs of these machines have changed since this video came out. Just as an example, the wecreat now has a pass through, and they also now have a 40 watt machine. Also, it has a pull out drawer, and had it even when this video was shot.",
    "likes": 4,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "This feels like old-school Internet, waiting for the image to load",
    "likes": 3,
    "video": "Laser Engraving Metal Cards are Wild!"
  },
  {
    "text": "Which machine is more recommended for engraving plastic?  I'll be making labels for control panels.  These will vary in size but initial will be about 1-2mm thick with white foreground and black letters.  Some will need to use a very small font (probably 4-8 if possible) while larger ones will be 24-28 font.  For the smaller there will be up to 50 per sheet so it will also need to cut them out.  TIA",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I am new to this. Having errors with UGS and CNC 3020 plus. Limit errors, g code saying it will be out of the machine range etc. 😅😅 does anyone have an idea? Not getting too much info on this. Even chatgpt giving me the runaround lol. Thank you.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "What do you think about the k40+? Does it solve all the issues of this older version?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Luban is by far the weakest part of any Snapmaker experience. Given the time they have had to turn it into a solid product, it is horribly limited.",
    "likes": 0,
    "video": "The Best Laser Engraver and Cutter to Get in 2024"
  },
  {
    "text": "Great video, I am trying to figure out what to sell, I have all the machines but nothing seems to sell for me.",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "but youre a youtuber with 80k subscriber, most of us doesnt have that much exposure",
    "likes": 2,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "I have an Atomstack 48w.   It cuts and engraved great.  With lasers the real issue is speed- how fast can you cut and move to the next.  I believe the continuous improvement on diode lasers will push time lasers down in price.  I’m just impressed I live in a time where you can have a laser in your workshop!",
    "likes": 0,
    "video": "I Didn't Know a Laser Could Do This!"
  },
  {
    "text": "So, as an American, when I see the \"Roly\", I hear in my head the word \"Rolly\" or \"Rollie\". When dude says the name \"Roly\", I hear the name of the city \"Raleigh\", as in North Carolina. Is that just me, or ...?",
    "likes": 0,
    "video": "The Desktop Laser to Get."
  },
  {
    "text": "Hi there can you show more tutorials on Wecreat 40w?",
    "likes": 0,
    "video": "Make This With Your Laser To Leave Your Day Job"
  },
  {
    "text": "Is the 20w laser strong enough to engrave metal, business cards for exemple ?",
    "likes": 0,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "All over the place.  Stay on subject  Know your information before you start recording. Its a K40 no pass through so don't talk about it. Keep your cameras in focus",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "Is it just me or does his weird enunciation sound forced and cringe?",
    "likes": 1,
    "video": "The New Craft Room King? - xTool M1 Ultra Review"
  },
  {
    "text": "Can’t you engrave metal with a register diode laser?",
    "likes": 0,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "Hello I’ve been watching a lot of your videos. I came upon a used atomstack A20 pro laser engraver. When I brought it home one of the stepper motors is not working, it doesn’t move up or down unless I push it. Can you help my by leading me where to buy replacement parts. Could not find it on their wedsite. Thanks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "Thank you!  I need to watch all of this again to learn more, but the very last tip is exactly what I was looking for.  I could not find the setting to change it to process in the order of my layers.  Thank you thank you thank you!!!",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "XTOOL F1 Ultra 10000mm/sec. So that’s not the fastest laser by a long way. More accurate would be to say fastest gantry laser.",
    "likes": 0,
    "video": "This is the World's Fastest Laser"
  },
  {
    "text": "Longer and Neje definitely beat out Atomstack, Xtool, Twotree and Ortur in the $0-1000 price range. Definitely check them out if that’s your range",
    "likes": 1,
    "video": "The Best Laser Engraver & Cutter to Get at ANY Bud"
  },
  {
    "text": "just have Ai generate image and output the file correctly formatted gcode for your machine. no need to scan anymore",
    "likes": 0,
    "video": "A.I. Sucks, This Method is WAY Better"
  }
]