[
  {
    "text": "Yay new shop tour! I’m really thrilled for you to get this space! So much room for activities! And whaaaattt??? What’cha holding out on us with that CNC content?! Or do you have a second channel? ;) Again, super thrilled for you and congrats!!! 🎉",
    "likes": 2,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "That is awesome!  Looking forward to seeing how you utilize it  I'd love to find something like this in my area.  The industrial market around here is pretty dry at the moment.",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Looks fantastic Brandon!! I'm stoked for you to expand!!",
    "likes": 3,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Congrats, looks like a great space. For those of us looking to make the same leap would you mind sharing the monthly lease amount? Looking forward to watching the build-out.",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Congratulations on the new shop space, Brandon! Looking forward to more awesome videos created in the new place. 👍",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "I'm really new to this, still in the planning stages. These vids, yours and others, make me feel so confident in the  xTool and it's capabilities and I'm no spring chicken.",
    "likes": 3,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Awesome space, great job! \n\nBut you need to check your sponsors... Eufy after the last few months is a bad decision.",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Congrats on the new space!!  Can't wait to see you build it out.",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Nice shop, and great video as usual! \nIf you could get your hands on an Arcdroid CNC Plamsa to review that would be amazing. Seems like a great tool.",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Congratulations on the new shop! Watch a ton of your videos. I started out lasering with an OG xtool D1 10w. Just purchased an OMTech 55w this weekend. Cant wait to get it and expand my shop's capabilities. Keep up the videos!",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "But universities aren't in the business of making money....SURE....sure",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Next machine to buy, particularly now with all that space…Legacy CNC machine—there smallest one; would love your experienced eye and review on that machine.",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Wow, what an amazing space!! Congrats. I am looking forward to what you have to share. \nI'm not sure what tool you should review next 🤔 I originally found you when I got my xTool M1, you shared a great review on that.\nThanks for sharing this with us all. 😊",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Congrats! Looking forward to the future of the channel.",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "So fantastic to have all that space. I know it's a little bit of a boring suggestion,  but maybe various shelves / workbenches for the next thing to \"buy\". I always enjoy seeing someone's take on that sort of basic furniture. I also wonder what sort of combo project you could do with large CNCs, lasers & traditional table saw work. I look forward to the vicarious enjoyment of the outfitting and use of this shop. Cheers!",
    "likes": 0,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "id really like if you review mor cnc stuff , like the nomad3  or something similar",
    "likes": 1,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "That's pretty cool. You have plenty of room to expand. Congratulations!",
    "likes": 2,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Congrats, man - I'm incredibly jealous, but looking forward to seeing what you accomplish in that space!",
    "likes": 3,
    "video": "My new shop! 2023 Shop Tour"
  },
  {
    "text": "Hello sir, Coming from someone who is looking to save up some $$ for a real entry level machine I really appreciate your super informative approach and wonderful video formatting. Well done 👍🏼",
    "likes": 5,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Those colored oxides will wipe off with any kind of buffing!",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "The xTool now offers a riser with front and back slide up doors and an air assist for the m1.",
    "likes": 1,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "God it would be amazing to watch a laser cutter operate at 400 meters per second 🤣",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "For those wondering how to stop Big Box from cupping...flip your boards over to what is going to be the bottom. Make sure all your boards fit together tight..clamp them tight..like you are doing a glue up..take your router and cut a 1/2  wide groove from side to side..NOT the length..stop about half way through the last board...go buy some rebar and use epoxy ...drop the rebar in deep enough so it's just below the surface..mix and pour in your epoxy...let set up.and dry...BAM ... done. We did this to a table we made using pine from HD..It's been outside for over 3 years...NO MOVEMENT..NO CUPPING..NO SPLITTING...",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse T"
  },
  {
    "text": "Hi,\nI’m a hobbyist woodworker. I have never had or have any experience of a laser cutter. What model would you recommend for a beginner like me.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "why do you recommend everything you review. You said the Aufero was the one to buy in another video.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "Can it cut polycarbonate or Plexiglass type of material? To do channel letters for instance?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "As someone new considering getting a laser cutter/engraver, I would like to see a direct comparison between the Gweike and the xTool M1. I would like to see a direct comparison  between ease of use, functions/features, total cost of ownership. Which has a better air purifier, quality of the images using each of their own software. What are the replacement cost for the laser, airlifters etc.  I know we are comparing a diode to a Co2 but I am not sure which is better for a beginner. Until now I thought Glow forge was my only options for a self contained desktop laser with a camera and easy to use, now there is a choice, so the question is which one. Thoughts?",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I just wanted to make a note about leather, make sure you do NOT use just any leather, you need to use laser safe or vegitanned leather. Other leathers can contain Chromium and that's no bueno.\n\nGood video though!",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Are there any differences at all between the Polar and the basic gweike cloud Laser Cutter & Engraver CO2 (50W) ?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Thanks for the great video.  I have a question.  Do you know where the 40 Watt Laser falls on the light spectrum.  I design safety glasses and can't seem to find the detail.  Most of what I've seen is around 500Nm which is in the general Bonding arena.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I like the build quality and amazing attention to detail on the whole LP product range, except the L2 rollers, because gnarling is traditionally used to improving finger grip on rotary knobs, it doesn't really grip things only resting on it. It also tends to lose grip easily unlike rubberised or silicon rollers. They may look aesthetically pleasing, but in my book functionality and practicality ranks much higher.",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "thanks, I wonder if there's adult education classes for using machines like these. I'm going to check in my area",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Have some experience with 100w CO2 laser, and I was usually running engraving with 300mm/s speed. Some diode lasers are advertised to be able to run up to 24000mm/min, which is equal to 400mm/s, so theoretically they could do the same as CO2 laser. Perhaps in case of 300mm/s even 40w optical power would not be enough fo good result, but I am confused why people are not running such tests on yt - usually they go up to 10000mm/min.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Do you have a teaser/ overview video of the content I will learn from your omtech/lightburn course? Im very interested in purchasing this, I would like to know more. Thanks!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "But CO2 lasers can cut metal - here for example https://www.youtube.com/watch?v=XNcapGmzIOg , tube just has to be over 130W to be able to do this, right?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Hi \n\nWe  are looking for a laser marker for gold fold printing could you you with that please let me know thanks George",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Your cutting cardboard!!!?? And the lazer is a grand ? Your not so boned up in buisness or selling products!!!!!! Not impressed!!!!",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "look how close the sun looks, def local not 50 million miles away",
    "likes": 0,
    "video": "Sending a 360 Camera to the Edge of Space - Insta3"
  },
  {
    "text": "That play kitchen is almost as big as my real kitchen..",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "Your back view of the RF only showed air cooling fans and the pass-thru slot. Is there an exhaust port?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Awesome video very informative. What would be the machine for cutting acyclic?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "how long would it take for me to engrave a word on 600 wood lids for cups? would it be efficient for a small business? would you recommend a good one",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "I would like to buy my first laser machine a OMtech MF 1220 -50R 50W but I’m scared how to handle the area to cut if there’s no camera to see where to put the design I want to cut in a piece of material that I already been using but still has space to use it.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "After paying 1500$....you have to buy more attachments. I think I would weather go with a tried and tested company for that price especially when they cost a half to one third and can do almost everything that can do. It feels very predatory like they are just trying to cash in on the trend and care nothing about the consumer or enthusiasts",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Really appreciate your insight Brandon as I learn the world of lasers. Two questions. One about do you lose detail with the higher watt diode. And two metal. I think this may separate diode and CO2 like clear acrylic does. But still not sure about metal and normal diode lasers. Does 40 watt move the needle?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "my freind use xTool D1 Laser Engraver with lower power only and HogarDeco Honeycomb Laser Bed as accessory did this jobs but not for metal maters but with Brass Plywood 11.8x11.8inchs",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Rykon is what the website says it comes with now. Is this the same, better, or worse than Ruida?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Another great video, thank you!  I appreciate you pointing out \"lifetime costs\" associated with ownership - that said, can the RF be recharged as mentioned in another comment?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Have been running the original xtool 10w NON pro for a couple years now. Its been my workhorse for the small things I make, but has recently started stopping mid burn on everything even after multiple attempts with cleaning, customer support assistance, etc. So I decided I want to upgrade and was considering the 40w, but xtool is telling me I need to purchase a pro AND then the 40w like you said in the video. Kind of pointless to buy the pro when its only for the rail system and it would be waste of the laser. I wish they offered a complete 40w kit. Im considering throwing my hat into the co2 ring and going with an Omtech 50w. Currently its $250 off so its pretty close to the same price if I would purchase the pro and then the 40w upgrade. Whats your opinion? Keep up the videos too! Theyre very informative!",
    "likes": 2,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Grade review Brandon what would be the most economical or cheapest laser to do engraving on stainless steel 316 eg jewellery please let me know. I'm new on this.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Buy shorter tooling man. You'll get more out of the z axis.",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "Do you have to pay monthly for the glowforge cloud to even use it ? And if you dont can you still use glowforge?.I just started looking into lasers and been leaning towards the k40 monport one which has an updated board so you can use lightburn . Just for hobby for now",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Any new discount codes for xtool, the ones in the link dont work :D",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Not much cheaper than GF at all.  At least not in Canada..",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "What would be the best options for rubber stamp engraving in Europe? For 10 to 50 stamps per day.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Will the mug / cylinder tool rolling attachment (from the Otur laser 2) work with the new one?",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "Cuts thin steel which C02 cannot do, why wasnt this mentioned?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "That fire thing is real. I turned to eat a sindwich and the place got bright real quick. \nNever leave the laser unattended! (or with a fan nearby)",
    "likes": 2,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "These are either reverse engineered or come out of the same factory.  You have to wonder if the lower price is due to higher profits at Glowforge or lower quality parts at the others. Probably a bit of each.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "xTool egg stool xTool egg stool xTool egg stool xTool egg stool xTool egg stool xTool egg stool",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Which Laser can Engrave Zinc Alloy with Electroplated Coating on a Budget?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "How would you calibrate/use this machine with non-standard widths of materials? I want to engrave slabs of branches that I cut, where each workpiece is a unique width, so I can't really do the auto calibration thing since it would burn the piece to calibrate, and there is only one to work on.",
    "likes": 1,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module"
  },
  {
    "text": "If I were to buy one of these two, it would definately be the G-machine. I thought I was sold on the GlowForge when you explained the differences between the camera systems. The GlowForge's true automatic focus system would be a huge benefit to me. (I tend to be absent minded about such things. So, a true auto focus would prevent me from ruining materials.) However, I'm not going to tie myself to using GlowForge's software. What's to prevent them from raising the price in the future? What happens if the company goes out of business? I'm not taking on those risks simply to avoid learning how to use Lightburn.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "MoBxTool isn't working for a discount (tears) and the link to your test burn file switches quick to:\n'The Laser Test File Workshop Offer Expired\n\nSorry you missed.  But don't worry I've plenty of reviews and trainings that you can check out.  Just click the button below.' - both are listed in this video-2 days ago (tears), really appreciate your time making these videos 😅",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Could you do small texture rollers for clay or dough?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpec"
  },
  {
    "text": "Can I use Adobe or Silhouette business with the Omtech polar?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What are the safety considerations? It’s not in an enclosure … do you need glasses?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Will either of those 20w machines, which you discussed here, engrave brass sheet to any depth?  I would like to be able to etch clock dials , with the engraving to such a depth that I can fill the etched numbers and markings with paint.  Don't necessarily need speed, in case it would require multiple passes.  Just want to know if it is possible at all. before purchasing a machine.  Thanks in advance for any advice.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "I'm looking at different lasers and I'm having a tough time figuring out which power machine I would need to use for deep laser engraving for firearms, such as a handgun slide?  Also, which power is enough for doing stippling on polymer grips?  My gut says to just go for the 60w JPT, since I've found a few other shops using that.  At least, at a minimum, I'd know it is enough to do the job.  If you can help me out here I'll use your affiliate link, I'm wanting to get one of these ASAP.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "To your comment about the power supply, I simply attached mine to the left side support of the gantry, using two big zip ties. Works perfectly fine.",
    "likes": 3,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I wish they had a way of attaching an inexpensive Fibre laser so we can etch metal. Alas ...",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I got the work area wrong and gave you the machine dimensions and NOT the work area, it actually is: .08\" (510mm) x 11.47\" (290mm) x 2\" (51mm).  Sorry about the confusion!",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Man, I usually trust you, but I got so excited about this video that I went straight to the Gweike website to immediately buy this printer and noticed that you were SIGNIFICANTLY off on your measurements of the functional workspace just in time!.  Please be careful before you buy this😬.  It is actually: 20.08\" (510mm) x 11.47\" (290mm) x 2\" (51mm).",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I feel like we can still expand the increasing wattage, but we might have to put it in a mirror frame like a co2 laser. it would be a similar speed as a co2 without the need for a cooling unit. Of course price is a major issue.",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Trotec sells a combo co2 plus fiber machine. So you get the best of both worlds.",
    "likes": 2,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Hi! Is this also good for Stainless Water Bottles? Thank you.",
    "likes": 0,
    "video": "The Best Laser engraver on a budget"
  },
  {
    "text": "Huge pro is that you can hang a diode on a wall, or take it to shows to burn in person outdoors. CO2 lasers are EXTREMELY HUGE and bulky. I got an Omtech 60w and sold it within a year because of this. I have a small shop and couldn't afford the space. I love my atomstack x20, and getting a 40w will be a huge game changer.",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "What is the size of the laser point? Is it much bigger than a 20w diode?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "40 watt????? I have a 20 and now i want a 40!!! does atomstack have a 40??? i have the atomstack x20. could i hook up this module to the atomstack x20?",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Yes it can. Chad did it on his channel over a week ago. Xtool have already said that you can also get a 5w pro frame and use it on that.",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Thanks Brandon, very informative and with my budget, I’m torn between saving a little extra for fibre/CO2 or going with a high watt diode something like this straight away. Just not prepared to buy both xtool 10w and the 40w head.",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "5w d1 pro will be available soon for less. Site says will ship mid feb",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Can the 40W easily integrate if you are using the rail extension kit? Does it use the same cable from the control board to the laser as the 10W and 20W?",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Great review! You can however still use your Pro 5, 10, or 20W laser directly on the new setup. You just don't plug in that additional connection that's going to the extra fan on the 40W. I ran my 20W on the setup and it worked just fine.",
    "likes": 7,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "At 8:03, you show cut tests and say it compares the omtech 50w to the D1 40w. The D1 cut card says 20w on it. Did you mix up the cards? Is that an acurate comparison of the 50w vs 40w?",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Cool, but how about Laser spot size? As I understand, when combining 4-8 lasers for 40w power you get MUCH (like ^3?) larger spot size, thus making detailed and photo engraving less accurate. I’d say that should be important fact of the total review.",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "What do you recommend for a in home laser that’s on the more quiet side? I really don’t want to buy a glowforge but I’m also worried about investing in a 50w co2 if it’s going to be loud enough for the neighborhood to hear",
    "likes": 0,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Great review Brandon, just a quick note you said that you cannot put the 20w back on after converting, any of the pro modules can still be used with the new rail and mother board. I had to put the 20w back on and I am actually using it now for a video I am working on.",
    "likes": 8,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "@03:15 So... _This_ morning at around 02:00am I was in chat with the G·Weike Support Guy(s) trying to get some questions asked about my regular G·Weike Cloud with the very first question having been what the Units Network IP Address is in order to hook it up to Ethernet - Normally you'd use a to the RuiDa Controller attached Screen Panel to SET the Network IP Address but with these Units not having a Panel there's no obvious way of setting it the usual way hence my question towards the Support.\n*Their answer:* _\"Don’t worry. Currently, our motherboard does not support Ethernet control machines.\"_\r\n\nSoo... Did YOU manage to hook it up via Ethernet and if so, HOW? 🤔🤨",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "The cheapest upgrade path is actually to get a 5W D1 Pro (~$400) + 40W module ($999), this is what Xtool recommended in their 40W launch livestream.",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I have a half dozen different saws to cut wood this thick.   It sure is interesting, but I just don’t see the need.",
    "likes": 2,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Thank you for this review, this arms race as you call it is making me worry about FOMO when I finally buy one of these.   One request, when you take pictures of your test sheets, can you put a high contrast background behind them, like a sheet of bright orange paper?",
    "likes": 2,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I’m trying to figure out some things when using another image to help out like what’s the best scale steps and cog to use as my photos are not coming out good and I am new to ai art",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "I decided to get an xTool 10W to start with. I also ordered the Enclosure and an Air-Assist. It might be slow but it will at least cut and engrave. Once I get familiar with the machine and I see a market for my products, I will get the 40W module. As I have no idea if I will even sell one product in this current market, I decided to start with a Diode machine rather than forking out a fortune on a large footprint CO2.",
    "likes": 4,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Also, labeling your test samples may help when presenting them. Having to zoom in and turn my head to find out which laser cut what in a three second clip is not helpful.",
    "likes": 3,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "I can’t tell if he’s reviewing some thing or if he’s an auctioneer? Talks so fast with so many cuts it’s incredibly hard to follow.",
    "likes": 8,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "6:31 \"for less than $1000\"\nmore like less than $400 dollars, the K40s are  $369 on ebay all day long and parts are cheap and easy to find and they have open source software. unlike the $1700 Xtool. for the cost of a X tool you could buy 4 K40 lasers and have money left over. not to mention that you can't cut clear acrylic with a diode laser",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "awesome stuff Brandon!   . . . did you get a new shop man?  Look at all that space!!!!",
    "likes": 2,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "That compressor in the background looks nice. ;)\nWhat compressor would you suggest as an upgrade to the basic xTool one?\nThanks!",
    "likes": 1,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "That $1700 price tag is crazy! The reason most people buy diode lasers is their low entry cost. Just go for the omtech at that point. More power, way faster, enclosure. This is going to be a tough sell.",
    "likes": 8,
    "video": "Is it worth it?  xTool 40W Diode Laser Review"
  },
  {
    "text": "Fantastic!👍✅\nIs there a way to print on other materials like fabrics??\n\nMay be change the power of the laser to keep it from burning.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "These guys are not customer support friendly. I purchased 5 days ago and no processing nor shipping confirmation, only thing I've gotten was they they took my money. No response from the emails I send to them either🤦🏽‍♂️",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Las"
  },
  {
    "text": "how are k40s for tile laser engraving with paint, wanted co2 but the better ones were to big and wanted small one like this.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Kinda nice review, BUT Brandon I never see any technical info about the machines you review. \nI’d like to hear about finer detail RF/Glass wattage comparisons, stepper motor comparisons, belt tensioners, power supply output, guide rails shift and judder under different speed and job load? \nAnything technical really?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Is the cutting ability about the same even though the wattage is lower on the RF model tubes?",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "The main difference I've seen between the Gweiki and the OMTech is that the OMTech comes with an off the shelf Ruida controller with separate stepper drivers and the Gweiki has a Gweiki built Ruida controller with drivers (TMC2208) mounted on the main controller board.",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Wish this would exist 2 years ago wen I bought my Makeblock Laserbox, what also very similar to Glowforge.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "what about software  which software does your pick comes with? Does Atomstack comes with light burn?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Can you engrave products that aren’t flat sheets? For example, if I have a circle ring made of wood and I want to engrave on the bottom outer side of them ring could I do that?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Hi.. Thank you for the video. Does it also accomodate lasers like 3018? If it does, can we put 40watts laser in there?",
    "likes": 2,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "I’ve seen people questioning the cutting saying the glass tubes are better,my question is how does the RF do with leather engraving and cutting? I’ve seen the cloud pro and I’m tempted to get it but then I saw this review and now I’m questioning wether this is worth getting or just going with the cloud pro…. Omtech polar was another option but I don’t want to wait for shipping and although glowforge seems like a great choice the price and cloud based software put me off \nSorry for the long rant I’d just love to hear if the RF is that much better or not \nThanks and love the content",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I think the glass tube will last longer than 1-3 hours, hopefully 😉",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "too late already building a 4x8 bed. co2, also thinking dual set up. make money with co2 first. then convert to dual. since fiber is expensive. im talking 2000w.",
    "likes": 1,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "The biggest benefit's as I see them are:  air cooling,  no freeze worries in cold climates (because of air cooling), RF tubes can usually be recharged (not sure about this one.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I currently own a Ortur LM2 with both the 20w SF & LF lasers. I would like to improve speed with both engraving & cutting (I mainly engrave ceramic tiles, slate & mirror, but also glass & stainless steel) & would like to cut 4-6mm ply/mdf/acrylic. Would the RF CO2 laser still get similar quality on engravings at a much faster speed & would cutting be a lot better with the glass tube C02? Also, when engraving ceramic/acrylic/glass etc do C02 lasers still need the various paints to mark/burn materials? Thanks for this video btw (been waiting for your opinion)",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Russ (SarbarMultimedia) already spent half a dozen videos dissecting and testing (it's really worth the watch) one of those RF lasers and came to the conclusion that they're not as good as tube ones.",
    "likes": 4,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "The only thing keeping me from getting the RF/Glass version.... Is bedsize.. :) I usually do sheets of 24x12, so now I have to trim those down to size and lose material. Or open the passthrough and do a few pieces in one end, trim the excess of and then put it in normally 😁 \n\nBut other than that, it's a good machine 😁",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Thanks for all the information! Do you happen to have a good source of where to get materials such as wood or leather? Thank you!",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "can you do acrylic water bottles, stainless water bottles and coffee mugs?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "do any of these machines work with a Mac? or would i have to get parallels to run windows so i could use a fiber machine?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Did you really say that acetone dries quickly because it has alcohol in it?   Really?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Isn't the Omtech polar made by Gweike under contract to Omtech?",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Where is the machine you listed? The bed sizes you talk about don't match the specs on the website. It's a 20x12 work area.",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Hi Brandon. Good review, but you made a big error in the beginning - you've got the work area incorrect.(at 1:33) The dimensions you listed are the physical dimensions of the unit. The actual working area is 20.08\" (510mm)*11.47\" (290mm)*2(51mm). The dimensions you gave would have been awesome if they were correct :) Just thought you'd want to know so you can correct it.",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "hmmm... at the time of this message, you posted about 20 hrs ago. With that said, the Test File is not available (\"The Laser Test File Workshop Offer Expired\"). I just thought you might want to know since you have the link live!",
    "likes": 0,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I have the FoxAlien Masuter Pro, I have the 40W laser with it but thankfully they're super powerful giving a 10W output.. Not many others do that on a 40W..",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Does the RF still,use 3 mirrors and is the mirror adjustment as challenging as with the glass tube?",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Wait whaaa.... new shop space?! Or just different camera angles. Either way I was distracted by all those cubic feets of air in the background. Hahaha All the same, another wonderful production, Brandon! Oh and the laser are cool. :)",
    "likes": 1,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Would like to see a more detailed cut comparison between 38W RF vs 50W glass. How much cutting ability is lost with the RF model? Was thinking that having the power concentrated into a smaller spot size might make up for lower power.",
    "likes": 2,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "So what's weird... and I'm not sure if it's entirely true, but according to the GWeike Cloud RF user manual, only 2.4 GHz wifi is supported. 5Ghz is not. That really sucks.",
    "likes": 2,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Never had an issue with glass in my large format 60/130w reci/Cloudray home machine and industrial units…..unless your plain careless……but ultimately, tubes are consumables.   Avoid cloud only machines.   ❤️Lightburn, regularly upgrading features😎",
    "likes": 5,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Very cool, Brandon.  What about actual time to complete an engrave job?  It's twice as fast but the laser is 1/3 as small.  Does that equate to it actually being slower???  I imagine the cutting is just faster since it's not having to fill in a design.",
    "likes": 5,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "Sweet! I was just about to pull the tigger on the OMTech Polar... I might wait now.",
    "likes": 3,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "You may want to CORRECT ::. You said the work area is 38x22(timestamp 1:33) , thats the size of the machine not the size of work area which is 20x12\"",
    "likes": 3,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "What about eye protection? Is it just as bad as CO2 laser?",
    "likes": 3,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "I like your review and now I have even more to think about as I consider purchasing one of these machines.  The primary question I have if and how well the RF laser cuts clear acrylic which I know the CO2 laser can easily handle.  I have a specialized need to cut and engrave both cast and extruded clear acrylic ranging from 3/32\" to 1/4\".",
    "likes": 2,
    "video": "Will this Feature Change Lasers Forever? Gweike Cl"
  },
  {
    "text": "In your new space, would you ever consider teaching or having someone teach \"how to\" lessons for each different machine?  I just think that would be cool and an excellent opportunity to discover the machine that works best for me.  I would totally pay for a class like that.",
    "likes": 2,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Seriously great tutorial. The way you explained everything had me anticipating how you were going to do things as the tutorial progressed. Thanks so much for this.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "I have the xTool D1 (upgraded with with 20watt module) and and it engraves fine... 100% power and and about 500mm/sec... (it slow but does it straight on to the tile no preparation etc... I have not tried images/pictures as such yet just logo's so getting detail and gray scale may not work.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Im new to this.  I’m looking to print, engrave, or laser custom ear tags for cattle.  Tags made of plastic.  Up to $500 budget.  Your recommendations appreciate?  Also, Im running an iMac, your software recommendation too? Thanks!",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "That's good to know about the Glowforge. Internet necessity = deal breaker.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 "
  },
  {
    "text": "It's been a year,  how about an update so we can see if it broke down or not. I can't seem to find videos where people actually use this level of laser for business.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "thank you so much for a great video. I have a question analytical I am confuse which laser cut is good for leathercraft. Please can you help me thanks",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Any idea if this engraves paper as well as the Glowforge?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thanks for the very informative video. I hope you can answer a question about the increased laser dot size. What are the practical results of this? For example, if you're burning text onto a piece of wood, will the result look less crisp?  I'm thinking about purchasing one of these and that is one concern. Thanks.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "Just spent 4K on Omtech website. Bought the AF2028 60W, chiller and fan. When asked where I heard about Omtech I input your YouTube page. I hope it helps you somehow 👍👊",
    "likes": 2,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Very Helpful 😀😀😀 Thank you for making this video !!!!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I just got mine in yesterday. I have everything hooked up but it still doesn't work. I can get it to frame but once I hit the start button, I get a red ring on the polar. Any ideas?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thanks for the video. Do you have a recommendation for a mixed laser cutting machine that can cut 48”x36” pieces of wood and metal. I was looking at the StyleCNC models. Please send an affiliate link if you do. Thanks.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "so i downloaded the testfile and all the squares were burning at 100% is there some kind of adjustment i should have made first when i downloaded the file?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Maybe a side by side comparison of xtool vs atomstack diode laser to compare quality. 😁",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I have my 1st Fire Yesterday 3/4 Plywood just went up in Flames.",
    "likes": 0,
    "video": "How Dangerous are Laser Cutters and Engravers?"
  },
  {
    "text": "Hi, your video’s are knowledgeable and helpful in making decisions regarding lasers. Can you do a comparison between your top choices and a Trotec? I haven’t found any comparisons or only one review.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Pretty good, I started with glow forge now I have omtech and glowforge is really easy if you don't know anything but def omtech is amazing !!!! I love the omtech and light burn!",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "So, I’m a woman and I have a business where I do wood work but I am very much not electronic savvy. I have a scroll saw, table saw, miter saw, router, dremel, jig saw/ basically everything but a CNC machine. What work we do is resin art and wood work for home decor. What would be the best user friendly but cuts what we need? I’m wanting more of a wood cutter and not an engraver. Yes? That would be a plus, but I’m wanting to cut words/fonts out of wood and put it on other items to paint or resin. (ie- welcome sign). Clearly I don’t need 7k+ type machine so what would you suggest for someone that does my line of work at home?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Having to directly connect it to computer, is a big con for me. All my design software is on a desktop. Can you just load files from usb stick?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser"
  },
  {
    "text": "I know nothing about any of this stuff before watching this…and it seems to me Glowforge is a scam and a rip off.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "hi brandon. idownload your testfile but is not the same you show in your video ? I'm new user of lightburn and don't know how to change it.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tile"
  },
  {
    "text": "Hey everyone.   I was all ready to purchase an Ortur diode laser unit then saw the Gweiki unit and may change my mind.  Quick question.  With diodes you can mask the material and it stops charring on the back of the item.  Is this needed on CO2 devices?  Do you also need to get the honeycomb to protect the materials?  If not this may be savings between the different operations of units.  For sure leaning towards the Gweiki..thanks",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "I'm curious about the depth. Can it burn to a depth?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engrav"
  },
  {
    "text": "moving way too fast not explaining clearly all over the place sorry.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Loved the video on the fiber laser, actually looking at one now but not sure if I’ll use it like I hope or get customers to make it worth it(meaning convince the wife) but until then I’ll keep abusing my diode laser.",
    "likes": 1,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "ARDUINO CNC 5mm plexiglass box cutted with 60W laser:  https://www.youtube.com/watch?v=sJkYGXWmB1g",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "I think there is a lot of nuance in getting the right laser cutter. The Polar looks like an interesting machine and I might be interested if I was getting something for my house. I'm a teacher and the Glowforge works best for my classroom. The footprint is just right for the classroom (looks similar to the Polar). The web interface is a selling point, allowing us to manage multiple users easily and not worry about software. I only use the interface to set up my cuts, where the camera is very useful. Everything else is done in Illustrator, Inkscape, or Vectornator. The subscription is completely optional and unnecessary. Respectfully, the review makes it sound almost required - that is simply incorrect. I have 5 Glowforges (the plus model). They are used constantly, the oldest being 3 years old, and I have never had a serious problem with any of them. Support was quick and helpful when an issue did present itself, the GF was cutting again by the end of the day. It is a no fuss machine - and that is what I need when working with 100 students each quarter. If I were buying a hobby machine I would have different requirements, but the Glowforge is pretty awesome for us. Just wanted to provide a different perspective/experience.",
    "likes": 17,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "*i'm only four minutes into this but would like to know how noisy are these machines?...i've noticed that the reviews  i've seen of these are typically silent which tells me that noise could be an issue...i'm also surmising there is a substantial ventilation and filtration/catalytic system to deal with the smoke and vapors from these while in operation...make no mistake, this is not a criticism as i could really use one of these for my long list of maker projects and design concepts...it just seems that it should be mentioned at least once*",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "March 9, 2020.....just before the world ended.  Who knew you'd be so prepared to be at home....a lot. lol",
    "likes": 0,
    "video": "Building a Modular Paint Organization System"
  },
  {
    "text": "OMG. I bet this would  have been a great tutorial, but I stopped watching it after 2 minutes. The background music is so distracting that it makes it difficult to understand what you are saying. I sincerely hope you make an updated version of this video without any music.",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "@makeorbreakshop Just wondering if you can fit a piece of material that is 12x12 on the Polar's cutting bed?  I realize that the cutting area is 11.8 or something like that but can you still fit a 12x12 inch piece of material flat on the cutting surface?  Also would this be able to cut 6mm Acrylic on a regular basis?\n\nThanks again for all the great videos.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Man, I wish that this thing had a face swap. Some of these would look so good on my wife.",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner"
  },
  {
    "text": "If I were to give you good advice, then \"SSSSSSslow down\" .\nIt's impossible to see and follow what it is you are doing, what you use of tools in the programs you are using.",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "10:52 you should mention that co2 laser beams are actually a little more dangerous that diode lasers because you can't see the co2 laser beam so you will have no blink reflex if it hits you in the eye, you need eye protection for any laser, not just with led",
    "likes": 3,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I will never buy a glowforge because they keep it locked down and you can only use it with wifi and if they ever wanted to they could lock you out of your machine and make you pay a monthly fee or if they ever go out of business you will have a $6000 brick. there are simply better, cheaper machines out there with cheaper and easier to find parts",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I would rather have the 10 k40's I could buy for the cost of one glowforge, not to mention only being able to run the glowforge with wifi is a deal breaker for me.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?"
  },
  {
    "text": "Hi! Thanks for all your videos. Do you know if you can use another rotary system for the gweike cloud? Or do you have to use the one from the 'pro' model?\r\nThanks!",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "Hi, I’m interested in buying an xTool M1, so I just watched your video review which was really useful, thank you.  I just wondered if you could help clarify something?  The M1 spec states a 385x300mm (15x12 inch) working area, but is that the max size of the material sheet BEFORE cutting or just the max size of the cutting area?  For example, can I insert a sheet of 8mm MDF into the unit that is say 400x310mm and then design a shape to cut inside the 385x300 working area?  The reason I ask is that the shape I need to produce could be 300x300mm so it would be nice to be able to rough cut a slightly larger sheet to then make sure the finished shape can be cut out allowing for a small border.  Hope that makes sense?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser "
  },
  {
    "text": "very informative and life education for those who wants to start out doing business for themselves",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Hi, love your videos. Can you recommend some budget diode machine for the genuine leather, engraving and maybe some cutting? Thanks in advance.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Where is the link for the test files? I don't see it.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "Does the co2 need to be replenished? Is so how often?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Setting the bar pretty low to compare against a slowforge. Anything is better than that pile of garbage.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What software was that, that you used to measure your laser mark on the wood. That is really cool.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "Any chance that the xtool d1 pro 20w could do 2mm engraving of a brass stamp with multiple passes?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!"
  },
  {
    "text": "These are still overpriced maybe when they get down in the $500 range",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Completely random question but I gotta ask. Which make/model are your glasses? I love them.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "You ask what  we  like to see iam looking to get a laser to cut  gaskets  when needed in my shop as  I know nothing about them seen a few people using them for gaskets but mostly for engraving  wood metal  like to hear what you have to say about this",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Well you can't 3d print wood, and there is a huge demand for this material, CNC is the only way to engrave wood if you are not an artisan and makes the work 1000x faster and cheaper, I see this as a very big pro.",
    "likes": 4,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?"
  },
  {
    "text": "I went to the omtech website  and after choosing the Af2820-60 it is wanting be to also purchase 2 different water chillers, an inline duct fan, a 4 wheel rotary axis, as well as software and training. I probably need the software and training, maybe not the rotary axis yet, but do I need 1 or both of the chillers and the fan? Also your promo code didn't work for me, not sure if it's too old or because I'm in Canada.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Consider the omtech polar desktop. Does it allow you to use the lightburn on windows? I am so confused on what this means on the omtech website: Light Burn software is compatible with all OMTech CO2 laser machines of 50W and up.\nOMTech CO2 laser machines of 50W and up are only compatible with macOS computers if you use LightBurn software.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Thanks for the video I have a question can you do Jewelry engraving as well Still waiting to make a decision. Love to add some personalized jewelry.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Can anyone help me out here.. what I'm really after is a absolutely bare-bones entry level laser welder. Not hand held but CNC type (It's only one job to do - welding two small parts together). I'm not fussed about speed and the weld doesn't need to be deep (1 mm or so). What's the lowest possible power? \n\nDoes a \"cutter\" with a 50W laser have the power to weld with, if retrofitted (with gas)?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I've been looking for a metal engraver to personalize military challenge coins.  I would like to layout multiple coins in a 3x3 or 4x4 layout and set the parameters for the engraving in the specific engravement field on each coin for a multiple coin run.  I was thinking of make a fixture to set them in.  Is this the machine I should use.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber"
  },
  {
    "text": "You have sooo many co2's 😍 I need one but cant afford one right now, my business its not all there yet ☹️ sell me one ? 🤣😬",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Having just helped m😮y coworker use his glow forge for the first time…I Hate it. Its overpriced and locked in to internet and a proprietary ecosystem.  Soon it will be a brick without the subscription, pay more now, and pay for use. Never recommend..",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "How much space do you have when you remove the tray (or can you also move the floor?) and want to do bigger objects or use the rotary with large cups? Can risers be used?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Would you please make a video on what woods can and cant be engraved if you have knowleague of this? laser ply is nuts expensive by me (1200 900 5mm is £90) and I do not know if the risk are normal ply is overblown or not or if the are normal plys I can use.",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "Machines with closed systems, noup ⚔ specially the ones that want to milk the customer over and over by providing only software that works over the internet.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "This tutorial . which version of Qgis did you use ?",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "What if I want to cut out profiles on brushes metal. What machine do I need?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "How do the three CO2 machines you mentioned fare when compared for noise output? The 60 watt machine in your video, is the $530 chiller that they sell with it worth the money? I am looking to move up to a CO2 laser from Diode lasers, what sort of things am I going to have to adjust my mind to when doing so? What important practices are more important with one than the other? And is there any sort of rotary tool that works with the 60W Floor model?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "What’s the best one to cut brushed metal and plexiglass. Specifically profiles. Thanks!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?"
  },
  {
    "text": "I dont know why your running so much extended cutter, shorten the cutter up to a little more than your total \"z\" depth. That will at least minimise cutter flex.",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max"
  },
  {
    "text": "not going to pay over 900 for any laser, its completely stupid if someone does.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Bobby T Thanks for a very informative commentary. What about software",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Do you happen to still have the cnc file? If so, is there a link where maybe I can purchase? Thanks in advance and HNY",
    "likes": 0,
    "video": "Building a Bluetooth Speaker into a Side Table"
  },
  {
    "text": "Excellent video thanks for the comparison. Really appreciate your simple to understand video style.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud L"
  },
  {
    "text": "This might be a dumb question but where do I find the actual item to engrave?",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & C"
  },
  {
    "text": "Would you use this to engrave the back case of a watch?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Excellent jig for cleaning up a small piece but I need to get a straight edge on on crappy Home Depot 8' board.",
    "likes": 0,
    "video": "Cut Straight Edges without a Jointer on the Table "
  },
  {
    "text": "The limit function on this kind of driver works by monitoring the amount of current the stepper draws under normal operation vs what it would draw once the motor has stalled. It is closed looped insofar as a circuit reacts to the rapid jump in current (at the speed of light) and cuts the current (steps) to the motor. This is the way it should be done, as limit switches are prone to failure at some point.",
    "likes": 1,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "speak more, faster and yell more. and add some \"doots doots\" loud soundtrack, flashing lighting a perhaps some shaky camera movements, too",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus"
  },
  {
    "text": "So with Glowforge, if they go belly up, you're stuck with a very expensive, totally useless paperweight?\nAlso, wouldn't Murphy's Law say that when you are attempting to crank out the biggest job of the year, your Internet will go down?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Has anyone in the non influencer world received their pre-orders yet? Is this company OmTech reputable?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "I love the idea of hardware manufacturers providing patches for hardware problems on SD card...",
    "likes": 2,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "i   love   omt    tec ! I HAVE the k40 and now they go desktop !! soo cool need this one directly ordered 1 greets from germany.. i did not bought the glow force because of the not opensource software and the complications. i just need lightburn thats it freedom is important.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech P"
  },
  {
    "text": "Something that needs to be mentioned is that CO2 lasers wont engrave precious metals. The infrared module that x tool make will.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022"
  },
  {
    "text": "Hi. Do we have any concern with ventilation while using aufero 2?",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter"
  },
  {
    "text": "Hi Brandon, I'm new to your channel, have subbed and hit the bell, and I'm hopefully going to get this Laser Engraver si a really useful video for me.\nYou mentioned getting a compressor for the air assist which would you recommend?\nI live in the UK if that makes a difference.\nGreat informative video.\nTake care.\nCheers, Huw",
    "likes": 1,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review"
  },
  {
    "text": "hello i like your video its awesome dude, keep going\ncan you give us the model for print the air nozzel or the link plz i ll thk u so much",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3"
  },
  {
    "text": "Hi, great video. Can these types of lasers actually cut metal or just engrave it?",
    "likes": 0,
    "video": "Should you buy a Fiber or a CO2 Laser?"
  },
  {
    "text": "I am really considering this machine for my small business that mostly includes specialized metal fabrication from welding to plasma cutting and heat treatment. I specialize in knife making, and I'm beginning to think my 45amp cnc plasma table is the best choice for cutting metal. But as for other hard materials such as exotic wood and resin, as well as engraving metal and wood, I'm trying to find the best most affordable laser to upgrade to from my 40w D1pro.",
    "likes": 0,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Great and helpful video. Thank you.   Did you choose the Creality machine to use with lightburn because it responds the best? I just setup a Gweikecloud pro 55w and I am not getting the same feedback from the machine that I see you get from the Creality, Just curious.  (I was using the Xtool 1 Pro previously.)",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Never used a laser engraver but I have used 3D printers and I am firmiliar withb g code and stl files. How hard to use and get started with light burn with one laser.",
    "likes": 0,
    "video": "Pro Desktop Laser at a Budget Price - OneLaser X S"
  },
  {
    "text": "I have same scanner, but I noticed some problem about to scan hair and beard, the Otter often do not recognize hair and beard, so I took 2 scantions, the first for total body setting and the second for only face setting and then I cutted and removed the face from the body version and I attached the face version on the body version. Tne point is that in the body version the scanner reconstruct the hir and beard but not very well, how do you reach to obtain so perfect hair and beard ?",
    "likes": 0,
    "video": "A.I. Sucks, This Method is WAY Better"
  },
  {
    "text": "Hi I just ordered the one laser RF desktop from your recommendation and I’m excited \nDo you know when it will be ready to ship I emailed them and they really didn’t tell me",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "What would you say about the IKIER K1 Pro max? comparing a 70W diode laser to a co2 laser how much difference would there be? I already have the xTool D1 Pro with the 40W module. and the ir  module, but I'm looking to upgrade for better cutting capability.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "I lost the information on the right hand side in lightburn. How do I get it back?",
    "likes": 0,
    "video": "Lightburn Tutorial for Beginners in 2025 - Everyth"
  },
  {
    "text": "Have you ever checked out the snapmaker artisan premium I think they just come out with it it looks pretty decent you look like a laser junkie side I figured I'd ask",
    "likes": 0,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module"
  },
  {
    "text": "Im looking to engrave guns and make metal art , which one should I get ?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Can you use the Xtool ra2 pro rotary with this laser?",
    "likes": 1,
    "video": "I Was Wrong About the One Laser X Desktop Laser"
  },
  {
    "text": "Love all the info. I am new at this and appreciate all your knowledge and taking the time to share it. Keep them coming.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "I watch most YT vids at 1.25 or 1.50, but you are so informative I stuck at normal speed, great video. I am struggling to decide what laser to get. Even after your vid, but it helped immensely, thanks",
    "likes": 10,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "For higher end industrial lasers, you should mention the big 3: Epilog, Universal and Trotec.  Never mind, I just saw that you did mention them toward the end.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Have you tried the ACMER Laser Engraver S1. I've just gotten it for Christmas, hopefully I can figure it out",
    "likes": 0,
    "video": "Laser Engrave Photos Like a Pro!"
  },
  {
    "text": "Wow Thank you. I'm just starting out so this is great!",
    "likes": 0,
    "video": "30 Laser Tips I Wish I Knew As a Beginner"
  },
  {
    "text": "What is the name of the conference / trade show you mentioned?  I'd love to go see all the machines in action at the next exhibition, whenever that is.",
    "likes": 0,
    "video": "I Tested Every Desktop Laser - This is the Best"
  },
  {
    "text": "Great Video, having difficulty with the download though.  I am looking to by a laser for my wife's jewellery business (100W, fiber laser) for cutting sterling silver and stainless steel (20 gauge blanks) to make jewellery (max size 1\" height x 2\" length).  Are there a couple of manufactures you would recommend for consideration?",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "So if I wanted to cut and engrave metal, glass, and wood. The 20w and the infrared 2 watt should be good enough right?",
    "likes": 0,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "Great information thank you!  I have a couple of questions.  Can any of the lasers (about $1000.00) do both the color laser marking on stainless and also cut balsa wood?  The second question is; when the lasers color mark on the stainless is it really laser annealing where the surface of the metal is not etched or is it true etching.  I need laser annealing because these stainless pieces will be used in hygienic applications where they need to be smooth and easy to clean.  Thank you!",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "At 21:05 he says \"i'm going to use Parallel\", but he means the \"Collinear\" constraint",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "Checking back in on this in 2024, I have the muse Laser currently just got it about four months ago. Have had a lot of issues with it. One of those being the RE3 software and machine now requires an Internet connection by default in order for you to use the software. after contacting Support several times I was finally given a key of sorts and URL to enter said key in order to force the software local so I did not have to have a Internet connection. I just wanted to let you know speaking directly to your 02:30 takers.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "\"They're not paying me to do this review\" but they've gifted me a machine and give me money for each sale. Grain of salt indeed.",
    "likes": 1,
    "video": "The ALMOST perfect laser: The xTool S1 Laser Revie"
  },
  {
    "text": "That was an excellent presentation thank you very much. And yes I would like to see more of these very helpful.",
    "likes": 0,
    "video": "How to Create INSANE Wooden Inlays With a Laser - "
  },
  {
    "text": "Great video, but I'm still not sure what I need.   I'd like to cut/engrave wood and acrylic.  I'd also like to engrave on cylinders, mugs, tumblers, cups, etc.  They are metal (painted, powder coated)",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "The 40w machine has a smaller workspace, which isn't explained to customers on the website, and the auto-conveyor system has been a huge waste of money so far.   I would recommend the 20w machine so far, but don't waste your money on the 40w or the conveyor system",
    "likes": 0,
    "video": "Laser Companies Are Lying To You"
  },
  {
    "text": "Why does this dude keep deleting my comments?  I haven't said anything bad.",
    "likes": 0,
    "video": "Watch This Before Buying a Laser Cutter & Engraver"
  },
  {
    "text": "Another video of not reading the manual first and just guessing what the unit does.. lots of wasted time",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "Wanted to see the \"first testing\", which I never did see, not a video with a lot of guessing what things are.  Some was ok to watch, but look at the instructions before making the video on \"how it goes together\".  Glad I could FF to what I wanted to see",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 La"
  },
  {
    "text": "A genuine question here.  Although we all can agree that the xTools are great machines, but I don't understand why anyone would chose these xTool lasers at peaking up to $2,500 dollars for for a 20 Watt laser,  when you can buy a Genmitsu L8 40 Watt laser at speeds 40000 mm/min... super fast with LightBurn?",
    "likes": 0,
    "video": "The Best Laser from xTool"
  },
  {
    "text": "Hello  new subscriber😁 been looking at getting some type of cutting machine i want it for cutting 3k carbon fibre sheet for fpv drone racing frames also its mostly small parts cutting area doesnt need to be that big 300mm square qould work what would you recommend for this material ? laser or CNC router??? Thanks",
    "likes": 0,
    "video": "Laser Cutter Showdown: Is Price Worth the Upgrade?"
  },
  {
    "text": "Thanks for the great video, but the link to the list of resources doesn't seem to be working.  TIA for taking a look at this when you have a chance.",
    "likes": 1,
    "video": "My Favorite Laser Design Resources (Free and Paid!"
  }
]