[
  {
    "text": "would you recommend this for round surfaces and etching off powder coating.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-04-14T20:31:48"
  },
  {
    "text": "Does it work well for a circular cup? For example, a wooden cup?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-04-14T03:48:09"
  },
  {
    "text": "I have 34 years in the laser Business... I have seen them come and go... the likes of Epilog and Universal.... In 1991 I laser engraved the Weatherby Lazermark for them in Santa Ana CA on a 75-watt LMI ( 145K investment) then Epilog comes along and pitches the summit a 45K Boat Anchor if it was a racehorse it would still be out there trying to finish a mile race! You have to understand what Lasers can do and do not do. I hope I can purchase something again soon now that even a 100-watt cutter and engraver are less than 25K!   Our Laser Shop also did acrylic we had a local shop that had at the time a 600-watt flatbed Mitsubishi and it would cut 1/2 inch acrylic like butter! Miss those days!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-13T15:53:32"
  },
  {
    "text": "video quality is awesome but i think the video title should have 40k review not \"omtech k40 review\"  there some features missed that other k40s dont have.  love the vid tho watched it three times.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-04-13T03:07:08"
  },
  {
    "text": "Thanks for that!  gave me several things to remember NOT to do!  LOL!  Much rather learn from someone else's mistakes!!  Nice video ! Very Helpful!",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg",
    "date": "2021-04-13T02:39:05"
  },
  {
    "text": "I was wondering if the ortur can engrave rocks and stones like say marble and granite?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-04-13T01:04:20"
  },
  {
    "text": "can the ortur engrave stainless steel? like jewelry. and would you recommend it business-wise on a budget?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-12T20:11:52"
  },
  {
    "text": "Can the CO2 ones engrave rocks like agate? How deep? and if you go over the same thing again does it engrave deeper?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-11T01:38:33"
  },
  {
    "text": "what would you recommend for cutting 3mm perplex acrylic?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-10T19:15:56"
  },
  {
    "text": "this is great, I'm finishing my workshop this coming week and this tool wall is just the kind of thing I'm going to build, thanks for the tips. I like the top shelf, though I think it would be good left open on the front so that it can be used to store different grades of sanding paper in each section. I like the idea of the light too, gonna do that for sure.",
    "likes": 0,
    "video": "How to Make a Simple Tool Wall for a Garage Workshop",
    "video_id": "CZ2E2sZ3mB4",
    "date": "2021-04-10T03:00:50"
  },
  {
    "text": "Its free after all. Maybe the changes came as a result of people using it for commercial use. Pay for it. Its very cheap.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-04-08T18:48:21"
  },
  {
    "text": "I'm biased but I did look at Muse, GF, China import, but CO2 machines IMO Boss gives more bang for your buck.  Their engineering an impressive laser now -albeit its BIG.  Support is great.  Great vid!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-08T13:14:33"
  },
  {
    "text": "Dudeee, reversed the spindle....?\nThe V bit can cut in either direction...?\nWhat are you even talking about?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw",
    "date": "2021-04-07T20:21:46"
  },
  {
    "text": "I am stuck at 25:08. I have mirrored the top from the bottom and now I am getting holes I just made for legs on top too! How did you overcome this? I thought you have mirrored that component too, but seems you actually haven't?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-04-07T10:49:31"
  },
  {
    "text": "This is hilarious... I love all the b*%ching & moaning from the \"something for nothing\" crowd... Fusion is amazing software and even in it's throttled back form, it is a priviledge for the freeloaders to be a ble to use it. I have paid over $40,000 (Australian)  for Solidworks over the years and that is cheap compared to ProEngineer (Creo) and UniGraphics that preceeded it, but Fusion is way superior, especially if you need to use CNC etc, the Delcam / FeatureCam / HSMWorks tech rolled into Fusion is outrageously good for the price. So take your free subscription and go to FreeCAD, or other halfway house for amatuers, and there will be far less wingeing..",
    "likes": 3,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-04-06T08:50:35"
  },
  {
    "text": "What is the way to go for a small hobby gunsmith that wants to engrave say names or designs on firearms? Id rather NOT support China..like made in USA products.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-06T01:28:58"
  },
  {
    "text": "How does the ortur laser master 2 compare to the Atomstack a5?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-04-05T15:34:51"
  },
  {
    "text": "Thank you for all. This is a great video. Can't I wait for it arrive. Do you know how to install air asistence?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-04-03T09:35:12"
  },
  {
    "text": "This was so amazing, it can move around to see woww",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-04-02T19:53:26"
  },
  {
    "text": "is there any laser engraver that works on cylindrical metal objects covered by acrylic or epoxy resin?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-02T17:59:01"
  },
  {
    "text": "Hey bro im thinking about getting one of these care to help me out on finding the cheapest one I can for polymer?! Please and thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-04-02T05:14:54"
  },
  {
    "text": "Would this work if I punch holes in an art canvas? Thanks! :-)",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY",
    "video_id": "d3paxgFMtYk",
    "date": "2021-04-01T20:58:13"
  },
  {
    "text": "can Photogrammetry produce a 3d model for a cnc router..?",
    "likes": 1,
    "video": "Turn Real Things into 3D Models with Photogrammetry",
    "video_id": "_ip8ODd7QvQ",
    "date": "2021-03-31T11:05:06"
  },
  {
    "text": "What would you recommend for engraving silicone wristbands what machine let's say a budget machine",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-31T02:02:17"
  },
  {
    "text": "Do you also prefer fusion for cnc router work? Im currently learning fusion for cnc and furniture modeling.",
    "likes": 0,
    "video": "This is Why I Use Fusion 360 to Make a Bed.",
    "video_id": "ZB2fe-o41_c",
    "date": "2021-03-30T11:16:46"
  },
  {
    "text": "At 17:50 in the video, is that paper that you are marking? and if so, did it lase through the paper? And what thickness is that paper?",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-03-29T19:54:04"
  },
  {
    "text": "How does this work if I need to engrave something bigger than 400x300?\nI am really in love with Ortur laser engraver, but I would like to buy 900x600mm, would you recommend any other laser brand? Was thinking about Neje...to be in the same budget diode laser",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-29T08:26:13"
  },
  {
    "text": "Use a long board that also wide then easy on the mitre saw.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y",
    "date": "2021-03-28T20:49:34"
  },
  {
    "text": "Which would be best for cutting out sacred geometrical shapes?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-28T16:34:00"
  },
  {
    "text": "HOW MUCH WOULD YOU CHARGE ME IF I HAD YOU CUT ME ONE  ?  I JUST DID THE GIRL TO MEDUSA CHANGING PIC THAT I COULD TRADE YOU ?????",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's Haunted Mansion",
    "video_id": "VGgg1HUTbJ4",
    "date": "2021-03-26T19:00:47"
  },
  {
    "text": "Really enjoy the videos. Do you feel this laser would work well for engraving Lamacoid warning labels? Or do you have any sub $500 suggestions for a laser that would?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-25T21:09:05"
  },
  {
    "text": "Thank you for confirming I don’t want a glowforge, I’m gonna get the blue Chinese laser!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-24T16:42:03"
  },
  {
    "text": "Very informative. How long did it take to do the large portrait?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-24T01:52:10"
  },
  {
    "text": "I'm a little hesitant on buying a random one on ebay that could be coming from anywhere so I'm going to buy directly from your link that goes to the company page.  I can't wait to get it!",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-03-24T01:07:12"
  },
  {
    "text": "even today the personal use license is free for 1 year only, the fear that they might take it away in the future is always there \nwhat do you think?",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-03-23T18:59:22"
  },
  {
    "text": "Right now it says 1 year free .... to me that means the risk of loosing what you spent so much time learning before you can afford it...",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-03-23T01:14:50"
  },
  {
    "text": "Hi,could you recomend a laser cutting machine for jewelry, laser star is awsone but very expensive. \nLooking to invest 8k to 10k ,thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-22T22:15:16"
  },
  {
    "text": "Thank you so much for this video. I’ve jus t bit the bullet and bought a K40. Total novice. This helped me so much. be back soon. ;-)",
    "likes": 2,
    "video": "Testing the OM Tech K40 Laser",
    "video_id": "GjfWcQidYLM",
    "date": "2021-03-22T22:07:14"
  },
  {
    "text": "i tried on my VR and i’m afraid i’m starting to be convinced the earth is flat",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-03-22T21:05:21"
  },
  {
    "text": "So what’s a good one for engraving zippo lighters ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-22T02:35:02"
  },
  {
    "text": "Will the glowforge stipple glock frames, pmags, etc?? My wife wants to make crafts,  and i agreed to it so long as it will do the work i wanna do occasionally also. Any suggestions for what would be best for this situation? Thanks everyone.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-22T02:07:55"
  },
  {
    "text": "I bought the paint organization system recently and the files are in pdf format.You have no contacts on the website and no information so i had to contact you here.How do i import the file in lightburn?I tought the files are in DXF but PDF, why?I need them in dxf format for laser cutting.Need help.",
    "likes": 2,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg",
    "date": "2021-03-21T19:29:18"
  },
  {
    "text": "Hey so i got a question what kind of Machine would i need if i want to cut fabrics like felt insert with adhesive, fusible web and satin? it needs to be precise and not burn the material.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-21T19:26:57"
  },
  {
    "text": "Nice review. Have you tried laser engraving a wooden or acrylic pen. If yes, what were the results? Thanks for sharing.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw",
    "date": "2021-03-21T17:17:39"
  },
  {
    "text": "How tall is the table that you have ur 50W on top of?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-03-20T21:17:37"
  },
  {
    "text": "You didn't answer the question: Is it the best budget laser engraver?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-19T17:15:52"
  },
  {
    "text": "Please correct me, but aside from specialized spray, I'm almost positive anodized aluminum is engrave-able in CO2 lasers..",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-03-18T19:19:06"
  },
  {
    "text": "Definitely one of the better videos, i appreciate you comparing more than only kickstarter\\novelty machines - I didnt catch this in the video, but any experience with Thunder Laser?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-18T00:10:05"
  },
  {
    "text": "Great video!  I own a Glowforge, but I've had a few pet peeves.  The biggest is that I can't use AutoCAD files with it.  Is this unit different?",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?",
    "video_id": "Cls3-R8BoEs",
    "date": "2021-03-17T17:22:11"
  },
  {
    "text": "I want a laser to add logo to cutting boards— will the ortur 2 do the job?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-17T15:32:08"
  },
  {
    "text": "I missed this video around Halloween time but got to see it now.  It came out great.  I wanted to have this done as large as the original if I could have found someone with a CNC but no dice here in NYC.  Glad you liked my photoscan of the Plaque.  It came out better than I originally thought it would but too bad Autodesk decided to discontinue its photoscan program.  It was the only one that I've used that worked great.",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's Haunted Mansion",
    "video_id": "VGgg1HUTbJ4",
    "date": "2021-03-17T12:10:00"
  },
  {
    "text": "Does it come with any bits? And does standard bits fit into it?  I have their laser and love it. Am totally new to cnc routers though so this would be my first time using one. Is it the best for this price point?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-03-17T00:56:10"
  },
  {
    "text": "I was going to buy your fusion 360 course, but after watching this I don’t know...you were kind of all over the place and really fast.",
    "likes": 13,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-03-16T23:45:12"
  },
  {
    "text": "please stop leaning in to the camera, it doesn't make for great viewing, great vid others wise.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-03-16T01:04:05"
  },
  {
    "text": "Thanks for the review. I am interested in seeing if it will work on a round object and also the minimum distance from the material to the laser. I'm a wood turner so Id like to use it to embellish the rims of bowls and sign the bottom of my work.",
    "likes": 4,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-03-16T00:08:05"
  },
  {
    "text": "Thank you for your help. do you think the simply DIY can work for a small personalized iphone case covers where you put customers names ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-15T22:59:37"
  },
  {
    "text": "is this exposed laser safe for the eyes? i know they come with a pair of goggles but i dont know if they are adequate or if other people in the room are safe. Should i build an enclosure?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-15T10:01:16"
  },
  {
    "text": "have you heard about this lazer? this guy swears by it\n\nhttps://www.youtube.com/watch?v=7P661CYrgh4",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-03-15T06:23:05"
  },
  {
    "text": "I wish you would have done this indoors, controlled lighting",
    "likes": 0,
    "video": "Turn Real Things into 3D Models with Photogrammetry",
    "video_id": "_ip8ODd7QvQ",
    "date": "2021-03-15T05:59:51"
  },
  {
    "text": "If you made that chart yourself based on your own experimentation, I'm subscribing. That was a great read whilst high.",
    "likes": 11,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-15T05:23:59"
  },
  {
    "text": "Would you say this is better than the glowforge? I was thinking of using it to make large stamps",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-03-15T05:23:10"
  },
  {
    "text": "would you say this is better or comparable to a glowforge? it seems like the price is unbeatable",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 Laser",
    "video_id": "W5LaxGh2l1c",
    "date": "2021-03-15T05:06:06"
  },
  {
    "text": "Your videos are horribly presented.  Maybe if you spoke more slowly, you wouldn't be making so many mistakes requiring so many jarring cuts.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-14T12:46:45"
  },
  {
    "text": "Hello can this engrave on cylinders? Like tumblers and cups?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg",
    "date": "2021-03-14T11:33:42"
  },
  {
    "text": "I am still really lost. I want a laser cutter to make dollhouse miniatures in 1:12 scale at the largest and 1:144 scale at the smallest. I have a Cricut Maker cutting machine and it doesn't cut precisely and small enough which is why I'm looking for a laser cutter instead. The most common materials I would cut would be around 2mm or less, matboard to thin wood.\n\nI'm 33 but I find technology to be a little annoying. It's not my favorite thing to figure out software and do upgrades. I don't think I'm even capable. So I need something user friendly that I can use with SVG files.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-13T18:39:44"
  },
  {
    "text": "I have heard about engraving metal objects and cutting 3D puzzle pieces but i read that reflective surfaces are bad for this type of work. Can you test if those are true?",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-03-13T06:15:18"
  },
  {
    "text": "Why use fish eye lens? Not what your your real eyes would see 🤦🏾‍♂️",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-03-13T05:10:56"
  },
  {
    "text": "This is by far the best laser cutter video I’ve seen.. I’ve been researching for weeks and was really overwhelmed. Thank you for the comprehensive reviews and including so many options for us to further review. I especially appreciate that you included a variety of price ranges as well as ease of usage - or lack there of.\nThis is exactly what I was looking for, thank you for taking the time to put this together!",
    "likes": 21,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-12T08:07:37"
  },
  {
    "text": "I bought this in a 20w however, it did work the motherboard on machine was faulty.  Got to looking at reviews and alot of people that have bought it also had same problem. Would not recommend this laser.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-12T06:08:33"
  },
  {
    "text": "I see flerflers in the comments \nI just wanna say one thing. If this is flat earth proof , why can i only se america \nWhy cant i see europe asia australia and antartica \nAre you flerflers saying america is the whole earth",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-03-11T17:16:37"
  },
  {
    "text": "This is a great video! Thank you so much for the input! Curious, what's a good engraver that would work with a curved surface? For ex. Bracelets?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-11T10:23:14"
  },
  {
    "text": "Hi there, I've checked the comments but I can't see an answer, is the OMtech k40 compatible with Mac? Thanks",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-03-10T14:27:13"
  },
  {
    "text": "Hi, I am new to CNC .. which machine do you advise me to use?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-10T05:05:27"
  },
  {
    "text": "I'm looking to create acrylic stamps to use for my bakery and want to know what's best but also small to cut detailed designs into acrylic. Any suggestions??",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-10T02:47:13"
  },
  {
    "text": "will this laser engrave letters and numbers on a plastic cattle ear tag.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-03-07T20:59:37"
  },
  {
    "text": "thanks for a great video.. I've been thinking of purchasing a laser cutter for my hobby crafting..",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-07T14:18:21"
  },
  {
    "text": "slow it down buddy.  we are absolute beginners right",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-03-06T06:54:50"
  },
  {
    "text": "Which laser engraver would you recommend for larger pieces kn a budget. Not necessarily big pieces just taller pieces, around 30cm max height.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-06T02:01:46"
  },
  {
    "text": "Why are there no go pro videos from flat earthers proving the earth is flat?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-03-05T15:47:35"
  },
  {
    "text": "I want to engrave my desk ... So i guess this would work?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-04T23:50:23"
  },
  {
    "text": "Does the wispherer software left you use this with a Mac? And would it cut 1/4 thick plywood ?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-03-04T23:38:16"
  },
  {
    "text": "I regret that I bought the Ortur. It’s seriously horrible.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-04T22:26:37"
  },
  {
    "text": "Do you think the first engraver from ortur would be able to cut this 3M adhesive into shapes for my mouse feet pad replacements?\nIf so how would you place the 3M adhesive flat on the table?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-03-04T22:09:11"
  },
  {
    "text": "I don't recommend Voiern laser machine, I bought one in December, a 20W fiber laser, it works well one month and suddenly died. The supplier, Voiern (Jennifer Zhao) doesn't offer any help but to tell me to install the drivers again and again. Bad services and very poor quality product!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-03-03T16:35:37"
  },
  {
    "text": "I am just getting into laser woodworking, any suggestions on what machine I should purchase to make 3D chess pieces and able to laser cut up to 1/2 in wood, if that is even possible.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-03-03T14:13:36"
  },
  {
    "text": "Nice review this one looks interesting 🧐. How would you compare this to the glowforge and muse full spectrum ? I’m looking for something that can do it all. I’d have a easier time saying yes but if the more expensive one will save me a headache I can save up to invest in those too. Thanks for the video 🙏🏼",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?",
    "video_id": "Cls3-R8BoEs",
    "date": "2021-03-02T08:38:33"
  },
  {
    "text": "Any chance is there a cnc laser engraver and cnc router combos that you can do a list on?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-02-28T20:15:59"
  },
  {
    "text": "Don't cut plastic if you don't research what gases or fumes will be given off!!  for instance vinyl\ngives off Hydrochloric Acid fumes that will rust any thing they contact and destroy your lungs if you breath it.  PVC will give off Chlorine gas.  Deadly. used as a chemical weapon in the first world war.   Be safe. RESEARCH before you cut plastics.  The glue in some wood products is toxic when burned as well.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-02-28T19:15:12"
  },
  {
    "text": "Thank you for this video! I am very interested in 3D CAD and printing for private use. What would you recommended to beginners? Fusion 360 or Freecad?",
    "likes": 6,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-02-28T10:47:47"
  },
  {
    "text": "Is there any laptop computer that this lazer cutter does not work with or can you point me in the direction to find that info out?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-02-28T03:48:55"
  },
  {
    "text": "Hi. Which Laser would you recommend to cut fabric (cotton, poly, corduroy, fleece) for applique shapes?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-28T01:14:48"
  },
  {
    "text": "I recommend Woodglut to every beginner and not only.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU",
    "date": "2021-02-27T23:05:29"
  },
  {
    "text": "I just ordered one. I get that this one won’t work on most steels, but can you recommend a baseline setting to engrave steels? I’d been looking to build a 3D printer frame one, but I can’t get a straight answer for metals. I need to be able to serialized and logo small metal, un coated parts.",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-02-27T22:22:23"
  },
  {
    "text": "I want to graver high carbon steel blades which are the best for this",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-27T14:58:33"
  },
  {
    "text": "Hey, anybody here tried smaller laser engravers, mobile ones? I need to engrave inside a wooden tube, usually 10-20“ diameter, perfect would be if 8“ is also possible - which means the surface is round, and it would have to operate inside of a tube. The version one might work well, as it has an extended laser arm, not the typical x/y table.  What i am about to engrave is drum shells from inside... 3x3“ minimum. Anybody?!",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-02-27T11:57:39"
  },
  {
    "text": "Will this ORTUR work on engraving PMAGs or do I need a Fiber Laser like the one shown in your other video (Laser Master Fiber Laser Marking Plastic - AR15 PMAG)? \n\nMy immediate need is to engrave 40 PMAGs so it's hard to justify buying a Fiber Laser.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-02-25T18:07:37"
  },
  {
    "text": "if ya wanna be nice you could send me that Makeblock laserbox please. lol het it don't hurt to ask nicely",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?",
    "video_id": "Cls3-R8BoEs",
    "date": "2021-02-25T12:03:34"
  },
  {
    "text": "Nice Video and has a lot of information in it.    I want to get into a Laser Engraver but of course there is so much info to digest and make decisions on.    Because of the COVID virus we have now lost the only place I would have gone to look at and ask questions about it.  That is FRY's Electronics.  I was going to build a newer computer with newer components.  I like to buy locally and now there is no second choice place to go.  The whole printing and engraving environment is changing so fast I have been deliberately slow to get involved and jump in.  Would you be able to make suggestions on where to focus if I mentioned some of the criteria involved?  1)  Engrave small objects like in the size of Keys, Knife handles and up to the size of 6 inches square for just a little more versatility;  2)  Because of size - price should be small due to the versatility and usefulness is reduced (comparatively);  3)  Precision - due to the size of the engravings they will be examined closely.  4)  Engrave or etch but NOT cut through.  5) Small because of my needs and can't have it take up a lot of room.   6)  Engrave any metals that will dis-color noticeably. \n\nAll these are valid reasons that must be evaluated together.     If you can please give me a few suggestions.  Because I don't know what the prices may be, please consider price to be of the lesser requirement.  I want a good one that will do the job.  Thanks for your help.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-25T10:48:52"
  },
  {
    "text": "Just ordered the Master 2 laser which I am still waiting for but looking at the steel plate at the bottom,what would you put under it to do cutout like Yoda with solid wood?Would you go through and hit the plate? Really new to this stuff so hope it's not a dumb question.Thanks",
    "likes": 3,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-02-25T02:55:14"
  },
  {
    "text": "NO, I am a maker, and I cannot use my 5 axis cnc that i made from scrap material, they are getting important features away from makers. I cannot afford paying the license, and that's frustrating, mainly for a user like me that contributed with so many youtube videos about fusion360. Now i cannot make my videos anymore and i will have to look to another solution to replace fusion360 for real",
    "likes": 5,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-02-24T21:22:05"
  },
  {
    "text": "This video is all I ever wanted and needed. Thank you!!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-23T23:48:40"
  },
  {
    "text": "i use f360 but still confused to add some model like sketch up did. i mean add some stuff like stove, cup etc, in sketch up we can download in, can the fusion 360 did it to?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-02-23T02:38:09"
  },
  {
    "text": "Hi there, can this be used to engrave in brass? I am looking for a machine capable of engraving small wax seal heads in brass. thanks",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-02-22T18:15:38"
  },
  {
    "text": "So what's the next best thing? Moi? Kus I have a feeling this bullshitnis just the beginning. Ugh...",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-02-22T14:35:39"
  },
  {
    "text": "This is super helpful. Are you also able to get a useful cut list from Fusion?",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-02-22T02:35:07"
  },
  {
    "text": "just got good deal on Agnes by hurricane lasers curious of your opinion on it im totally new to it",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-21T07:03:52"
  },
  {
    "text": "I'm looking for a machine that will crave on rubber for rubber stamp making.  What machine would you recommend for this function please?  TY  would this machine work for that?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-02-21T01:41:29"
  },
  {
    "text": "Im happy for Vectric, having it for the rest of my life, thats no paine and waste of time.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-02-20T01:10:21"
  },
  {
    "text": "Nom: LegHight \nUnité : mm\nExpression : OverAllHight/2\nValeur : 203.20 \nMe : 😍🥰😍\nThank you so much I didn’t know this existed",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-02-19T16:09:46"
  },
  {
    "text": "the weakest link is the rod, both machines have 10 or 12 mm rods and they will bend the same, even if a steel frame is used it will not differ. Supported rails or linear rails should be used for a rigid x axis",
    "likes": 4,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-02-19T10:24:26"
  },
  {
    "text": "was a great video to stumble upon after trying to find some honest answers on engraving as a total beginner! I diddd have a specific question, you mentioned briefly \"logo on cutting board\" which is my intent for one, however the unit i was looking at was kind of a box that had everything inside of it. the diode was 3w, but no one ever says \"it can engrave all of these, dont get it if you use it on these\". I want it to be able to do walnut, but everything always just says wood, and there are so many species of wood of different hardness, i cannot for the life of me find a simple yes. In your opinion, 3w diode able to surface engrave (maybe 1/8\") walnut, and other hardwoods.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-18T20:03:37"
  },
  {
    "text": "is it possible to import a sketchup model into fusion 360 ?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-02-18T02:09:25"
  },
  {
    "text": "This one is the muse fiber right? That’s the only one that can engrave metal?",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser",
    "video_id": "12qsUg0XpTo",
    "date": "2021-02-17T05:55:26"
  },
  {
    "text": "Hi, please help, I'm looking for a laser to be able to engrave cloth (cotton, polyester). I've encoutered that not all lasers are able to even leave a mark on the cloth, so your expertise would be MUCH appreciated!!!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-16T12:03:12"
  },
  {
    "text": "Definitely excited to see what upgrades you're gonna do and how to do them.",
    "likes": 6,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-02-16T09:30:58"
  },
  {
    "text": "Thank you for sharing this! I was just wondering when you say the diode lasers are good for engraving, does that apply to all materials? Is it just a light etching of the surface or can it emboss silicone, for example ?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-15T14:17:51"
  },
  {
    "text": "what would i need if i wanted to cut 50-100 sheets of cardboard at a time?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-15T13:07:44"
  },
  {
    "text": "great video but the detail is far to quick gone over, so missing the detail your trying to show!",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o",
    "date": "2021-02-15T12:06:00"
  },
  {
    "text": "Im looking For a laser engraver to customize barber clipper blades any suggestions???",
    "likes": 0,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look",
    "video_id": "fa7JugG_6-g",
    "date": "2021-02-15T11:41:29"
  },
  {
    "text": "Well, at this moment it is impossible to use the free version of Fusion 360. Now, there are good much problems with the files you can modify or not, but also with the files you want to export.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-02-15T10:03:18"
  },
  {
    "text": "Hi, very nice review. One question, did you receive the laser from China or the US? I'm planning on buying one and this would be one point in considering. If in US, can you provide the necessary info to acquire?  Thank you in advance.",
    "likes": 2,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?",
    "video_id": "Cls3-R8BoEs",
    "date": "2021-02-14T23:55:38"
  },
  {
    "text": "waste of money and time get a kuka robot arm \non ebay",
    "likes": 1,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look",
    "video_id": "fa7JugG_6-g",
    "date": "2021-02-13T02:17:53"
  },
  {
    "text": "I'm searching for a laser cutter for my sewing room. I would like to cut thick leather (both natural and synthetic) what is the most affordable laser cutter that will do the job?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-02-12T08:14:58"
  },
  {
    "text": "10 files is NOT enough. I’ll be sticking to Creo, yes that dumpster fire.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2021-02-12T05:32:14"
  },
  {
    "text": "1:29:20 I only see a straight horizon where the hell is the curve ?",
    "likes": 7,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-02-11T08:06:04"
  }
]