[
  {
    "text": "Hello do you know something about the Gweike Cloud ? is it any good ? =)",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-07-23T13:57:55"
  },
  {
    "text": "Excellent tutorial, Thanks. One question I have is about Fusion 360 itself. When calculating the tool paths it takes a while on my computer which is quite a powerful machine. I7, 16 GB ram, 4 GB dedicated video ram gaming rig running windows 10. I also noticed that Fusion 360 crashes and freezes a lot. Is that normal?",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "video_id": "Y-OU0yaD62w",
    "date": "2021-07-23T10:33:34"
  },
  {
    "text": "thanks for using a real camera and not that fish eye crap.",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-07-22T18:09:35"
  },
  {
    "text": "Question... over all will a CO2 engrave paint coated yeti cups?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-07-22T05:18:59"
  },
  {
    "text": "Great vid and like your site too.\n\nDo you know of a decent engraver that will do cylindrical objects? I see the Ortur has an attachment for cylinder objects, but it looks a little limited...I'd be looking for one that maybe works vertically, something like would hold a \"not entirely round (cylinder)\" like a cup or glass...??",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg",
    "date": "2021-07-21T15:33:00"
  },
  {
    "text": "Great video, thanks for that! Can you make a video about the safety of these? I thought class 4 lasers had to be enclosed, so would love to learn more about potential safety concerns for open systems. Are safety glasses only really all it takes?",
    "likes": 9,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-21T07:33:09"
  },
  {
    "text": "Now I am 57 years old  not as great with today’s Technology as much as you young guys are but I  do try my best  looking at this unit for $1500.00. Freaks me out  my very first car I purchased was 2 years old from a Used Car Dealership  cost me $2,0000.00  total and I drove that for 14 years  and sold it for a profit  sure I had typical maintenance costs but nothing major in all those years BTW. It was a 2 seater Convertible Sports Car  and I lived in SouthFlorida. For many years",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-07-20T15:00:41"
  },
  {
    "text": "need some cross wind that lens is gonnna get smoked to the pt of not burning quik. the auto focus censor is a big contributor here as it blocks the smoke in close to the lens",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-07-19T14:56:12"
  },
  {
    "text": "Is there a link as to which version of fusion 360 to download?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-07-17T19:45:05"
  },
  {
    "text": "I have been watching your videos on the Ortur and I really want to \"downgrade\" to one just to say I have one, I feel like I'm missing out on something lol plus they're so fun to watch.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-07-17T19:25:08"
  },
  {
    "text": "best way to protect the colored tiles, spray or paint clear coat on them, and opn the last coat, pop into a toaster oven at 300F for 20 minutes, then turn off said oven and let naturally cool., This will bake on the clear coat",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-07-17T15:45:44"
  },
  {
    "text": "Can this machine cut stainless steel or just engrave on it?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-17T04:30:45"
  },
  {
    "text": "\"this is probably one of the hardest most involved projects i've ever done, but let's be honest, my wife has been doing the hard stuff\" instant like on the video right there.",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodworking",
    "video_id": "3JsR6qb-Dmg",
    "date": "2021-07-16T19:52:02"
  },
  {
    "text": "What do you think of the AP Lazers?  I am looking at getting one soon to start a small side business.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-07-16T16:16:11"
  },
  {
    "text": "The NWT is very simple. Just use Titanium oxide and a bit of water or so. Paint the tile, engrave an boom. U have the look. Dont need white paint for this. Cause it is to much chemicals in there. Only Titanium dioxide and all goes well.",
    "likes": 4,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-07-15T11:19:31"
  },
  {
    "text": "Great tutorial!  Thank you for taking the time sharing.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "video_id": "Y-OU0yaD62w",
    "date": "2021-07-15T00:04:36"
  },
  {
    "text": "Used your referral link for a K40! Thanks for the video.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-07-14T21:14:48"
  },
  {
    "text": "Fiber lasers don't use \"a bunch of diodes\".  In a fiber laser, the laser light is created inside of a specially \"doped\" fiber.  It's the fiber that provides the light amplification and \"pumps\" the light.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-14T13:29:49"
  },
  {
    "text": "om tech is one of the worst companies I've ever dealt with.  There customer service is absolutely atrocious.  i received a laser with a massive dent in the side.  it had touch up paint on it.  paint missing, and there was no paint chips inside the container.  They lied multiple times about having a shipping company scheduled to come pick up the laser to ship back.  I wasted multiple days waiting for a shipping company to show up.  it wasn't until i threatened to do a full charge back on my card through my bank that they finally sent a shipping company to pick up the damaged laser.  this company will never get another penny from me.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-14T02:03:38"
  },
  {
    "text": "I'm sure you are using the wrong safety goggles for this laser. This diode laser works with 440-450 nm. The green safety goggles are for 500-570nm.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-13T22:23:35"
  },
  {
    "text": "Do all laser machines need to be connected to a laptop or computer to operate ? Can an ipad be used instead ?\n\nAre all laser machines compatiable with Microsoft Office Word docs ? Or only vector software ?\n\nThanks for your vids.\nThey are very useful !",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-07-13T12:53:21"
  },
  {
    "text": "Great review. I'm debating btw Mira 7, Thunderlaser Nova 24 or the Muse. There's a $3k difference form the Muse Core (no camera) ...do you recommend having the camera? Thanks for any help.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-07-13T01:02:07"
  },
  {
    "text": "Should have went with the 50W.  Best starter without upgrading down the road",
    "likes": 3,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-12T16:05:13"
  },
  {
    "text": "Hi fellows. I think you need to take some time and take a fast tour on Woodglut website.",
    "likes": 0,
    "video": "Build a Baby Gate (for cheap) // DIY Woodworking",
    "video_id": "zDffk0gFmVQ",
    "date": "2021-07-12T07:34:34"
  },
  {
    "text": "all I see is the ground - its pointing down the whole time",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-07-12T02:48:26"
  },
  {
    "text": "Will u need a upgrading cooling fan for the laser? I would imagine the motor gets really hot after working @100% for a long time or does it work good for hours with no problems? I’m trying to get started, but I wanna work out the details first",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-07-11T20:56:20"
  },
  {
    "text": "You got a really good microphone. Not so much as a minute in and first thing I note is that it's not like you're in my room, it's like you're talking in my ear.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "video_id": "Y-OU0yaD62w",
    "date": "2021-07-11T03:15:21"
  },
  {
    "text": "3:00 the edges will also be slanted if you manage to cut.  Can you cut?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-11T00:19:28"
  },
  {
    "text": "Please give the model, price and where to buy it. Thank you",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-10T21:57:42"
  },
  {
    "text": "Did you purchase directly from the Ortur Website? I bought a Makeblock but it's attachment does not allow for stemware or anything with a handle, also the Ortur has the Lightburn that I hope will be a great addition for picture engraving.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-10T20:26:33"
  },
  {
    "text": "Really helpful to see how to setup these multiple passes. This is what I was still missing.",
    "likes": 5,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "video_id": "Y-OU0yaD62w",
    "date": "2021-07-09T08:32:25"
  },
  {
    "text": "The best paint I've found for NWT is Rustoleum Antique White. I did have trouble finding it at Lowe's and Ace Hardware but Home Depot had it.",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-07-09T04:31:39"
  },
  {
    "text": "I have a tile I made with the first method that I have been using as my daily coaster for like 6 months. No chipped paint. I just sprayed it with a couple coats of Polycrylic.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-07-09T04:29:48"
  },
  {
    "text": "Can we add air assist to the pro version or it's only recommended for the master 2 version?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-09T01:56:51"
  },
  {
    "text": "Woodprix is a solid company with solid woodworking plans.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-07-08T20:14:52"
  },
  {
    "text": "Can this unit be used to engrave metal such as a firearm? Can it etch polymer?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-07-08T17:47:39"
  },
  {
    "text": "I'm really hype by this kind of laser as i'm making watches, and i think this could be very usefull for the dials, but i'm not sure if the precision of this one is enought.\nIf i send you a dial file, can you try it on another video tu see the result ? (i'm mostyl working on anodysed aluminium)\n\nAlso ... i'll have to find if the deliver in France",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-07T11:30:00"
  },
  {
    "text": "have you tried Fox Alien laser engraver/cutter yet.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-07T08:02:29"
  },
  {
    "text": "Hey, I just picked one up and wanted to know what to do with the ground... doesn't the plug already run a ground? Why would I need to ground it twice?",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 Laser",
    "video_id": "W5LaxGh2l1c",
    "date": "2021-07-07T06:18:22"
  },
  {
    "text": "I’m currently trying to save up money for a laser engraver, I entered the giveaway but probs not gonna win, you guys know any sub 300 dollar laser suggestions that ship to the EU let me know 👌",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-07-07T05:57:35"
  },
  {
    "text": "i buy thus glasses for the sun.... do they really work for protecting the eyes ??? i thought that only the green ones or orage ones worked.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-07T04:46:39"
  },
  {
    "text": "6:13 0,079 inches or mm ??? If it´s inches, it would then be 2mm (=0,079inches)... Anyway, can it cut 0,1mm iron-transformator-laminates ???",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-06T18:34:14"
  },
  {
    "text": "Thank you, I've just purchased this item based on this review. I'm going to use it to customize my leather. The code still works but only gives $5 off now.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-06T16:18:46"
  },
  {
    "text": "It's good to see Woodprix have new instructions to save my money and energy to build it.",
    "likes": 0,
    "video": "Build a Built-In Closet Organizer (Woodworking DIY)",
    "video_id": "_CnF5mvUXYQ",
    "date": "2021-07-06T14:27:48"
  },
  {
    "text": "Great explain about the fiber laser marking machine.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-06T08:58:03"
  },
  {
    "text": "You should remove the button stickers and engrave the button text :)",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-05T16:21:57"
  },
  {
    "text": "The laser looks awesome... .one more thing for the wishlist.  Also - I really hate to be that guy - but that is the Gettysburg Address, not The emancipation proclamation. Love your work!",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-05T01:41:08"
  },
  {
    "text": "how wide was your recovery radius? intrested in the details..",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-07-04T23:01:08"
  },
  {
    "text": "Fiber lasers can engrave metal, and more powerful ones can cut up to 3” steel. There’s nothing new about this. There are lots of fiber lasers out there. This is far from the first. There are gantry fiber lasers as well, but they’re big. But they’re expensive. Very expensive. That’s the only problem with them.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-04T18:59:19"
  },
  {
    "text": "Great overview of Fiber Lasers! Fiber is the love of my life <3",
    "likes": 8,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-04T16:16:39"
  },
  {
    "text": "Stunning I'd love to try this man is it hard? I'll have to research..",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-07-04T13:34:46"
  },
  {
    "text": "I found your your video very interesting and informative, and as a photographer who makes aluminum prints of my photos, I'm curious about the possible applications for this in my work.\n\nDo you have any idea how much heat is generated by engraving onto aluminum? I'm curious whether it can be used on the back side of my prints without damaging the actual print and clear coat on the reverse side.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-04T13:29:04"
  },
  {
    "text": "Literally the only person on YouTube I have come across who has covered this type of laser this way. If you can go in more detail on making actual projects thatd be great.",
    "likes": 6,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-04T13:12:46"
  },
  {
    "text": "Hi, I've been looking at getting this unit and had a question. Is there a way to remotely operate the unit like one does with a 3d printer with a USB stick. \n\nI want to have the laser cutter out in my workshop but my PC is inside the house. Do I need a small laptop to run it or can I load files onto a USB stick and run them straight on the machine?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-07-04T12:03:53"
  },
  {
    "text": "Any ventilation reccomendations for an apartment setting? I'm thinking of using a plywood base as the cutting bed (to engrave a grid for zeroing the work), but the ventilation is eluding me",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-04T09:35:43"
  },
  {
    "text": "The fiber laser is unique in that the fibet itself is whar creates the laser light  or more specificly the excited ions doped within the lattice of the crystal or glass fiber. Most of the time or at least for consumer focused fiber lasers they are pumped with a powerful    bank  of LEDs which is the excitation source stimulating the emission of radiation. These types of lasers can be significantly less expensive for maintenance as well as initial cost thanks to the more simple beam path. Obviously there are many other factors involved in the cost of the unit and  quality of the beam,  spectrum of the beam , how the beams pulse shape  and duration are controlled ,  or if it has a continuous wave stable  beam... sorry,  i love lasers haha",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-03T21:48:20"
  },
  {
    "text": "omtech service sucks id never buy from them i call for 3 months to just get info wish i could say better about them but i cant",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-03T19:02:28"
  },
  {
    "text": "Nice review.  Where are those test files that you talked about?  I did not see them in the show notes.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-03T18:57:14"
  },
  {
    "text": "My adventure with the tree began with projects from Woodglut.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-07-03T18:37:53"
  },
  {
    "text": "Anyone have any input on co2  glass laser tubes vs metal laser tubes",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-07-03T12:34:37"
  },
  {
    "text": "Hey Brandon, can you recommend me a laser engraver that is fast but good for paper and wood? I love the speed of this one in the video but as you said in the video it's not as good for wood. Is there no machine that meets my requirements? Your reply would mean a lot!",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-02T19:14:28"
  },
  {
    "text": "Would like to see the rotary engrave inside of a ring. The website just says loading blinking for more than a minute when I clicked the link.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-02T13:26:59"
  },
  {
    "text": "This would actually be decent for marking company computers with computername, location, barcode, anti theft markings and such. But what is the life expectancy compared to a co2 laser?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-02T12:02:16"
  },
  {
    "text": "Gracias por el vídeo.. saludos cordiales desde Santa Fe Argentina!",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y",
    "date": "2021-07-02T02:18:33"
  },
  {
    "text": "I am Binge watching your videos and I really enjoy the details  you include in them  including even your  corny comments   Yep I was one of those kids in the neighborhorhood watching the others sizzle Ants with Magnifying glasses",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-01T18:05:33"
  },
  {
    "text": "I’m wanting to get a fiber laser to do engravings on guns. Can you do a larger area by doing multiple engravings butted up against each other?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-01T15:30:32"
  },
  {
    "text": "What solution would you recommend for attaching an air assist, as the new orange cover now makes it fiddly to get an air tube to the lens easily?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-07-01T12:48:19"
  },
  {
    "text": "*keeping myself from spending all of my savings from the past few months to get a machine I would use to make nic nacs intensifies* (also doesn't help I don't have the space for it)",
    "likes": 3,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-07-01T04:56:25"
  },
  {
    "text": "Hello, will it continue to cut from the area it stopped if the cut is interrupted?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-30T22:10:29"
  },
  {
    "text": "Thank you for all of the videos. What can it cut...?  Can it score, cut, mark cardboard/thick paper? How does it work with plastics? thanks in advance.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-06-30T20:46:20"
  },
  {
    "text": "Could I make a customized credit card with this laser?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-30T14:16:36"
  },
  {
    "text": "0:59 where did you buy this orange protective part?",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-30T13:38:13"
  },
  {
    "text": "Is that test file pre loaded in EZCAD software ? & was the blues shown on black mild steel or stainless ? Thanks & a great video 👍🏽",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-06-30T12:45:44"
  },
  {
    "text": "Very nice! Too bad the Insta360 One X camera is from FISHEYE.....",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-06-30T11:30:03"
  },
  {
    "text": "Do you recommend this line for just engraving on leather?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-30T08:07:27"
  },
  {
    "text": "Just wondering what your thoughts were on the tooli G3 and is it possible to get attachments and tools to carry out all the tasks the G3 can do on any of the engravers you have reviewed?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-29T21:58:42"
  },
  {
    "text": "Awesome, been looking at a fibre but cost is prohibitive",
    "likes": 3,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-06-29T12:41:22"
  },
  {
    "text": "This is cool! I didn't even know these types of desktop machines existed. Great review Brandon!",
    "likes": 15,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-06-29T12:30:06"
  },
  {
    "text": "I'm quite happy with my Thunder laser Nova 35 but looking at a Trotec dual laser (CO2 and fibre).",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-06-29T09:41:42"
  },
  {
    "text": "Hi Branden, I just get an Engraving machine, I will ask you for help further. nice to meet you good job.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-06-28T22:19:17"
  },
  {
    "text": "Ortur have to make air assist upgrade. With that i can cut up to 5mm plywood with very good edges, but without - it isn't possible just and you may just burn the material and make small fire.",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-28T16:55:23"
  },
  {
    "text": "Would this be manageable on the ortur laser master 2 (not the pro)",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-28T03:43:14"
  },
  {
    "text": "Selamlar. Ürünün internet sitesinde başka MAKİNA görünmüyor. Eski cihazlar yok. Ben biraz şüphelendim. Sitenin güvenliğinden eminmisiniz?  Ben TÜRKİYE den satın almak istiyorum🤔. Teşekkürler",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-27T16:21:49"
  },
  {
    "text": "Does the machine produce loud noise? I mean I don't want to bother my flat neighbors just incase 😅",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-06-27T01:26:22"
  },
  {
    "text": "thing that confuses me is. these run around £200 but for around £300 you can get a K40 which would do a lot more - so is the K40 a better option for a beginner (with a mac LOL)?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-06-26T19:29:47"
  },
  {
    "text": "I need to cut micro fiber leather, small pieces.  To begin, I cannot spend thousands, what would you buy this or a K40?  I will probably invest in the lightburn software.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-26T16:45:23"
  },
  {
    "text": "may i get your advise? Do you have idea abaout DAJA j3 10w, can u guide me to engrave with this 10W laser machine to metal item? is it abale to cut or any suggestion?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-26T11:37:23"
  },
  {
    "text": "THE PLANET IS FLAT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-06-26T08:34:48"
  },
  {
    "text": "Woodglut comes with very useful plans with all the details you need.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU",
    "date": "2021-06-26T01:21:58"
  },
  {
    "text": "Acetone isn’t alcohol. It’s a ketone. People that fast will actually smell a little like acetone.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-24T23:30:46"
  },
  {
    "text": "Now if they can make one that can cut acrylic and engrave it like a CO2 laser. Also, the laser guard seems like a good idea, but it blocks the fumes from escaping, causing the lens on the laser to get fogged.",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-24T11:32:11"
  },
  {
    "text": "Wait how do they post it on YouTube when it’s up in the sky and it falls down doesn’t it break?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-06-24T06:44:29"
  },
  {
    "text": "I really like it. Also check out Woodglut and plans.",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodworking",
    "video_id": "3JsR6qb-Dmg",
    "date": "2021-06-24T05:48:22"
  },
  {
    "text": "I guess “How to lose your house in a copyright infringement case brought on by Disney” was too long of a title.",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-24T03:50:16"
  },
  {
    "text": "Can I use it to engrave metal, like  steel or aluminum discs? Or metal trays?",
    "likes": 3,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-24T02:27:44"
  },
  {
    "text": "The right paint is so important,  you need one with a high percentage of titanium oxide , also the laser focus is critical and a video would be helpful to users , good video though.",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-24T00:25:30"
  },
  {
    "text": "I bought plans from Woodprix and I did it very quickly.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg",
    "date": "2021-06-23T22:29:52"
  },
  {
    "text": "I have a question. I want to buy a cheap lazer that I can use to do veneer inlays. Can someone point me in the right direction?",
    "likes": 2,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-06-23T19:26:25"
  },
  {
    "text": "Would you recommend this pro version if I can find the 20w non-pro version for $200? Worth the upgrade?",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-23T16:19:08"
  },
  {
    "text": "You probably could get away with just using Rubbing Alcohol rather than Acetone. Just a thought.",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-23T12:39:07"
  },
  {
    "text": "wow this thing looks so cool seems like i will be getting into this stuff soon",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-23T04:18:30"
  },
  {
    "text": "Oh sir I need this so badly, my unemployment ran out and i'm so stuck. I purchased a Lazer Pecker. Sending it back tommorow. I'm not begging I'm pleading on kness..I need this it's all I ever wanted. When will you choose the winner? Thank you ❣Terri",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-22T19:06:57"
  },
  {
    "text": "By any chance, are you planning to build a course on laser engraving?",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-22T18:50:14"
  },
  {
    "text": "the white primer is about the bottom choice, smokey beige from rustoleum, or the 2x paint and primer. work really well. or art paint like kobra white gets deep dark blacks",
    "likes": 14,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-22T17:36:58"
  },
  {
    "text": "for this to work i can not stress strongly enough how important focus is, and the paint type matters alot.\ni am about 600 etched tiles in to this hobby",
    "likes": 6,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-22T17:35:04"
  },
  {
    "text": "Great video. Very valuable information 👍 - would it matter for the tile to be shiny Vs being matt?",
    "likes": 2,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-06-22T14:49:00"
  },
  {
    "text": "Brandon, you're the man!! The fact that you don't have a million subs is beyond me! Great video again, informative and interesting! :) (I do the same type of content in French, and you are definitely one on my \"role models\"...!!)",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-22T14:08:45"
  },
  {
    "text": "https://openbuilds.com/projectresources/laser-shield-box-for-spindle-adapter.285/\n\nGreat DIY laser box.",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-22T02:49:46"
  },
  {
    "text": "would you recommend any 50 W fiber direct diode laser?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-06-21T05:07:15"
  },
  {
    "text": "I would like to do engraving on the wood bowls and platters I make. They could be 4-8 inches deep and may not be flat surface. Sometimes inside a 2\" recess. Would this type machine do that?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-20T19:05:09"
  },
  {
    "text": "What laser would you recommend for someone who'd like to start out laser etching as a side business?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-06-20T09:24:02"
  },
  {
    "text": "I saw a flat horizon all the way up with a local hotspot from the sun. 😒",
    "likes": 5,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-06-20T09:23:19"
  },
  {
    "text": "It's possible cut metal like gold 1.2 mm thickness?????(name plate necklaces)",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-06-20T02:51:25"
  },
  {
    "text": "concerned about fire.  How cold can it be outside and still run as it should",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-18T23:37:03"
  },
  {
    "text": "Is it possible to cut Leather? Like 1-4mm veg tanned Leather.",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-06-18T15:16:10"
  },
  {
    "text": "Hi sir can sell me the laser you least use😆, brand new ones are  quiet expensive 😅",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-18T13:02:18"
  },
  {
    "text": "This was one of the best tutorials I've seen on Fusion!  It was some wonderful combination of 'if you're here you're probably not an idiot' and 'this is complicated, let me explain'.  I wouldn't change a thing about the pace at which you do these.  This isn't a live course and you do have the option of rewinding and watching a part you're stuck at repeatedly to get it just right.",
    "likes": 4,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-06-18T11:34:15"
  },
  {
    "text": "Can the 445nm protective shield \"cover\" be purchased anywhere? I've reached out to Ortur with no reply. I have the \"non pro\" version (LU1-4) and I'd gladly design/3D print a bracket of some sort, if needed, to make it work. Is it \"after-market available\"??? Not seeing it on their site! Please link!",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-18T09:17:32"
  },
  {
    "text": "Im trying to do this as well I wanna start an architecture model making business and sell models and minature furniture. Sadly no money for a laser cutter XD. All my money goes to college too lol.  So fingers crossed I can afford one in the future",
    "likes": 0,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dollhouse)",
    "video_id": "bjurXFYYUj0",
    "date": "2021-06-18T06:09:14"
  },
  {
    "text": "Im thinking of  buying the Neje Master 2 S max  40 watt. Have you reviewed this already? or could you do a review ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-06-17T23:39:52"
  },
  {
    "text": "Hi fellows. I think you need to take some time and take a fast tour on Woodprix website.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-06-17T16:54:08"
  },
  {
    "text": "No cable chain on X axis NEJE are making this look not good I have the\n ortur M2 nothing but problems glasses that come with this ones and the older one are dangerous \nIf I was buying again NEJE \nTHE Z lift should come with it good video but not really any difference to the old one 40w for cutting NEJE DUEL laser also no air to cool cut also the cover will block all the smoke and make it dirty better steppers on this one 400x430 on old one less on this one. over priced front broad is off a 3d printer you will incounter USB DISCONNECTED half way though your work fan on top of the laser cheap and bearing spline goes off centre and catches outer case earthing problems and static build up you have to add extra grounding wires and even to the earth pole outside no joke the pcb.s are not coated or sealed off so your dust plastic wood just goes right in there you buy it you should be able to plug it in after assemble and work but within an hour your modding adding things just to get it to work\nI'd never buy another one \nAnd if your in the UK like me £80 $100 import fee\nThis one does not look much better than the M2 \nI think the product need more thought.. power supply cable chains better molex connectors to steppers and laser air feed nozzle and pipes free Z axis when you buy \nSorry to go on but people need to know these are the few problems with the M2 and most likely this one to \nIf your cutting co2 if it's tiles etc 20w or neje duel 40w with adjustable lense anyway good luck enjoy all",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-16T21:16:12"
  },
  {
    "text": "could the k40 cut thin metal?  I am thinking to engrave and cut out pet id tags.",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-06-16T14:28:55"
  },
  {
    "text": "I'm looking for a laser engraver for doing glass bottles, have any recommendations?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-06-15T21:50:08"
  },
  {
    "text": "There is one very important test you either did not do or did and it would have ruined the review and that is durability testing! Probably the single most important test and one most people are going to be wanting to know more than anything (even if it never crossed their mind)! So how about it, how about REALLY putting it to the test and let us know how long we can expect it to survive before it burns out? The biggest issue with these diode lasers is they are weak and have such dismal life expectancies if that was known before the purchase people would not waste their money and it bothers me that someone like you that works with all types of lasers all the time, at least thats what you claim, one would think you are aware of this major issue! Yet its the one thing you make ZERO mention of and I just have to ask, is that because you already know it sucks?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-06-15T11:48:01"
  }
]