[
  {
    "comment_id": "UgwFTH7R9lNgVL70x2J4AaABAg",
    "video_id": "zYN0vb97caE",
    "video_title": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Smart 20W MOPA Laser Review",
    "comment_text": "After reading the materials you listed I am wondering why stone wasn’t on the list? Would it work on slate?",
    "author_name": "@RanA-xo8ek",
    "published_at": "2022-08-21T01:26:27",
    "like_count": 0,
    "reply_count": 3
  },
  {
    "comment_id": "UgysPYvgMJ0iS_bpI3t4AaABAg",
    "video_id": "XHsf7Hzs-0g",
    "video_title": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "comment_text": "Thanks so much for providing these test files. I've been struggling to find a great resource for settings for my Two Trees 5 watt laser. I just didn't know where to start or what to expect.",
    "author_name": "@LutherBuilds",
    "published_at": "2022-08-20T00:10:21",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgxxNMXGPLarPVnXBtV4AaABAg",
    "video_id": "eZMyGyXsMys",
    "video_title": "The Best Laser engraver on a budget",
    "comment_text": "I think this is the one I'm going to go for, especially as that 10w module seems to improve its usefulness a good bit.",
    "author_name": "@CS-oo6hs",
    "published_at": "2022-08-19T15:47:40",
    "like_count": 12,
    "reply_count": 0
  },
  {
    "comment_id": "UgzLT2cnUvH19qTKw2t4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "DIY air filter:  just spend 100.00 on an external charcoal filter…the kind “grow shop” sells when people want to hide the scent of the type of plants they’re growing in a closet.",
    "author_name": "@peterxyz3541",
    "published_at": "2022-08-19T14:48:03",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw5sjLEXkDngkUwCV14AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "About the Ortur Laser Master 3 in a video comparison with the D1 ( https://youtu.be/DqnwH-5F5U8?t=775 ) the picture appears really better for the Master 3. Have you had the opportunity to compare the D1/D1 pro to the Master 3?",
    "author_name": "@khubfhd4332",
    "published_at": "2022-08-19T10:52:38",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyYVGfiX4Sbxtkt4Ml4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Thank you for your sharing, how is the effect of this machine engraving text at high speed? I would like to know. Thanks!",
    "author_name": "@2andy752",
    "published_at": "2022-08-18T15:38:52",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxJwOhDGniyAdhTQCl4AaABAg",
    "video_id": "85pafRzaf0s",
    "video_title": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "comment_text": "Friend,I really appreciate your work. We are looking for reviewers, would you like to review Longer's laser engraver RAY5 10W?",
    "author_name": "@Longerofficial",
    "published_at": "2022-08-18T12:30:49",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxJL1NJsVDqX3nuXw54AaABAg",
    "video_id": "VGgg1HUTbJ4",
    "video_title": "Making the Ultimate 3D Carved Sign from Disney's Haunted Mansion",
    "comment_text": "This is great, any chance you could post the cleaned up version, or at least instructions for how you cleaned it up.",
    "author_name": "@CoryMakesStuff",
    "published_at": "2022-08-18T04:28:50",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgzN2xyjQ_9Zj80giEp4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "well glowforge is just very well marketed very badly built trash so it's not like it's a truly hard to do better. The prosumer part of the market really needs better competition",
    "author_name": "@MS-gn4gl",
    "published_at": "2022-08-18T02:38:22",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzfd6iQt8t3AwcjDfh4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "According to the G-Machine's website, that should function as a pass through feature. Is there any chance yours is either an older model or needs a firmware update? Thanks for the very informative video by the way!",
    "author_name": "@JohnRobertson22",
    "published_at": "2022-08-17T21:17:52",
    "like_count": 15,
    "reply_count": 1
  },
  {
    "comment_id": "UgzNyA6-DjzzrKQqc3p4AaABAg",
    "video_id": "zYN0vb97caE",
    "video_title": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Smart 20W MOPA Laser Review",
    "comment_text": "using Lightburn with 3p em2 getting unrecognized board signature. ani ideas",
    "author_name": "@BrescoLtd",
    "published_at": "2022-08-17T19:37:58",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyQ6-t4nOEhOFNR8C54AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "With the rectangular spot size depth of cut varies horizontal  vs vertical.    So machine performance us really  limited by the larger dimension. In this case .1mm is pretty sloppy. Best would be .o6 mm Sq. Spot.",
    "author_name": "@denniskramer9788",
    "published_at": "2022-08-17T19:34:10",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxsBspdcplhozKtNRt4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "If you're going to buy this laser, DO NOT go for any of Banggoods offerings as you're likely to lose money. \nEspecially their bundle with the A20 together with the R3 Rotary Roller Pro.  I ordered this several months ago and did not receive the Roller, and I've registered many in the same position.  They're selling goods not produced yet...  It all ended up costing me much, much more.  Not to mention all the wasted time arguing with them...",
    "author_name": "@EspenStabforsmo",
    "published_at": "2022-08-17T14:07:52",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwjw-J0b8RxIfZNZjN4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "This long comment is in no way criticising  this video. It is ,hopefully, adding more techincal colour to this already informative video.\n\n Any 50 watt tube will be 1000mmm long and 50mm diameter. 50 watts is the max power test spec. NOT what you can use. This will be an 800mm long 40 watt tube  that will fit iinsde the 970mm wide case. 50 watts is marketeing speak. There are major issues with fume extraction and Gweike have issued a couple of upgrades (check out their videos). You need air FLOW through the  machine to extract fumes. You cannot get FLOW through a closed box like the Glowforge and the little grill on the Gweike is an inadequate  concession to this requirement of physics. \n600mm/s is a meaningless marketing spec if you dont have the power to damnage material at that speed . Every different type of wood or material has a different damage threshold so the MDF used in this test  requires a critical level light  INTENSITY for a certain EXPOSURE time to damage it. The fixed INTENSITY of a candle flame will damage your hand if you pass it through the flame slow enough.......that demonstates what exposure time means... That is the whole  principle of engraving. The Gweike  has a typical 2\" lens but you can make the candle beam more intense  because Gweike supply a shorter 1.5\" lens. and that means faster engraving .....but poorer cutting. Not an option on the Glowforge. \n\n The overtavel at the end of each scan depende on the speed you choose to scan at. If you decide to run at 300mm/s (as per the video)  then the overtravel  is a fixed non-engraving event.  In this case the Gweike  is running at 250dpi so there are also 250 scans  per inch of image that is 500 non-engraving events per inch. The Glowforge has 450 non engraving events per inch. So there is MORE wasted time on the Gweike but it still engraves quicker becuse of its shorter overtravel (faster acceleration.)  Because the Gweike machine can run with the native Ruida software (RDWorks) or Lightburn. you have the opportunity to crank up the acceleration (software controlled) and make the Gweike run light years faster than the  \"you cant touch anything\" Glowforge.\n\nSpeed is meaningless for cutting, it always has to be done slowly, maybe 10 to 20mm/s would be typical  depending on material and thickness.. Neither machine is setup with  a cutting  configuration where the nozzle would  be close to the work. Thus any air assist is only protecting the lens and not making cutting more efficient. These are essentially engraving machines that can cut inefficiently.  Look at all the brown fume depositions around the cuts., that means  air  assist will do a great job of painting your engravings with this tarry residue.   \n\nCutting should always be done with a single pass, which CO2 lasers can do easily because they operae on a totally different wavelength to diode laserswhich for many physics reasons are very inefficient at cutting and require multiple passes.\n\n Auto focus is a big problem. A lens will be sold with a fixed focal length. But that focal length does NOT apply to lasers.That lens will work as specified if you put it into a telescope or camera where you are focusing an IMAGE with normal random non-coherent light. A laser beam si totally different and there is no IMAGING involved .  the aim is to focus light INTENSITY. If you focus a lens to cut efficiently at 10mm/s  it is certain that the best focal distance will be at least 1mm different to the manufacturer's fixed focus. Now try engraving at 400mm/s and the best focus (thinnest line) will be 2 or 3mm different.. The best focus also depends on the material being used. So power, speed and material can all affect the optimal INTENSITY focal point. So how can auto focus take all these factors into account? Thus the less sophisticated motor driven (software controlled) focus of the Gweike allows you to take thes various parameters into account  and lets YOU select the best focus  when you understand a bit more about the peculiarities of laser technology.\n\n$50/month to ACCESS a machine that you may have already paid $5000 for  seems  scam that no one would ever fall for.   Hmmmm.  Ease of use?. I can remember when I was 5,  I probably had little or no technical ability. This machine would have been a great techno toy where I could make things happen with little or no knowledge of the technology. As a 5 year old it would have still required my dad to set it up before I could \"play\" with it.. This is a well presented video  but he and I  cant unlearn knowledge,  so making a  \"an ease of use\" judgment is very difficult. Where is the baseline?\n\nAs a business machine for making money the Gwieke wins hands down. Its faster (and, with knowledge, can be made even faster),  greater flexibility, much lower price. no forced rental of software and  no need for an internet connection. It also allows you to make mistakes and learn about laser technology in the process, so that  you are prepared for your jump up to a bigger more powerful machine.  Glowforge is a closed box where you have purposely been excluded from learning about laser technology. Its a great business model .\n\n\nFinal technical note. 100%power ?  The tube %power is not really watts. This is glass tube technology and the tube manufacturer specifies the safe  MAXIMUM current allowed to flow through the tube. The tube watts is determined by the current flow. For a 40 watt tube  the max RUNNING current you can use will be 18mA for a 40 watt tube and  19mA for a 45 watt tube (Do I believe Glowforge is 45 watts?  Note the tube dimensions and check on any tube manufacturers website). It is possible to set the high voltage power supply so that 100%power  does not exceed  these limits. This  protects the tube and give it 4 years or more life. I belive the Gweike has an ammeter fitted that allows you to check this.  Glowforge?  I think not.   Exceeding these limits through lack of knowledge  could be expensive and ruin your tube within a year. The mA current flow and watts output are not related linearly   so for example  for your 18mA  max current you will get 40 watts output  but at 1/3 of the current flow (6ma) you will be expecting 33%power ie13 watts.  Sadly no,  because the relationship is non-linear you will probably be delivering 20 or evern 25 watts. The % power applies to current flow through your tube and NOT watts.   50% power is not 20 watts.",
    "author_name": "@SarbarMultimedia",
    "published_at": "2022-08-17T13:25:49",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "Ugz-OZhXO63vCzumppt4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "I heard that sculpfun will also produce 20w machine, are you planning to make a comparison video?",
    "author_name": "@s-yvonne5182",
    "published_at": "2022-08-17T09:33:51",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgyAVz2I4dOBdCumIIF4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "width and length tou covered ...what about height of the object you can place inside?",
    "author_name": "@MrDavesbox1",
    "published_at": "2022-08-17T04:52:58",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwLxayedCWfaBDC_g94AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "As a glowforge owner since the crowdfunding campaign I can honestly say worst purchase of my life.  Terrible, greedy company with an unreliable product.  $50 a month for the most basic software functionality is pure robbery and was an absolute insult to everyone who forked over cash only to wait years through the initial ”delays”.   No reason why it couldn’t be controlled locally with the same features.  Autofocus has never worked for me.  The camera is at best 1/2” off making it basically useless.  It can’t even manage to scan its own QR codes.",
    "author_name": "@collyn89",
    "published_at": "2022-08-17T03:02:49",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugy9ZajwC9fzYKV-Xvp4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "It would seem the next evolution could be a permanently elevated unit with a bed that moves up and down like some of the 3D printers do now.",
    "author_name": "@southerntommygun1353",
    "published_at": "2022-08-16T19:51:57",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw9i1_4XeHdMb4woX54AaABAg",
    "video_id": "XHsf7Hzs-0g",
    "video_title": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "comment_text": "Sculpfun S9 or Atomstack X7 Pro? What to pick as a beginner?",
    "author_name": "@haidergheevala85",
    "published_at": "2022-08-16T15:18:34",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxBICp3EVhOvA38FS54AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Closing thoughts were that I'd go for the Gweike overall. I don't mind getting used to the software. I particularly like the professional look of it for the money. My concern is more based on a recent comment (mom23sweetpeas). These manufacturers really need to get their act together with customer service. It's a deal-breaker at this price level IMO. We're not all mechanically or technically minded. I don't think I'd have had the resilience to have endured all of that, and at the end they had to send back at great inconvenience.\n\nStill it's a shame; the g-machine looks fabulous and would have otherwise been my choice between the two.",
    "author_name": "@ifrtutor",
    "published_at": "2022-08-16T14:03:01",
    "like_count": 3,
    "reply_count": 0
  },
  {
    "comment_id": "UgxECR2e8ai_-ANDDZB4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "I am just really starting to get into this and I am wanting to cut very thin plastics for like stencil art. Will this machine be able to do that well? Thanks",
    "author_name": "@thepacemaker1972",
    "published_at": "2022-08-16T04:20:31",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw8gJwrST_uXoTLXgp4AaABAg",
    "video_id": "XHsf7Hzs-0g",
    "video_title": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "comment_text": "How does the S9 stand up to cutting Basswood for miniature buildings?",
    "author_name": "@craiggeis3346",
    "published_at": "2022-08-16T01:12:59",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxHyxSeZpK-GVXgxSZ4AaABAg",
    "video_id": "zYN0vb97caE",
    "video_title": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Smart 20W MOPA Laser Review",
    "comment_text": "Marking MOPA lasers are almost always(99.999% of the time) fiber lasers. Different topology.",
    "author_name": "@Spirit532",
    "published_at": "2022-08-15T23:56:53",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzv83V3Qi6KyrMdAjh4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "Can you get an extension kit for this one?  Ti make the cutting bed larver?",
    "author_name": "@kenspaceman3938",
    "published_at": "2022-08-15T20:55:37",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyzRhRVjSovI9kjmC54AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Found a couple of videos of the ATOMSTACK A20 Pro and it appears that it does manage 0.05 metal in a single pass so even it took 100 passes to get through 2mm sheet-metal, it would make it worth buying for that reason alone...\n\nhttps://www.youtube.com/watch?v=xwoYhRCM-bo\n\nhttps://www.youtube.com/watch?v=qF0SEpi12Bk\n\nEven 0.5 steel with a double-digit number of passes would make a machine like this orders of magnitude more useful....\n\nFeel like giving it a go?",
    "author_name": "@mastermaker666",
    "published_at": "2022-08-15T20:03:07",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxW0jzMicluwoOWZ3t4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I bought a gweike cloud pro and after setting up it didn't work- spent several hours overnight online with China only to have them tell me I needed a new button (on/off switch) it took over 2 weeks and cost me almost $30 in import fees- so back online overnight and got the button to work - tried the software and it wouldn't cut- engraved but did not cut- went step by step with the engineer online (using ding talk- like what's app- back and forth) he would send me something to try and I would try it and film it- let hi into my computer remotely- which is scary and feels like an invasion of privacy- still didn't work- so then we started to take things apart- pretty much took the whole machine apart and never got down to the problem- I used multimeters to test power supply- added metal to see if it was a connection that needed soldering- we went back and forth for about 9 hours the first night and 8 the next- while the engineer tried hard we did not get it to work and by then I had enough- my machine was in pieces- I am not sure it would have gone back together properly- so I asked for a refund or replacement- as they had nothing in stock I was given a refund ( Don't even ask about the nightmare to ship it back to them)  I might have just gotten a lemon but if you join the Facebook group you will see others that had a problem---In the end I am happy to have dodged a bullet and gotten a refund- I am now the proud owner of a thunder laser!",
    "author_name": "@mom23sweetpeas",
    "published_at": "2022-08-15T19:39:09",
    "like_count": 5,
    "reply_count": 0
  },
  {
    "comment_id": "UgwJxkKoQ-aDT9seHXB4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Well two weeks late I guess.  A lot of people jump on the cloud issue, but I have had my Glowforge for a year and never once had an issue with printing. \nWhen it breaks (probably laser replacement, which means you have to send the machine back) I will look at some of these other machines. Basically they are just trying to copy the Glowforge with no real innovation, but at a reduced cost.\nReally hoping for the next iteration of tech before I have to choose. \nAlso, the subscription software has a lot of add-ins now like patterns, shapes, and borders. it also stores all your prints, so you can reprint something really quick.",
    "author_name": "@Ulfgrum",
    "published_at": "2022-08-15T19:13:52",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgziBJQ1JR_5RjStlNJ4AaABAg",
    "video_id": "S3TneioSp9I",
    "video_title": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "comment_text": "I would like to order this from India may i know where can I find the link for ordering...?!",
    "author_name": "@cuddlebugs-swetha",
    "published_at": "2022-08-15T17:06:36",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy7m5a31pt88ANuSWx4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Our Gweike should be delivered this week, we chose it over the Glow forge because of the price, the ability to use lightburn which we already use for our 40W blue and white Chinese laser, the ability to use it offline and the included rotary table. Honestly after spending hours looking at the pro's and con's of various cutters I cant see why you would have a Glowforge instead of the Gweike other than getting hung up on the brand.",
    "author_name": "@TheBannisters",
    "published_at": "2022-08-15T15:17:01",
    "like_count": 2,
    "reply_count": 3
  },
  {
    "comment_id": "UgyowrnVJ8P4YItGl1Z4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "I ended up with a YoraHome 6050-Pro, larger size, plus air assist is included!",
    "author_name": "@CraftedbyCharles",
    "published_at": "2022-08-15T13:53:38",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxe8De5bEb-RzaGyad4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "So you pay $7000 and still expect to pay monthly for a software. WTF are they serious i was thinking of getting this in the future but with this finding i would rather get one from Chinese brand.",
    "author_name": "@zoetmoments5625",
    "published_at": "2022-08-15T12:09:04",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgyaoJ3Q0ZLycl-FXeh4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "As a current glowforge owner and daily user I would suggest talking about the cleaning and maintenance side of using a machine like this in a future video if you make another someday. When I originally was looking up these machines one thing that I realize now that I never saw was how easy/difficult it was to clean certain parts and how important it was. As an owner of a glowforger for over 2 years I have learned a lot and definitely have things I like and don't like that I hope are changed/kept with future glowforge models and wouldn't mind also seeing how other machines do these things better or worse. Anyways thanks for the vid!",
    "author_name": "@austin_andrade",
    "published_at": "2022-08-15T07:20:12",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgxJ1NwneG-5yolAC0t4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Doesn't it have a pass through slot in the rear on the G-Weike machine?",
    "author_name": "@BrianStreetUnity",
    "published_at": "2022-08-15T06:59:37",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugze83OX0keSzkN5UA14AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "My glowforge pro is great at collecting dust at the back of my shop. If it wasn't free I would be very upset about it.  I have 3 other lasers I used now and will probably never use that cloud based bullshit again",
    "author_name": "@2wheeledgeek555",
    "published_at": "2022-08-15T05:16:04",
    "like_count": 0,
    "reply_count": 8
  },
  {
    "comment_id": "Ugz5v6rcH89YtzzUBNJ4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I was on the fence with Glowforge and after watching this video Looks like I will not be investing 7000.00$ { ok I just rounded the price to the nearest dollar }\nQuestions I never thought about til watching these videos.\nWe are depended on Glowgorce;s cloud service,  Yeah what will happen to my 7K investment?\nWill my investment become a very expensive paper weight?\nWhat will happen if Glowforce closes their doors ( yikes Zero support }\nAlso,, Glowforce for me needs to up their product and after market support.\n*If Glowforge allowed for the use of Lightburn in addition to their software, it would be a 0 no-brainer.*\nSee this is what I mean,  why do other companies offer Lightburn and Glowforce lacks this feature.\nWell,  I am in no hurry,  I will place this purchase on the back-burner for now I'll check this out say in five years and see what direction Laser engravers will be.\nNote of shame,  Glowforce uses the term 3D Cutter ehh, should be removed, selling fake dreams.\n*CHEERS*",
    "author_name": "@anthonyguada",
    "published_at": "2022-08-15T01:27:00",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugx9Z3VEfuEM3CAxHtV4AaABAg",
    "video_id": "HUnskFyscNs",
    "video_title": "Should you upgrade a budget laser cutter?",
    "comment_text": "Yeah we’ll the Glowforge Pro is $6900. And says it’s marked down from $16,000. \nThat seems absurdly stupid expensive for what your getting. I can get an 100w Omtech with a 24x40 bed for $5,400.  And I’m not locked into their software. Seems like a nobrainer!!",
    "author_name": "@MSRWorkshop",
    "published_at": "2022-08-14T14:53:40",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwQphA3fCI6ZOzQ4At4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Always great reviews...  How would you compare this to the xtool D1 Pro 20w? I would be very interested in your answer on this as I am in the market for a laser.   Many thanks",
    "author_name": "@james.5768",
    "published_at": "2022-08-14T11:37:47",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxr60CVsJVlG8nUxQZ4AaABAg",
    "video_id": "XPweRTljgG4",
    "video_title": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "comment_text": "Can you please tell me, what is the camera tethered to. As I can't see any visible line, rope, wire. Showing the camera being attached to the balloon.",
    "author_name": "@mightyatom1404",
    "published_at": "2022-08-14T10:59:26",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy6emJnEY7klJUnVjR4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "Hey love your videos! just had a quick question hopefully you can help me out I’ve been trying to find out if one of these cheaper lasers can do a decent job at putting possibly a three letter logo on borosilicate glass or even possibly quartz without spending $4,000 to $10,000 and getting a UV laser  Which everybody recommends me doing? I just don’t wanna buy one of these and it not work at all so I figured get an opinion from the expert and see what you would think",
    "author_name": "@tjcullen2366",
    "published_at": "2022-08-13T20:25:32",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwXBT1r7vtNm2yeIkR4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "A 30L/min air pump can be had for much less $$ than their $139, this model would be my first but haven't made a decision yet. Kind of surprised you would do a review without having the air assist in place and working, still you obviously have a great deal of experience and will be checking back for more info",
    "author_name": "@precisionarc",
    "published_at": "2022-08-13T20:13:17",
    "like_count": 3,
    "reply_count": 0
  },
  {
    "comment_id": "UgwnvmHkj8RblkrQxfl4AaABAg",
    "video_id": "TAE1QBmVYSI",
    "video_title": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "comment_text": "You can buy a anycubic Chiron and it s bigger and cheaper",
    "author_name": "@crealityender3v277",
    "published_at": "2022-08-13T15:49:06",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxXAKaYbjzuKq4-SdR4AaABAg",
    "video_id": "S3TneioSp9I",
    "video_title": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "comment_text": "Is there a way to import your own files to the app or on the computer? It seems pretty pointless if the only customization you can do is text or drawing.",
    "author_name": "@TourmotoDesign",
    "published_at": "2022-08-13T15:42:31",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugya-RcEbFxRbMyeo794AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Had the absolute worse experience with this printer, they had me even send the unit back and never received a refund. Laser never worked right and even burnt my finger. Not safe.",
    "author_name": "@lifewithlynds436",
    "published_at": "2022-08-13T05:25:38",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy42ZuhoBt1mn9ZIft4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "I asked a question on a FB group about 10W vs 20W and this is the response I received, \"The laser beam for the 10W is round and the 20W is square and bigger, that's why you lose detail.\" Is that a correct statement??",
    "author_name": "@chuckstrunk3746",
    "published_at": "2022-08-12T21:30:50",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxd_Kv57RYuOCT_3YB4AaABAg",
    "video_id": "5uKLnDZTBV4",
    "video_title": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "comment_text": "I love this.\nOne question though, how did you get your projects to be displayed on the side?",
    "author_name": "@brentnora8128",
    "published_at": "2022-08-12T19:47:40",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugx5UGQ7Qfqu1GpphrJ4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Interesting video. Thank you, I never heard of Gweike. I like everything about it, especially how the cloud software can be downloaded for spotting internet, except for the no-passthrough. I wonder if there is a way to make one though.",
    "author_name": "@RoseKindred",
    "published_at": "2022-08-11T18:49:23",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "UgyjA34_kprffK50dV54AaABAg",
    "video_id": "BU6rgzlKA-I",
    "video_title": "Why make THIS?  Aufero Laser 2 Engraver and Cutter Review",
    "comment_text": "I am looking for a Lazar that will allow for my own drawing and cuttings that I can upload to the laser. But affordable. I know many of the CO2 lasers have this capability.  A CO2 laser is a bit much on my budget right now. Any help would be greatly appreciated.",
    "author_name": "@djr3008",
    "published_at": "2022-08-10T13:39:41",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgztTFkD6nqrG8DTqtt4AaABAg",
    "video_id": "CGU72hEqHI8",
    "video_title": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "comment_text": "I'm trying to find a laser that can cut up to 5mm lexan/acrylic any recommendations",
    "author_name": "@Txsparrow",
    "published_at": "2022-08-09T14:37:49",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz0Aqh5O2RILJciyTx4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "I recently bought 40W laser from omtech, but NO WAY can I cut through 5mm MDF with two passes and 20% power... Is there some setup that I can do to make it cut as good as yours?",
    "author_name": "@pw-potter",
    "published_at": "2022-08-09T13:37:53",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxD5txsKt0xQKiW3iZ4AaABAg",
    "video_id": "bCUsQjJNG-4",
    "video_title": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "comment_text": "I just got a reply back from the make it or break it guy. Really appreciated his reply to my comment about his assessment of the lasers that he tests. This guy is one to watch and trust if you are considering on buying a machine.",
    "author_name": "@kennethandjoannjewell999",
    "published_at": "2022-08-09T01:12:28",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwN5_Mrrig42h4GPiV4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Ok, so the new XTool 20w or the Atomstack 20w? Which is going to give more bang for the buck and which one produces a better quality product?",
    "author_name": "@chuckstrunk3746",
    "published_at": "2022-08-08T12:33:51",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgytJbaIfrkuNZh4HeV4AaABAg",
    "video_id": "bCUsQjJNG-4",
    "video_title": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "comment_text": "Your testing and reviews of laser engravers is very thorough but I guess 8 my question is, how can every laser you test be the best. Me and people like me try to get an accurate assessment before buying a laser but am sorry to say that you not only inform us but that you confuse our decision.",
    "author_name": "@kennethandjoannjewell999",
    "published_at": "2022-08-08T11:29:58",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgzWlhVgXLQjExpJRt94AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "A 20W diode laser ALREADY exceeds the capability of 40-50W CO2 machines on cutting. That is because of the smaller dot size. Typical CO2 machines will have a dot size of .1mm to .15mm diameter compared to the dot size of .08mm x .1mm on the diode machines. A smaller dot size means the power is concentrated more. You will NOT be cutting 10mm plywood in a single pass on a 50W CO2 machine (I have one). Also, engravings will not be as crisp, although the larger CO2 machines offer faster engraving output from better rails and more powerful stepper motors.",
    "author_name": "@AndTheCorrectAnswerIs",
    "published_at": "2022-08-08T07:42:27",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwCXjtxCjskcR6LtmF4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "@4:45  why can't you move the motor up in the motor clamp to negate the extra length of the 1/4 bits ?",
    "author_name": "@zukjeff",
    "published_at": "2022-08-08T01:28:25",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgyBPqOvoxQu7gbl13p4AaABAg",
    "video_id": "ZeajuzAjL9M",
    "video_title": "My Favorite Laser Just Got Better! - xTool D1 Upgrades",
    "comment_text": "My niece is tasering  mirrored acrylic sheets with names of wedding guests and seating assignments. The sheets I’ll be made into freestanding light boxes. We’ve been working with it for 2 days. We be tried with air assist, without air assist, lifting the work in various ways, masking the other side, not masking,  with the honeycomb, without it, etc.  we keep getting sparking intermittently and there will be a circular burn mark on the image. So discouraging. We need these made for an August 20 wedding. Any ideas on what we’re doing wrong?  My niece has been doing these projects for more than 3 years.  She has engraved Yeti mugs and wood. But she only recently bought this particular device so she’s coming up a bit of a learning curve.  TIA.",
    "author_name": "@mmb4427",
    "published_at": "2022-08-08T00:33:34",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzTuM5u4cXZfEXw3154AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Can you engrave a wooden dish plate. I'm a wood turner, and I wanna add something to my projects. But since my plate is not flat I want to engrave from a distance above it like say 2-3 inches or maybe higher! Is that possible?",
    "author_name": "@Thekokomoslim",
    "published_at": "2022-08-07T09:09:29",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugy6DcGzYDEC4j-xrRx4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "YOU ARE KIDDING GLOWFORGE is a rip off paying 50 dollars a month for a machine that cost way to much the G shits all over it",
    "author_name": "@RB-yq7qv",
    "published_at": "2022-08-07T07:39:31",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxtBaKY33c9GvlIPbp4AaABAg",
    "video_id": "XPweRTljgG4",
    "video_title": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "comment_text": "if you notice that the other half of the container is edited, on the lower part of the container. notice the other end of the cable it was erased!!!!///",
    "author_name": "@britneygale1570",
    "published_at": "2022-08-07T03:05:01",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxXMHudeY464xkMdNB4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "I have atomstack a5 pro 40w. The product description said that the laser lens is 0.08x0.08 square. but the lens is not square. cuts vertically. but it doesn't cut horizontally. Liars. This is why I hate this brand.",
    "author_name": "@sercankaya6730",
    "published_at": "2022-08-06T23:20:39",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzwud1JtLcdy84C22l4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "The price comparison is an even bigger win for Gweike since one has to continuously pay to access the premium features with glowforge. A practice we users should avoid because it disadvantages us",
    "author_name": "@ltlbuddha",
    "published_at": "2022-08-06T21:42:37",
    "like_count": 6,
    "reply_count": 1
  },
  {
    "comment_id": "UgxZ3SIv11b1RBk1Gwp4AaABAg",
    "video_id": "d8NuMq7nH7s",
    "video_title": "The Best Laser Cutter for any Budget?",
    "comment_text": "Thank you for all of the great information! This video helped me out quite a bit. Please review the Ortur 3! I’m not purchasing it until you review it…just kidding, but it sure would be nice to get your opinion. Thanks again for making these videos!",
    "author_name": "@angwest248",
    "published_at": "2022-08-06T20:14:39",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzu-RrMqfSf-me061V4AaABAg",
    "video_id": "JD_AlmF1YUg",
    "video_title": "Building a Modular Paint Organization System",
    "comment_text": "I don't know if you are still monitoring this video. But I have recently got a laser cutter and bought the plans for this organizer. I have most of  it cut but I was wondering if you have plans for the 3 drawer pictures with the organizer to go with the 2 drawer one?",
    "author_name": "@Damigged",
    "published_at": "2022-08-06T17:21:33",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyX1P3ZLOW4966Ud0h4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "I’m stuck deciding between the omteck k40 for $430 and the Ortur Laser Master 3 for $750? I want to make basic signs, no business. I want to make sure I get something that will cut out large lettering. Am I completely on the wrong track?",
    "author_name": "@angwest248",
    "published_at": "2022-08-06T02:30:39",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz_INy4eBfpu4_nivV4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "The glowforge does not have an \"Air Compressor\". It has an air assist fan.  Big difference. And that are assist fan does not add to the size of the machine.",
    "author_name": "@LithosAndLasers",
    "published_at": "2022-08-05T23:20:27",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgylM48ILIzyOiwbvMN4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I actually purchased the G machine today.  Features and price were hard to beat and the fact that it uses Lightburn makes it a no-brainer.  Thank you for your reviews, which really help me make an educated decision!",
    "author_name": "@alg4633",
    "published_at": "2022-08-05T21:40:20",
    "like_count": 7,
    "reply_count": 4
  },
  {
    "comment_id": "Ugw3E1a8AJYjAs7cLjx4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Can you do a comparison video with Xtool 20W up against the Atomstack 20W? I haven’t been able to find anything comparing the two. Thanks.",
    "author_name": "@threecubedpodcast",
    "published_at": "2022-08-05T15:45:23",
    "like_count": 22,
    "reply_count": 1
  },
  {
    "comment_id": "Ugyg9VY9rEXJm7y8JOZ4AaABAg",
    "video_id": "NQoeYksA_ao",
    "video_title": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "comment_text": "Why are you recommending this when you can get the Omtech Laser for a cheaper price and a more powerful laser????\n\n I don’t quite see what logic you are using?",
    "author_name": "@thepkeezy",
    "published_at": "2022-08-05T12:56:12",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxfPSQH0I6VqCdgPwl4AaABAg",
    "video_id": "HUnskFyscNs",
    "video_title": "Should you upgrade a budget laser cutter?",
    "comment_text": "My first laser was a K40, and it did well.  I upgraded to a XM-1060 100 watt Reci tube laser ONLY because of the bed size, and more power to cut in one pass .. I use LightBurn on the Xm-1060.   I make artistic wood boxes, so this worked well for that.   K40 did etch glass, stone, cut leather and wood, and engraved fairly decently...  The only upgrades I did was a better exhaust, diamond grill bed and a new Lens ..  My son owns a Glowforge.  He doesn't use it 3% of what I use my Xm-1060 or even the K40!  I think the K40 with the dsp, exhaust, mirror, lense and new controller ( with Lightburn ) is all you need for more than casual use of the K40.",
    "author_name": "@paulszudzik9588",
    "published_at": "2022-08-05T00:11:45",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxnAICFgMfv07kQjmR4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "Do you think it's possible to get one of these then add an air assist to help the flame issue?",
    "author_name": "@MattSimmonsSysAdmin",
    "published_at": "2022-08-04T14:43:15",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwKJUulX8SpGMGY_dN4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "Atomstack 20W or Xtool 20W!? Can’t decide which one to invest in 🥴",
    "author_name": "@vcmel4028",
    "published_at": "2022-08-04T12:25:49",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzxbtvrcFXfzPnw6mF4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "Simply the total mess of a birds-nest of a wiring \"loom\" would make me reject the whole lot instantly.",
    "author_name": "@MichaelKingsfordGray",
    "published_at": "2022-08-04T09:20:38",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugx3ve79LfJl7h-9jG94AaABAg",
    "video_id": "TAE1QBmVYSI",
    "video_title": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "comment_text": "Hi I have a Longer LK5 Pro I cannot do the set up as there is no movement on the Y axis . Have you any thoughts to help me .",
    "author_name": "@anthonyharris1939",
    "published_at": "2022-08-04T07:44:08",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyR_3jITsq_QJrr_zh4AaABAg",
    "video_id": "9sBdrrkRMHc",
    "video_title": "Is this feature worth $2400?  The Snapmaker 2.0 Rotary",
    "comment_text": "Zeroing for a finish pass on the rotary module is such a hassle. Between that, trying to work around software bugs, and having linear modules fail within the first few months... I wish I hadn't bought it at all.",
    "author_name": "@MrAlanGrey",
    "published_at": "2022-08-03T19:54:59",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgyCobrRBc4v6f2-61d4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Will SCULPFUN's S10 be updated? I want to buy it but don't know if it's worth to buy. Heard they're coming out with a 20w machine, maybe I'll consider buying a new model?",
    "author_name": "@diymaker7047",
    "published_at": "2022-08-03T09:47:15",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy3cWpFZY3PR2paw-l4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "my 4ft by 8ft 300w did not cost that much inc delivery",
    "author_name": "@cornishman1954",
    "published_at": "2022-08-02T18:05:18",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyNYvoVSwEdjtczrzx4AaABAg",
    "video_id": "3ceo1sNpDgs",
    "video_title": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "comment_text": "Afaik Most Windows computers have the ability to \"print to pdf\" baked into the OS.  At least in the newer versions. \nI've always seen it anyway.",
    "author_name": "@Epiphalactic",
    "published_at": "2022-08-02T13:35:29",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy1pSVs7BFR1vLOuW94AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I also what to know, does it matter about the ambient temperature in the room? Glowforge can't be above 75°. That's rather limiting to some folks.",
    "author_name": "@wileycovington4497",
    "published_at": "2022-08-02T11:26:03",
    "like_count": 0,
    "reply_count": 6
  },
  {
    "comment_id": "Ugwoj4hAye7D07bqs_54AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I live in a rural area, that being said, I need to be able to use the machine without internet. Then there's the price...\n\nOne question. I'm confused about the Glowforge air filter box, does it still need to be vented outside?",
    "author_name": "@wileycovington4497",
    "published_at": "2022-08-02T11:08:37",
    "like_count": 0,
    "reply_count": 5
  },
  {
    "comment_id": "UgxPjhLJsc3MlvBubxt4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I'd take the Gweike. Half the price a lot less locked down.",
    "author_name": "@StevenDavisPhoto",
    "published_at": "2022-08-02T06:58:14",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugyt6L5d9zIHUEE9KMh4AaABAg",
    "video_id": "F_33OeMTf1s",
    "video_title": "3 HUGE Upgrades in the xTool D1 Pro!",
    "comment_text": "Brandon- can this cut 1/8th mdf? Or does it only cut the basswood",
    "author_name": "@stacynalder9065",
    "published_at": "2022-08-02T02:49:13",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgxiG751JRAFG4yvx7R4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "So excited, then China.  I'll spend the extra money.",
    "author_name": "@nuchbutter",
    "published_at": "2022-08-02T01:57:15",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwUxBpxK9mH3QHRxtV4AaABAg",
    "video_id": "paDgKFKD6yE",
    "video_title": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "comment_text": "Can you do a video with using the rotary axis for this machine?",
    "author_name": "@garyvolence4504",
    "published_at": "2022-08-01T16:11:23",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy9XNtNGsMleUUfoKp4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I like that exit line, \"go make or break something!\"  that is too true!!  hahaha",
    "author_name": "@copperdolphin5291",
    "published_at": "2022-08-01T15:15:23",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgzL9MYGT7wHT8pUthl4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "Do the same for aluminium, and your results will be better, and some cooling with 50% water and 50% white spirit will increase your results 2.",
    "author_name": "@dirkroggeveen5764",
    "published_at": "2022-08-01T14:23:31",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw7Omrt9qR3bPfimlB4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "You made circular pockets (10:13), the cutter is turning clockwise then you have to cut clockwise not counterclockwise,  you will see your edges are getting smoother.  Compare it with a chisel, you move it forward, not backward. Cheers!",
    "author_name": "@dirkroggeveen5764",
    "published_at": "2022-08-01T14:17:39",
    "like_count": 11,
    "reply_count": 2
  },
  {
    "comment_id": "Ugyd9Kku7NSQxeOmcs94AaABAg",
    "video_id": "dpw4Qrq8Uo0",
    "video_title": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "comment_text": "Given the added power, have you tried cutting some white polystyrene?",
    "author_name": "@lvignals",
    "published_at": "2022-08-01T04:16:09",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzyrwmuMICVwbGd69B4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Light burn compatible, half the price, more powerful, replace your own tube without having to ship the machine to glow forge? The clear winner is the G machine. Glowforge is dead to me & G machine is what I am getting.",
    "author_name": "@bestyoutubernonegraternumber1",
    "published_at": "2022-08-01T02:38:22",
    "like_count": 3,
    "reply_count": 0
  },
  {
    "comment_id": "UgyjBL7pNTwi-tM7gwF4AaABAg",
    "video_id": "xhqKwrSTc_Q",
    "video_title": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "comment_text": "How did you get all 3 heads in a box? mine only came with 1.",
    "author_name": "@mrsdizi1234",
    "published_at": "2022-07-31T23:47:04",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwvz3vtVILFZn6qQcN4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Forget all the laser nonsense. The real question is did you hand mask yourself out to float the text behind, or is there now some fast AI trick in Premiere or After Effects (like Photoshop now has).\n\nLooks 1-800-SUPERPRO",
    "author_name": "@wittworks",
    "published_at": "2022-07-31T21:59:53",
    "like_count": 0,
    "reply_count": 2
  },
  {
    "comment_id": "UgzD03NoFPelRH1KkMF4AaABAg",
    "video_id": "zYN0vb97caE",
    "video_title": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Smart 20W MOPA Laser Review",
    "comment_text": "What about bricks or concrete blocks?  Could it do that?",
    "author_name": "@eliasgalvan6472",
    "published_at": "2022-07-31T19:25:17",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwoC-wFbje8gSsUGYh4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Glowforge was my introduction into the laser world (purchased through their original Kickstarter campaign in 2016), and 7 laser purchases later, I still use three Glowforge's daily.  Luckily 90% of our products are flat acrylic, smaller pieces that the Glowforge can handle easily so as far as ease of use goes, we just keep at least two of them cranking out products daily.  We do love Lightburn when it comes to the larger 150W CO2 we use for our big stuff, rotary, etc. as well as our new Fiber laser (thank god for Lightburn Galvo) so we can see how both situations bring value to your business.  Being an early Glowforge adopter, we paid half the price for both of our Basics and our Pro, so I'm not sure if I would choose Glowforge now at their current price point, but I really do love the cameras, auto-focus, and small footprint.  And their customer service has been other-worldly as well (several replacements (not necessarily their fault), overnight parts delivery, you name it).",
    "author_name": "@ThatLEDGuy",
    "published_at": "2022-07-31T16:06:58",
    "like_count": 5,
    "reply_count": 2
  },
  {
    "comment_id": "Ugwu_ffwpCon4guoAXF4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "It works very well but. I get a problem whits tbe software. I most looking what happend. He will on x axis one way and go to far to his limets. I have do ik again on a other pc en it works better only whits this setting is the speed not good. In the begining it works very well and the results beter than on a co2 cutter.",
    "author_name": "@ericson701",
    "published_at": "2022-07-31T11:01:17",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyakdGWUve_H6FBcx94AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Wow, you missed what is for me and many others the number one consideration: support. How easy is it to get a machine repaired or fixed or even how easy is it to contact someone at the company? Unfortunately, glowforge has a pretty crappy support history. Do you have any information how easy it is to contact someone at gmachine and get parts for support for it?",
    "author_name": "@ChippWalters",
    "published_at": "2022-07-31T04:54:55",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugx6DzUzyjs0Ra1_KZx4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "By not including much about the pass through you are missing most of what makes the Glowforge pro better. Otherwise your G-machine is far more comparable to the Glowforge machines in the same price bracket. Instead of he 14 inch height of the G-machine the Pro can use material as big as you can fit in the house, not only for large projects but I buy my material 48\" long and use as much as I need  Yes the 40 watt machines are rated at less power, but Glowforge does not \"overclock\"their machines so they last longer than if they run at max power. As for premium, if someone is trying to make money right away premium  opens up thousands of free designs that they can legally sell right away so if you have a market. If you want to design in Inkscape you have less of an incentive, but I still find many conveniences that I  use instead of going back to Inkscape or Gimp and reloading. With the many free designs ( full disclosure a few of mine as well) there is also access to the entire Noun Project that does not allow commercial use of their designs, but Glowforge worked out a deal and they get some of that premium fee also. So if you do not want to learn Inkscape, Gimp or many of the more pricey options. The Glowforge app is av pretty good design tool that you can even use on your tablet or phone. \n\nOn another point, once the cur is loaded on to the machine there is no internet needed, so if the internet goes out while it is cutting it will not affect the machine. Unfortunately you cannot keep running that file again, though many have suggested it. Which brings up another point. There is a great deal of hands on connection that takes place over time. There are many complaints that connecting to support is more time consuming  than they like, but the volume is huge and it may take a bit, but the final result is far better than my abilities to interact with any other company.",
    "author_name": "@freedem41",
    "published_at": "2022-07-31T03:31:03",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgzIInjz4-InS10Qsf54AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Why would anyone want to spend almost 7k on a glow forge when they could get an 80+watt for way less ?",
    "author_name": "@MSRWorkshop",
    "published_at": "2022-07-31T02:15:02",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzkq55DD_zszdKr4EF4AaABAg",
    "video_id": "paDgKFKD6yE",
    "video_title": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "comment_text": "Every thing i engrave leaves darker marks on metal cards any advise on what am doing wrong",
    "author_name": "@chapysocialcard",
    "published_at": "2022-07-30T23:01:19",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugyep2mtcD5blrmWCaZ4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I intended to buy a GlowForge Pro when I started looking for a laser. With the exhaust fan, tax and shipping the GlowForge Pro was $9,500. I did a ton of research and ended up buying a Thunder Laser USA.... Nova 35-100watt. It came in at almost the same price and the difference in these two machines are immeasurable. The Thunder Laser came with over double the power. The ability to cut/engrave 24\"x36\" and had pass through. Not to mention it has over 7\" of z height with the ability to use a rotary. I honestly can't believe people pay so much for a GlowForge. Do your research and you can either save a lot of money or get a industrial quality laser for the same price. \nhttps://youtu.be/bqObk0NKbTc",
    "author_name": "@ClintonCaraway-CNC",
    "published_at": "2022-07-30T17:41:06",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw_0UAXLdlZDdCUwWN4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I'll neve buy a glow forge because of the \"net\" only usage and subscription service for importing.",
    "author_name": "@frijoli9579",
    "published_at": "2022-07-30T15:01:57",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzi6ZUyRrYO_pUJxvt4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Thanks for Brandon's sharing 😊😊😊I like this nickname \"g machine \" . We will continue to insist on good products for everyone!  You can also join our group to interact with our members and keep abreast of the latest news. We will also share free drawings from time to time, arrange engineers to solve problems in the group, and hold some small lucky draws!HERE https://www.facebook.com/groups/desktop3dlasercutter",
    "author_name": "@gweikecloud",
    "published_at": "2022-07-30T09:04:13",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw5V95pIrUtgUX4-zF4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Enjoyed the video, and seriously considering this machine. However, looking for reviews online seems to be turning up a lot of people having ordered machines that haven't shown up yet, and things like passthrough being pictured on the website, but isn't actually a feature on the machine. (This was a little while ago, so perhaps this situation has changed now?) Any thoughts?",
    "author_name": "@hamiltonpianos",
    "published_at": "2022-07-30T08:12:47",
    "like_count": 0,
    "reply_count": 2
  },
  {
    "comment_id": "UgzPjZVFObyr38fusPZ4AaABAg",
    "video_id": "3ceo1sNpDgs",
    "video_title": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "comment_text": "I am just getting into this kind of stuff. While this program seems nice the price for the regular and the limits for the free one seem like I shouldn't use it. It just seems like just a way to milk us even more. I have enough bills and I am not making money with this yet but limiting us to 10 things in a cad program where I may have hundreds of objects sounds terrible. $500 a year also seems bad as they will probably raise it every so often and you will never own it.",
    "author_name": "@stfutruck68",
    "published_at": "2022-07-30T05:45:39",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugxt13a5ZRtb8NwdjVd4AaABAg",
    "video_id": "NQoeYksA_ao",
    "video_title": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "comment_text": "Love ALL you videos , where would recommendgetting glasses for these lasers, thanks again",
    "author_name": "@orencioperez9120",
    "published_at": "2022-07-30T01:23:30",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyY2DWgVs6NY5rYsld4AaABAg",
    "video_id": "paDgKFKD6yE",
    "video_title": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "comment_text": "Whoever put on those labels under the green buttons needs to be fired!",
    "author_name": "@fredriklindgren4126",
    "published_at": "2022-07-29T21:11:47",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzf_rofNmd9ifDi_Mh4AaABAg",
    "video_id": "bCUsQjJNG-4",
    "video_title": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "comment_text": "Good afternoon. Could you do a review on the Spider M-1 Laser engraver? I found it only yesterday . Thank you",
    "author_name": "@HONEYBADGER210",
    "published_at": "2022-07-29T18:51:33",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzB-yFu8vSd26IpDrp4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Have a gweikecloud myself and love it. Did a few basic vids on my channel. I rep the GC hard whenever someone wants a desktop class laser. \n\nDumped my prior Atomstack X7. Did not get the GF due to 1. closed system in both software and hardware and 2. price. If anyone is looking for other users of the GC, their facebook group(s) is your best place. They have like 3 facebook groups and it is confusing but join them all. You will find me and many others on there who love the GC.\n\ncomments to the video:\n-gweikeclouds hinges are horrible unless you open it all the way (not sure how the GF is). better if the hinges hold at any angle. \n-passthrough is easy. just stick a magnet or something metal where the sensor is. but unfortunately fumes will escape.\n-air compressor indeed is external on the GC but that means you can swap it to whatever you want. on GF its not upgradeable.\n\nAnd yes, a big con is gweikes marketing. case and point you mention \"autofocus.\" something is lost in translation there. They also make this mistake marketing the air assist. Heck a big con is indeed this overseas translation thing. While tech support is VERY responsive (you get assigned to like 7 tech people through an app after the purchase of the machine) sometimes small details can be lost in translation. Is that worth paying the thousands for a GF over the GC? nah. its not THAT bad but just a heads up from me to whoever looking to buy a GC.\n\nAlso i should mention for cost of the GC, it CAN get even cheaper as Gweike runs events here and there where you can get cash that brings down your initial purchase cost.",
    "author_name": "@GuyWithAGweikeCloud",
    "published_at": "2022-07-29T18:04:37",
    "like_count": 3,
    "reply_count": 4
  },
  {
    "comment_id": "UgwSTDyNjZ24HiLkZ5d4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I just want a decent laser,  easy to use that can cut clear acrylic, at a good price. Haha not hard at all lol",
    "author_name": "@melindagibson8606",
    "published_at": "2022-07-29T04:46:34",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugx-GinSiCt_q9I36VJ4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "A huge negative of the GlowForge is it becomes an expensive brick when the company fails or decides to stop supporting their cloud services (which has happened with others). That model really only makes sense if you're leasing the hardware for low cost. Being able to use third-party software is a huge plus for the Gweike. Given their product logo, I thought they were going to be another cloud-tethered engraver.\n\nThanks for the comparison!",
    "author_name": "@Psychlist1972",
    "published_at": "2022-07-29T04:14:40",
    "like_count": 35,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz1xWVtbBPQheG5gop4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "Let's say I wanted to burn something on a round object like a dowel. Can I program that circumference into the laser for an even burn?",
    "author_name": "@cokemillion",
    "published_at": "2022-07-29T04:12:40",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxsiA0yRVlnNv84XNp4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "At around 8:12 I think you mean mm/min rather than mm/s.",
    "author_name": "@BeardedBuildsCo",
    "published_at": "2022-07-29T03:47:25",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgyQOY-fMuO8gY2AdIl4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "This is obviously a HUGE improvement over the 3018, but still with a couple of weak spots; staying within a target price point always results in compromise.\n** The linear rails on the X-axis are great, so... why not the Y-axis? (Yeah, I know, PRICE!).\n** The spindle is still not good enough.  It is still just a cheap motor with the collet assembly held on with a grub-screw (or 2?).  This is a guaranteed source of chatter.\n** The gantry does not move, so extra mass and strength is good here. (Apart from freight costs.)  Owners should add horizontal stiffening across the back, which would help in your \"Pull on the toolbit\" test.\n** The cable-management is disgusting!... I am polite enough to assume this is not because you took shortcuts in the assembly!   :o)\nThis is a really useful video, thanks.   Liked & Subscribed.",
    "author_name": "@PiefacePete46",
    "published_at": "2022-07-29T03:18:06",
    "like_count": 13,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxqd4ZqCJ1WJorhNs94AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I've had it for a week....except for one of the lights not functioning...it's pretty darn good.I paired it with a fluxbox because the fumes are not acceptable going the first filter.",
    "author_name": "@gyasis",
    "published_at": "2022-07-28T18:38:30",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugym71qi91BA2MWrwQV4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "This was a very helpful video!  I would love to ask you what is the machine that you would get, similar travels on the axes with more on the z if possible, that can mill aluminum without serious compromise.  \n\nSince aluminum likes to mess with us with it being gummy let's machine the gummiest aluminum - is that 6061 - if not please just specify and let's make say a motor mount plate.  So a square shape, say 3\"x3\" by 3/8 or 1/2\" when finished with a bunch of holes punched through for through bolts, some holes to be tapped, \n\nLets also mill a pattern into the face of this square of aluminum that is say a 2\" square shape that is 1/4\" wide square track that we are ending with. The feature is also a finished depth of 1/4\".  \n\nSo if we are using proper feeds and speeds from the machinists handbook or other proper sources what is the most depth we can take on each pass say even on your typical industrial heavy duty vertical milling machine.  That sets our target or best possible case, then can you answer in your opinion which brand machine in these low dollar tiers do you think can actually come close to this level of performance.\n\nLast but not least this machine needs to be capable of true 3d milling into aluminum. Lets say we are going to mill a ball shape where we have a semi-circle full round shape the diameter of the circle is 3\" and the height at the center of the shape is also 3\" - so we are getting what would look like a bandsaw slice through part of a pool ball cut in half,   Which machine can get great surface finishes and also do the work in a reasonable amount of time.  I am assuming that if a machine could make this 3d feature then it could likely make most features that i would ever need it to.  Please let me know if this is a poor assumption.\n\n\nThis whole CNC market has so many machines that could never hope to do this work which is fairly basic work for sure.  And I know that this was a little bit to read but I am hoping those of you with knowledge and experience will simply be able to just snap your fingers and say - yea, get a \"THIS BRAND\" and get \"MODEL ABC123\", they are great!  \n\nOh damn, we can't forget about cost, I would ask 2 things for cost.  1 - can you do this for under $1000?  How about for under $800 and wow if we can you can do this for $500.  \n\nI have no idea what to expect so I hope that there is some feedback and all of it is going to be greatly appreciated.  Cheers!",
    "author_name": "@GMx_1",
    "published_at": "2022-07-28T17:18:23",
    "like_count": 0,
    "reply_count": 2
  },
  {
    "comment_id": "Ugw6EW9RuNPgZLyt-tJ4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I have the glowforge plus that I bought the day before the price increase. I almost bought the gweike cloud as i was approached about buying and possibly being a resaler. As a business owner i am happy with my glowforge but if i where to buy another i would probably go with the gweike cloud because of the price. Right now i use my glowforge and my xtool D1 and recently added the xtool M1 which will be better once i get the air assist and they get the software bugs fixed. I have the M1 in my store to do laser engraving if i need it done on sight but mostly do stuff at home with my glowforge or D1.",
    "author_name": "@joepadilla1924",
    "published_at": "2022-07-28T12:22:30",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "UgxlFJ6yF_9-cjz4o-h4AaABAg",
    "video_id": "paDgKFKD6yE",
    "video_title": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "comment_text": "Can you lay out multiple items and engrave them back to back or do you have go one by one?",
    "author_name": "@ASoulsTruthOfficial74",
    "published_at": "2022-07-28T07:50:06",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxj8-aKhNz5udtPyVN4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Is it me or the gweik has more scorching? If you have to spend more time on post-processing, that might be also a (big) pro/con?",
    "author_name": "@j4nch",
    "published_at": "2022-07-28T07:29:40",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgwQnkjcjnbtTrhpMbt4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "You forgot to mention that the G machine has a Rotary attachment while the glowforge does not. That is a deal breaker for a lot of people",
    "author_name": "@silentscope87",
    "published_at": "2022-07-28T04:12:10",
    "like_count": 31,
    "reply_count": 3
  },
  {
    "comment_id": "UgzMRlwnX56E133SQhh4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "What about there top version with High precision RF 30W, What is a RF 30W? Is it more powerful than the co2?",
    "author_name": "@fisheye3d1727",
    "published_at": "2022-07-28T01:09:51",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwPV4VMKqe9u_zoxQB4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Around 9 minutes in the video you talk about speed of the machines and kept say 12,500 (or whatever) mm per SECOND.  You meant to say mm per MINUTE, correct?",
    "author_name": "@Andy.H.H.",
    "published_at": "2022-07-28T00:56:56",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxVuMU-A0shKLjuC6F4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Still waiting for Atomstack 20w vs xTool 20w 😁 Hopefully both with air assist, extended rails and with a honeycomb bed.",
    "author_name": "@TylerAvakian",
    "published_at": "2022-07-27T23:12:04",
    "like_count": 7,
    "reply_count": 1
  },
  {
    "comment_id": "UgzEmxk2-x-h6x7G55R4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "I've had constant issues with overheating and cutting all the way through material with the Glowforge. Have you had similar experiences? I'm hoping I can review the Gweike soon as well.",
    "author_name": "@GeekBuildersNet",
    "published_at": "2022-07-27T21:13:39",
    "like_count": 4,
    "reply_count": 1
  },
  {
    "comment_id": "UgxglARc9n42fkhRjYF4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Glowforge might be the winner for ease of use. But as soon as your Cloud-Connection is gone for whatever reason, your business is basically screwed for that time. As much as i'm into the build quality and design of Glowforge machines, this web-only approach just won't be happening for me. Especially on a 5000+$ machine. \nAnd to be fair, once you get into Lightburn (which i'd say takes less than a week), it is just SO powerful! I would have never expected this amount of useful stuff, hidden behind that kinda 90s looking UI! <3",
    "author_name": "@letoxique",
    "published_at": "2022-07-27T20:46:48",
    "like_count": 11,
    "reply_count": 5
  },
  {
    "comment_id": "Ugzoy-VjB5z8OMKPx7l4AaABAg",
    "video_id": "ZeajuzAjL9M",
    "video_title": "My Favorite Laser Just Got Better! - xTool D1 Upgrades",
    "comment_text": "Update your description. Link for test file is no longer available.",
    "author_name": "@Sambo726",
    "published_at": "2022-07-27T19:34:19",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy56R8wfTyLuAoowi94AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Even at the cheaper price for the Gweike you're not too far away from what it would cost for one of their bigger models. If I had the room I would save a little more and grab a 80-100w with a bigger bed",
    "author_name": "@e.gauthier",
    "published_at": "2022-07-27T19:31:14",
    "like_count": 9,
    "reply_count": 5
  },
  {
    "comment_id": "UgxiL2VrlqbWZ51KSUh4AaABAg",
    "video_id": "jRKfJd3K7Gg",
    "video_title": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "comment_text": "Love the video. Comparison is great. Based on your video I would buy the gmachine as I have a diode laser and love lightburn. Thanks",
    "author_name": "@IIIofV",
    "published_at": "2022-07-27T19:25:37",
    "like_count": 5,
    "reply_count": 1
  },
  {
    "comment_id": "Ugy2dodHa4Sl1zjPH7l4AaABAg",
    "video_id": "JD_AlmF1YUg",
    "video_title": "Building a Modular Paint Organization System",
    "comment_text": "hy Brandon, i bought your plan but there's only a pdf file and it wont be imported in lightburn. could plese answer to my message an thell me if or how the pdf must be used?",
    "author_name": "@Bearded_hypster_modeler",
    "published_at": "2022-07-27T18:41:19",
    "like_count": 1,
    "reply_count": 0
  }
]