[
  {
    "text": "Thanks for the review, very helpful. I was looking into these just to maybe engrave an image into wood, not needing to do any cutting. Would you say the \"15W\" version is good? Because it jumps in price by like $70 from the 15W to the 20W...",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-11-16T13:57:36"
  },
  {
    "text": "Do you become instantanly blind without the glasses?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-11-16T06:43:14"
  },
  {
    "text": "🔥🔥🔥Great news,  \r\nOrtur Flash deal and Discount promotion will start on Nov. 25. !!! \r\n#blackfriday2021 #ortur #flashsale #orturlasermaster2pro #laserengraving #Orturlaser #promotion #CyberMonday",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-11-16T02:34:11"
  },
  {
    "text": "🔥🔥🔥Great news,  \r\nOrtur Flash deal and Discount promotion will start on Nov. 25. !!! \r\n#blackfriday2021 #ortur #flashsale #orturlasermaster2pro #laserengraving #Orturlaser #promotion #CyberMonday",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-16T02:20:39"
  },
  {
    "text": "where did the random cap screw come from that appears around 9:19 ?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-16T00:03:06"
  },
  {
    "text": "This is great. Now I can make some hardwood shims rather than use those soft ones from the store! Definitely going to try the table saw jig.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y",
    "date": "2021-11-15T17:40:19"
  },
  {
    "text": "Looking to engrave my Custom design(s) at a minimum depth of .50mm onto a 16 gauge alum sheet, which will be exposed into a outdoor environment. After engraving, I want to polish the whole aluminum body to a high reflective sheen. What do you recommend?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-15T14:39:38"
  },
  {
    "text": "I’m looking for a laser machine that can ingrave and cut any suggestions laser community?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-14T19:48:28"
  },
  {
    "text": "I can't get to your webpage shop for the review list",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-14T16:55:21"
  },
  {
    "text": "Thank you for your concise and to the point practical presentations which are so valuable in choosing a “no unpleasant surprises” laser cutter/engraver. \nGetting a well informed cost - benefit trade off perspective is so useful 👍🏻😁",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-11-14T13:05:32"
  },
  {
    "text": "Did you ever get the frosted look you was after mate?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-14T08:43:25"
  },
  {
    "text": "I like your videos! I just ordered the new 40w dual laser 460*810mm unit. I read a comment saying that it's technically an 80w with each a laser being 40wX2=80w... I was thinking it's more along the line of two 20w lasers equaling 40w... What do you think?\n\nOne another note I saw the video of the big machine you bought from China and my wife and I agree it's a good option. We were just curious how much was your shipping and freight once it got to a US port?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-11-13T20:55:08"
  },
  {
    "text": "So I’ve read a ton of negative reviews on full spectrum laser. Anyone have an opinion on this brand?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-13T19:10:15"
  },
  {
    "text": "When you have a larger object is it best to etch with a mill or is there a way to increase the work area with these devices?",
    "likes": 4,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-11-13T15:31:51"
  },
  {
    "text": "What do you think about the m1 coming out on kickstarter?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-11-13T14:46:41"
  },
  {
    "text": "What GPH would you recommend for the Air Pump?\nYour link leads to one that ranges from 600GPH to 1750GPH.\nI went ahead and purchased this Laser with the LU2-2 7W and the LU2-4 LF and am just trying to figure out which pump you link to would be more appropriate for the Long Focus Laser.\nThe Ortur Site just says a flow rate of >40ml/min which converts to 0.6 gal/hour. If what Ortur listed is correct, would that mean any pump would work and be overkill?",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-13T13:43:38"
  },
  {
    "text": "Can I import illustrator files into this software? So do all the editing in illustrator, import, then print as is?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-12T23:28:43"
  },
  {
    "text": "Just curious, for non-US customer( with 230AC) where would you buy a K40-like?",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-11-12T10:16:39"
  },
  {
    "text": "Cool Laser. I just built a Diode laser and am enjoying learning it. This one will be the next laser for other things. I like the speed.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-11-12T05:10:24"
  },
  {
    "text": "Full Spectrum has horrible support. I ordered a new tube and it had a bad seal and filled with coolant, which shorted out my power supply. Took almost a year to get it up and running again (Mailing parts to them and using Google Wallet to pay really) and then it died again. I gave up and went with Rabbit on my second laser and am extremely happy. When I had a problem I was able to get a replacement part in a week. (Not 3 months) We now have 7 Rabbit laser and they all work well. You can have Rabbit come and set up the laser and make sure it work too.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-12T02:15:01"
  },
  {
    "text": "I just noticed that on the Ortur site they do not sell the LU2-2 or the LU2-4 SF module by themself.\nThey have a regular LU2-4 but it does not say SF. They also have a LU2-4 for the Master 2 but it is 12v and does not support the Master 2 Pro or the Aufero Laser 1 and it is sold out anyways. They only sell the LU2-4 LF by itself.\n\nIt would be nice if they sold the machine with the option to get all three modules with it, which is what I want. As of now I would have to choose between LU2-2 or LU2-2 SF and then buy the LU2-4 LF by itself. I would basically be missing out on one of the other modules which sort of sucks if you want all three.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-11T21:49:33"
  },
  {
    "text": "So for a budget laser  that can do everything including metal , what do you recommend?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-11T20:09:41"
  },
  {
    "text": "What is your view on the xTool M1 Laser & Blade Cutter currently being crowdfunded on Kickstarter? Thank you.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-11T18:58:49"
  },
  {
    "text": "what is the cheapest laser for engraving names on small signs",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-11-11T17:32:26"
  },
  {
    "text": "I'm curious to know if I'm using this 2-3 hours a day, how much will my electric bill go up? Also, can you engrave and cut in the same pass, or do you have to set it to engrave and then reset it to cut in a separate pass?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-11-11T12:12:57"
  },
  {
    "text": "Hi there...GR8 videos 👍 If U could only buy 1, would U buy this or the Ortur LM2 Pro? Where did U hear about Ortur bringin out a 10w laser please?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-10T21:27:44"
  },
  {
    "text": "Such a great presentation from a great presenter: Comprehensive yet concise overviews, specs and comparisons with clear, easily accessible language and delivery.",
    "likes": 14,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-10T18:58:35"
  },
  {
    "text": "thanks for the great video! would laser engraving on stainless steel cause rusting later on? trying to find a way to engrave stainless steel that doesn't lead to rusting.",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-11-10T18:55:38"
  },
  {
    "text": "looking at xtool and muse, would you recommend 1 over the other?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-10T16:50:52"
  },
  {
    "text": "Very interesting info. Been in the market for a diode laser and may have to go back & look into this one again.\nI hope you get a chance to talk about the Sculpfun S9 that is being released soon. It looks promising but would love to know if it actually is.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-10T15:21:29"
  },
  {
    "text": "If it was $250 in 2019, and the inflation rate is about 8% since then, the price should be about $270 to keep up with inflation.  However, the price in the link is $353, nearly 30% higher than what is quoted in the video title.  Not sayin' the title is a lie, but that that the current price is a HUGE ripoff. 🤬",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw",
    "date": "2021-11-10T14:56:47"
  },
  {
    "text": "Wonder if this works with mirrored metallic gold paint.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-11-10T14:38:18"
  },
  {
    "text": "could you do a review on UV galvo lasers? and also compair the results on wood? is the fiber loosing details and so on.. because its possible to engrave with fiber on wood.. uv would be the best but they are even more expensive.. gantry co2 are much slower it would guess..",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-10T13:39:53"
  },
  {
    "text": "Congratulations on your channel, what you know about  sculfun machines (s9  , s6), do you have any opinion on those.?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-10T12:55:24"
  },
  {
    "text": "I've been fusion for a few months now. One thing I cant figure out is how to model doors and drawers on my projects. Can you help with this?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-11-10T12:46:31"
  },
  {
    "text": "For tiles, dye sublimation is faster, less expensive, and more durable.",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2021-11-10T12:43:17"
  },
  {
    "text": "Can I use it to cut GOLD. I mean I'm going to loose so much of Gold powder while cutting or engraving? How can I check that.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-10T08:35:19"
  },
  {
    "text": "Does anybody know if you can use this laser for adding names and line art to a AR-15 mags? I've used paint and what not doesn't last a long time.",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-10T06:02:40"
  },
  {
    "text": "I've used Epilog and Trotec lasers and prefer the Trotec. They are just more... industrial for a lack of a better word. For my home shop I'm thinking of getting a 100w Omtech. Omtech looks to be a great value.\nI'd really recommend staying away from the devices that lock you into their software; especially if web based (wtf!). Sure they make things easier initially out of the box, but serviceability will be a hassle down the road. Better to tackle that learning curve head on and have more control over your production machines.",
    "likes": 6,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-10T05:51:17"
  },
  {
    "text": "Do the CO2 type use CO2 gas?  If so, what for.  I'm just starting to look into this.  I've got twenty years experience with plasma cutters.  Are there a lot of similarities?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-10T02:57:22"
  },
  {
    "text": "If i want to engrave inside a crystal cube, can i do it with this MUSE machine?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-11-10T02:38:32"
  },
  {
    "text": "Your key light link is brokens btw.. or at least broken for me.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-10T02:03:52"
  },
  {
    "text": "Sketchup had some dimensioning issues, especially when working with very small objects. Fusion isn't perfect, but it's better than sketchup.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-11-10T02:00:51"
  },
  {
    "text": "hello. should I choose this machine or neje 2s max? what do you recommend?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-11-09T17:21:42"
  },
  {
    "text": "I lost my laserpecker charger, do u know where i can buy one or if another charger will work?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-11-09T15:43:33"
  },
  {
    "text": "Is there any way to add air assist to x-tools d110 Watt laser",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-09T14:07:15"
  },
  {
    "text": "hello. I want to order one for myself, I don't know which one to choose ortur 80w or neje 80w? what do you advise ?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-11-09T10:37:35"
  },
  {
    "text": "Great video. First point. Most K40s come with kill switch on the lid now. Second, Meerk4t will allow a lot more flexibility to your laser power, I think it does fast switching rather than varying the power.. It's not in Lightburn territory but it's way better than Whisperer and it's free.\nThird, the fan is upgraded, most now come with a perfectly adequate fan, rather than that dire fan on earlier models. Remove the internal ducting and you have really good extraction.\nThis means that you will only be spending around $100 for air assist and mirrors to get a very workable machine that competes with the Glowforge on most jobs.",
    "likes": 5,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-11-09T10:10:33"
  },
  {
    "text": "Any thoughts about sculpfun?\nSpecially about the S6, S6 pro and S9...",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-09T09:22:41"
  },
  {
    "text": "Does the software allow upload of preexisting files you've made on other software?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-09T07:44:36"
  },
  {
    "text": "Nice review! You may want to look at squaring the acrylic bases if you are getting to much wobble. Best thing to do like you said would be to screw it down though. Good job!",
    "likes": 5,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-09T03:23:05"
  },
  {
    "text": "Alright so I’m brand new to this. Excited and want to get a machine. What would you suggest for a brand new user but can learn quickly. Been looking at the xtool d1 as my first choice but honestly looking for a true professional’s opinion. Looking for engraving and cutting. Hope to do some tumblers, ornaments, signs, etc.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-08T20:59:57"
  },
  {
    "text": "I don't see the link for the compressor in the description. Any chance you can let us know what compressor you used for air assist on this machine?",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-08T20:47:09"
  },
  {
    "text": "Have you already tried if it REALLY cuts the power to the laser beam when you bump into it?\nMine does NOT stop the laser, even if I start shaking the machine.",
    "likes": 2,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-08T18:36:50"
  },
  {
    "text": "Picked up the 10W xTool D1 after another one of your videos. I'm curious if you have any recommendations on protective eye ware for these type of diode machines. While it came with one set, I'd like to have additional sets in the shop. Didn't see any in your affiliate links.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-08T18:17:58"
  },
  {
    "text": "Great review but the proprietary software is absolutely a no go for me. Same reason I didnt go for a Glowforge because none of the software is better than Lightburn!",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-08T16:54:24"
  },
  {
    "text": "I have one of these on order, I have 3D printed the Z height adjuster, I have ordered an air pump for air assist, which nozzle arrangement design do think is best? thank you.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-11-08T16:13:10"
  },
  {
    "text": "the only good point of this engraver is that finally someone starts selling these diode lasers with the predisposition for air assist; for the rest it has a ridiculous working area (18x18) and a certainly not budget price (345 €, for the 20W version of such a machine, are a very high cost.)",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-08T16:12:00"
  },
  {
    "text": "As far as budget lasers go. What are your thoughts on the sainsmart Jinsoku LC-60A? Sainsmart have a good reputation in the budget cnc field for quality and support. Although there are no reviews: For the size, and the included air assist it seems like a great deal at $499 USD. It's hard for me  not to consider it based on the positive reviews of there similar scaled down model LE5040.",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2021-11-08T16:03:47"
  },
  {
    "text": "I have a question - I need to know if this unit would engrave a wooden pen that has multiple coats of C.A. glue finish on it. Thanks!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg",
    "date": "2021-11-08T15:05:51"
  },
  {
    "text": "Glowforge sells people a dangerous lie. Lasers make smoke and people have died not properly venting a laser cutter. All their marketing gives a very false impression of what it’s like to cut.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-08T14:29:09"
  },
  {
    "text": "EXCELENT Video, thanks, that´s the way it should be, perfectly explained every detail, you deserve a lot of likes & your subscription",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw",
    "date": "2021-11-08T13:44:11"
  },
  {
    "text": "I think the title should read \"The Best Laser Cutter*S* for any Budget?\" as it is, is missleading.👎",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-08T13:04:36"
  },
  {
    "text": "Was that two coats of gel stain? I thought it would be much darker.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E",
    "date": "2021-11-08T01:59:01"
  },
  {
    "text": "Great review, thanks so much!  I'm new to this, and just discovered your channel, and plan to be a regular viewer here.  Already ordered a 10 watt D1, and hope it'll be a good unit to learn on.  I was thinking about using this to cut vinyl for decals and stickers, like the vinyl cutters, and hope there's a way to do that with this machine, so I won't have to buy a cutter as well.  Any advice would be appreciated, happy cutting and engraving to everyone!!",
    "likes": 2,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-07T23:50:51"
  },
  {
    "text": "Very informative reviews. One note: You have the endemic YouTuber problem. Not as bad as most but still pretty irritation. You wave and flail things you are holding as if we should look at them, but we can't. Check when you \"show\" the piece of basswood. You would not flip and wave it in the face of a friend would you? Part of this is also the wild arm wavings and gesticulations like you are doing a rap concert. I bet you do not do that in person either, or maybe people just stand well back to avoid injury. This breaks the personal experience of the video and gives some \"This Old House\" vibe (meaning poorly scripted, over acted). Basically you act like you are speaking to an audience, but you are not. On YouTube you are speaking one-on-one. Just my 2 cents. Keep up the good work.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-07T23:17:04"
  },
  {
    "text": "Anyone ever tell you that you spelled Potato wrong! Unless of course your name is Dan Quayle😃",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU",
    "date": "2021-11-07T20:28:44"
  },
  {
    "text": "Is this the one to buy? So many of them. \nwhich would you suggest",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-07T16:05:44"
  },
  {
    "text": "i wanted that for ages i'm gona asc papa to build that",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Play Kitchen // DIY",
    "video_id": "AZ1hdtcwyi4",
    "date": "2021-11-07T14:54:02"
  },
  {
    "text": "a'm gona build that to😍😍😍😍😍💖💖💖💖💖💖😘😘😘😘😍😍😍😍",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Play Kitchen // DIY",
    "video_id": "AZ1hdtcwyi4",
    "date": "2021-11-07T14:51:44"
  },
  {
    "text": "I would like to see if you can engrave key caps for a keyboard with it :)",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-11-07T12:00:30"
  },
  {
    "text": "The only big point against the Glowforge in any configuration is that it is now and always be dependent on the company servers and steady internet access.",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-11-07T07:53:56"
  },
  {
    "text": "Hello, can I use a fiber label to cut through metal to make custom jewelry?!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-07T02:51:31"
  },
  {
    "text": "Thanks for the review.  I am waiting for mine to be delivered and I was a little worried of the quality, so you straightened me out.  I did accidentally buy the 5W version but hopefully it'll do what I need, which is just destroy my enemies through engraving and cutting paper and cardboard.",
    "likes": 5,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-06T23:01:17"
  },
  {
    "text": "\"my shop's a mess right now\" \n If your shop isn't a mess, you're not working enough lol",
    "likes": 1,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 Laser",
    "video_id": "W5LaxGh2l1c",
    "date": "2021-11-06T23:00:59"
  },
  {
    "text": "You might want to test the Sculpfun S9, which is supposed to be equivalent to a 90 watt CO2 laser.",
    "likes": 1,
    "video": "How Dangerous are Laser Cutters and Engravers?",
    "video_id": "DuyzWaYDXPg",
    "date": "2021-11-06T22:34:44"
  },
  {
    "text": "Nice review, but  the current price is 490 USD, not really sub 300 in my eyes.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-11-06T21:21:34"
  },
  {
    "text": "I'm trying to engrave some flask, which machine would you recommend?",
    "likes": 0,
    "video": "Should You Buy a Glowforge?",
    "video_id": "4c4kxlYg-E8",
    "date": "2021-11-06T16:32:19"
  },
  {
    "text": "any european alternatives ? Something made in Germany ?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-11-06T15:13:24"
  },
  {
    "text": "Hello Dear Brandon, and thank for this awesome videos, i want to buy a large chinese  fiber laser machine (3mx1,5m), do you know some good brands to consider ? thanks :)",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-11-06T14:52:19"
  },
  {
    "text": "Which would you pick for making 3D sculptures?  Like using Photo V Carve software to create the sculpture itself from standard photographs or image files.  And for Terminators are there any in the 40 MegaWatt range?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-06T10:30:10"
  },
  {
    "text": "I need to know, can this cut metal? Or mill out a block of aluminum to a lower?",
    "likes": 3,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-11-05T19:20:42"
  },
  {
    "text": "Does this have capabilities of engraving glass/round glass cups?  Does it have an option to attach a rotary piece?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-11-05T12:25:52"
  },
  {
    "text": "So if  you were going to buy a machine next week, would you get this or the ortur LM2 pro. Thanks for all the great videos.",
    "likes": 9,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-05T02:58:49"
  },
  {
    "text": "Ffs dude you take ages to get to the point, stop going around touring other stuff snd go straight to the point mother of god so annoying trying to find where's the actual part of assembly/setting and run Fe machine for almost one houre, between two videos. I quite now.",
    "likes": 3,
    "video": "Testing the OM Tech K40 Laser",
    "video_id": "GjfWcQidYLM",
    "date": "2021-11-04T23:09:51"
  },
  {
    "text": "So is the Ortur Laser Master Engraver 2 Pro still better than the xTool D1 for a beginner in lasers with years of design experience using Corel Draw?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-11-04T21:28:45"
  },
  {
    "text": "What about the tilting of the legs? You didn’t do that, but how would you?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-11-04T18:15:11"
  },
  {
    "text": "I'll bet you are hearing a lot of \"Let's Go Brandon!\" nowadays. :)",
    "likes": 17,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-04T15:52:08"
  },
  {
    "text": "Hey, have you had a chance to evaluate the new Sculpfun S9?  I've heard great things about it.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-04T15:31:29"
  },
  {
    "text": "Love Mancy? 😂  Oh never mind.. that was on the laser engraver ad that come on before this video.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-04T14:50:40"
  },
  {
    "text": "Have you seen the Oku Desk yet? If so any thoughts? It seems a bit too good to be true but I'm  also very new to lasers",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-03T19:12:31"
  },
  {
    "text": "I received my first laser a few days ago, the NEJE Master 2s plus. It seems like a solid machine for the money, but still a steep learning curve. So far I rigged up my own pen engraving jig (video coming soon) and had a few successful burns... and a few more not so successful, what I call lessons. You pack a lot of excellent info here. I'll have to watch a couple more times. :)",
    "likes": 6,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-03T00:32:11"
  },
  {
    "text": "which one has a very high resolution? i want to engrave small text on a the case of a chip. speed is not relevant. cheap would be great.\nthanks for your work!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-02T20:26:45"
  },
  {
    "text": "anyone know if the app is released yet for this machine?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-02T15:53:31"
  },
  {
    "text": "I am looking for a laser first time, I would like to cut a glitter cardstock for a birthday cake topper. I just wonder which one is for me?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-02T10:47:49"
  },
  {
    "text": "This is a very good video. All the machine components are showed detailedly.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-11-02T07:44:50"
  },
  {
    "text": "Hi. Thanks for the superb and very useful video. I'm about to buy a Chinese 50W machine from OM Tech (or at least I currently think I am!). Could someone please advise me on the laser control software? My drawings are being done in Inkscape and that's coming out fine but I'm a bit unsure as to what laser control software I ought to be thinking about. For example, I don't know whether \"K40 Whisperer\" (which seems like it would meet my needs) can be used with these larger machines. Any advice that gets me from Inkscape drawings to the cut would be greatly appreciated! Thanks in advance :o)",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-02T07:06:46"
  },
  {
    "text": "I think you are the coolest!! 😎 Thank you so very much for all that you do! 😊 Thank you for creating videos sharing everything that you know, or learned thru trial, and error. It will definitely help a new beginner like me.",
    "likes": 2,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-02T04:48:00"
  },
  {
    "text": "Hey can this laser handle slate tile coasters? Thanks in advance",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-11-02T00:18:29"
  },
  {
    "text": "Lightburn is really good. Well worth the not much money.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-01T20:25:50"
  },
  {
    "text": "Did yours come with any software or instructions mine didn't and I have no idea on how to get it to work.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-11-01T19:17:54"
  },
  {
    "text": "It would be awesome if you could make a new video comparing your results with the new “Object capture” feature that comes included on MacOs Monterey.",
    "likes": 0,
    "video": "Turn Real Things into 3D Models with Photogrammetry",
    "video_id": "_ip8ODd7QvQ",
    "date": "2021-11-01T18:14:57"
  },
  {
    "text": "Are there any other lasers in this price range with a similar auto focus &  a camera? I'm a little concerned over delivery times?",
    "likes": 1,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-11-01T14:01:18"
  },
  {
    "text": "Very cool.  Thanks for a great introductory video.  It's appreciated.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-11-01T11:00:52"
  },
  {
    "text": "They seem to be upgrading on this one, as they get feedback.. I just bought one for 330$ with upgraded Metal extruder and also added \"New Dual Blower Kit\" to the cart on their website. Since i can see most reviewers agree that the cooling is lacking. This will be my first 3D printer, seems like you get pretty decent build volume for the money, other competitors seem to charge at least 100$ more for the same volume, and still dont give you a touch screen.",
    "likes": 17,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "video_id": "TAE1QBmVYSI",
    "date": "2021-10-31T19:45:36"
  },
  {
    "text": "5:41 $20 marked down from $549 seems a little suspicious...",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-31T19:22:56"
  },
  {
    "text": "Do you think this is a good engraver for hardwoods?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-31T15:08:31"
  },
  {
    "text": "Do you think you could cut 1/8 ply with the 10w D1 by makeblock?\n\nYour videos are super well edited BTW. Good job mate",
    "likes": 2,
    "video": "How to organize a Messy Drawer with a Laser Cutter",
    "video_id": "F5rxP_uGSrU",
    "date": "2021-10-31T13:35:53"
  },
  {
    "text": "Nice and somehow funny, I am just installing pro, industrial CO2 laser with working area about 11' by 5' (3.5m by 1.5m) with 20kW high voltage power supply. (overall consumption of that machine is around 3phase /400V/ 150Amps).  \n\nBut, thank for nice compact informative video.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-31T09:45:44"
  },
  {
    "text": "Would you say that the Hepa filter box actually works well enough that you could take it to a craft  show and not worry about setting off a smoke detector (sprinklers) or causing others to complain about smell when running the laser?  Thanks for the videos!",
    "likes": 0,
    "video": "Should You Buy a Glowforge?",
    "video_id": "4c4kxlYg-E8",
    "date": "2021-10-30T18:54:54"
  },
  {
    "text": "will this be able to cut 10mm wood / acrylic like the atomstack x7 pro?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-29T18:51:09"
  },
  {
    "text": "Good job Brandon! This or ORTUR Laser Master 2 Pro???",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-29T17:14:43"
  },
  {
    "text": "I’m wanting to start and I need to engrave metal drinking cups ets. I’m going to sign up for the class but it states August of 2021. Will you having another one? The class is it still going to be available? I read we can talk about my personal needs correct? I’m just wanting help in the engraving of small things.\nThank you\nDan",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-29T08:57:24"
  },
  {
    "text": "Great video for potential K40 owners. And thank goodness YouTube allows me to set playback speed to 0.75% or else I would have missed half of what was said.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-10-29T08:08:46"
  },
  {
    "text": "Good info, thanks. I built my own laser cutter/engraver using a 15W (optical power) diode laser. The gantry is made using 3D printed parts and 2040 aluminum extrusions. Will need to install an air assist system to improve deep cuts. The only thing missed in this video is discussing how some sellers of diode lasers mislead buyers by specifying the power used by the diode rather than it's actual optical (cutting/engraving) power. As an example, I have another diode laser that is sold as a \"15W\" laser but actually puts out around 4.5 watts of cutting/engraving power. 15 watts is the amount of power it requires from a power supply.",
    "likes": 9,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-29T06:34:37"
  },
  {
    "text": "In your opinion what would be a good laser cutter that handles a decent size piece of wood or acrylic.  Most of these co2 lasers seem to handle 20x8  . I read your reviews on glowforge and muse.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-10-28T20:32:49"
  },
  {
    "text": "Nice review man! I have the D1 coming next week with the rotary tool.  Gonna put it through its paces!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-28T16:12:22"
  },
  {
    "text": "Is this more powerful that the new LU2-4 laser from Ortur? How much more would I be able to cut with one vs the other?\nThank you!",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-28T16:11:58"
  },
  {
    "text": "Any link to metal engravers? Or a review for metal laser",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-10-28T09:35:39"
  },
  {
    "text": "Can this machine cut out thinner acrylic? I make jewelry with shrinky dinks but I've been thinking about upgrading to acrylic and getting this machine.",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-27T20:11:44"
  },
  {
    "text": "Boy are you off on the asking price looked up as I was watching. 10w $809 suggested $1031.99 which is ridiculous!  It would have to be  gold plated before I could recomend any one trying it out.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s",
    "date": "2021-10-27T17:10:15"
  },
  {
    "text": "Could this cut shapes out of 2mm wood, plastic and acrylic ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-10-27T12:24:44"
  },
  {
    "text": "minute 5:41,, easy.. thats to comb your hair dude !!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-10-27T06:14:57"
  },
  {
    "text": "Kinda wish someone ( or even better a brainstorming community ) would put out a DIY Solution with a BOM one can spec to their needs like the Voron 2.4 3D Printer I just recently built 🤔\n\nI really want a CO² Laser for various projects but the affordable ones either won't fit the size criteria, or the safety standards and the rest is either loaded with crap I don't need and just hiking up the price or even worse not controllable without a connection to a cloud service - Fuck _that_ in particular.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-10-27T02:33:07"
  },
  {
    "text": "I'm really interested in the 40w laser from the budget section. Would you recommend it for a small business. I have the ortur but it's not giving me the quality i would like (it's my dad's but I mainly use it) so would you recommend it? I use it for leather engraving btw",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-26T22:03:24"
  }
]