[
  {
    "text": "Hi could you pls go over the portrait setting in light burn. My photos are not coming out good",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2022-10-27T04:30:44"
  },
  {
    "text": "What do you recommend for a portable engraver for name tag blanks?",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-26T23:36:44"
  },
  {
    "text": "Is EZcad something you have to pay for, or does the machine come with a bundled deal? Is there alternatives that are cost free for the software?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2022-10-25T20:22:04"
  },
  {
    "text": "What is the depth of engraving? Will it work on say tools, and firearms?",
    "likes": 4,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2022-10-25T00:48:13"
  },
  {
    "text": "It's so cool, when we can see the TS2 laser review video🤣",
    "likes": 1,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-24T09:55:50"
  },
  {
    "text": "Just found out that omtech is dropping their own Glowforge clone soon. Or more like 1:1 copy of Gweike Cloud pro, lol. The information on the model is not exhaustive, but they don't mention any cloud-based software, just lightburn. It is wee bit cheaper than Gweike, should come with air assist (though no additional info to this) and autofocus. I am interested if it is gonna be a worthy competitor to Gweike, an exact copy, or if they even managed to make it worse than Gweike. They named it Polar.",
    "likes": 0,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-23T20:10:05"
  },
  {
    "text": "Nice breakdown. I’d love to hear your take on machines that can run a router and laser. I’m sure it’s not ideal, but could be good for those of us hobbyists short on space and money.",
    "likes": 2,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-23T18:43:31"
  },
  {
    "text": "I was able to get a K40 for $80 new.(guy did not know what it was) I would much rather have someone upgrade it for me though..",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2022-10-23T15:55:38"
  },
  {
    "text": "I'm in the process of making a butcher block countertop for an island.  I'm finding that my individual boards are not all the same thickness despite going through the thickness planer.  I think the knots are not getting planed down thin enough and are causing issues.  When putting all the boards together, there are gaps that, I think, are going to be too big to fill with glue/sawdust.  Still working on this little experiment!  Thanks for sharing your video.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU",
    "date": "2022-10-23T01:26:16"
  },
  {
    "text": "I run a 20+yo Universal V 50 Laser. can't believe how well this Mahine is made Never changed the Laser, Changed 4 sets of Bearings and Drive belts in set of struts on the access Lid. Paid 65k A$ back than for a fully decked out unit rotary included and got more than10 times the money back Super reliable, super happy.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-22T16:17:32"
  },
  {
    "text": "Worst part about 3D printing that I am finding is getting the right settings within the software. Machine runs fine, but the prints can vary alot depending on what settings I use. Still learning. Would love an Xtool D1 Pro next 😁",
    "likes": 2,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-22T13:23:47"
  },
  {
    "text": "you should mention you only talk about cnc routers , not cnc mills like a tormach pcnc440 or 1100mx or even a umc",
    "likes": 3,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-22T09:53:30"
  },
  {
    "text": "Do Not Buy a Monport super shady business.  Offer a Preorder discount that I jumped on.  Got my laser when they release it however I endup being charge $114 over retail and they refuse to price match their own retail price.  Its a \"price reduction is a marketing strategy\" where they overprice their preorder and drop the price on release.  As of their release price drop 4 times in 2 or 3 weeks.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-22T05:18:39"
  },
  {
    "text": "I have a 5-year-old Muse.  Its been ok, but lots of troubles from time to time.  Main board just had to go back to FSL for repair.  Got it back and it's working again, but now no WIFI.  Curious why you like the RE3 software.  I really struggle with it and find LightBurn to be awesome as have my first Diode laser.  Trying to convince FSL to make the Muse compatible with LightBurn.",
    "likes": 2,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-22T00:51:40"
  },
  {
    "text": "I'm at a community college art Department and we are just starting to create a maker space. I was wondering what you would suggest as a laser cutter for our new maker space. Several suggestions would be nice since we are just starting to figure this out. At this point we don't have a set budget to work within.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-10-21T17:45:43"
  },
  {
    "text": "Greetings from San Francisco.  Absolutely the most versatile tool is... the Hammer!",
    "likes": 1,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-21T17:15:31"
  },
  {
    "text": "What a huge pleasure for us to be one part of your R2D2! 🍻",
    "likes": 4,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-10-21T14:03:32"
  },
  {
    "text": "want to warn everyone about the EXTREMELY EXTREMELY poor customer service from xtool EVEN when you purchase the Xtool care! I spent $3k on the d1 pro 20w and i am returning it and taking a $700 cut in refund 1000% due to the extremely horrible customer service. 1 week reply’s to 10% of the email sent out to them! Please save your time and money and shop else where. They spend TONS of money on ads and campaigning and they SERIOUSLY need to put that into their customer care.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-10-21T01:53:44"
  },
  {
    "text": "I’m curious to know what safety precautions you took prior to launching your balloon. We’re you required to get approval by any agency? I only ask because an airplane could have flown right into your balloon and that little metal clip could probably cause a lot of damage to an aircraft going 500mph…",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-10-20T08:47:34"
  },
  {
    "text": "It would be awesome if you could list sizes in metric as well. Hurts my head trying to convert this in my head on the fly. Thanks from OZ",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-19T23:29:42"
  },
  {
    "text": "Looking for a laser to cut thru SST .062 thk. any suggestions. thanks",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-19T15:00:21"
  },
  {
    "text": "Good reviews fun and enjoyable I WANT TO GET THEM ALL",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-19T06:05:42"
  },
  {
    "text": "have anyone made it work with Piburn 4.0 rotary? Does it use a Ruida controller? Appreciate if any1 had made it work. Thanks",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-10-18T20:15:28"
  },
  {
    "text": "I currently have the Glowforge basic.  I’ve been trying to engrave on wooden spoons and spatulas.  No matter what I do my design will not line up.  Does this laser have the capability to line up your design.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-18T02:36:57"
  },
  {
    "text": "Love your videos dude. I wish Ortur offered a 20w version tho. Also, you are not pronouncing it currently. It's OR-tur, not OH-tur. Keep up the good work though.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-17T18:56:39"
  },
  {
    "text": "Thanks for the awesome video. I am intending to purchase this machine as my first laser machine. So the air assist is provided but we need to purchase the compressor? Will the air assist not work without the compressor? If not, what is the compressor for? Thank you very much.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-17T18:14:59"
  },
  {
    "text": "Whe you say you cut are you actually cutting or engraving it clooks like it’s engraving?",
    "likes": 0,
    "video": "Can You Carve a Pumpkin with a Laser?",
    "video_id": "WU9wyNLBpC8",
    "date": "2022-10-17T16:51:48"
  },
  {
    "text": "How does this guy not have a million followers? His reviews are the best. Best picture, audio information. Usually is very reply friendly (maybe cause he doesnt have a million followers lol). Follow this man.",
    "likes": 6,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-10-17T16:12:56"
  },
  {
    "text": "G Machine is super easy to focus though. I believe it always has a height of 17mm above the surface. So just subtract material thickness from 17mm and put that in lightburn under move and hit the move button. After the cut or burn it always goes back to that 17mm. It is one more step but for $3k less I think its worth it.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-10-17T16:10:17"
  },
  {
    "text": "Is the \"air assist\" is mandatory or that's optional, and what is it for exactly?\nI want to start a engraving company and want to buy the XTool Pro but I am new at this and I want to learn as much as possible.\nThanks for the video!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-17T07:07:58"
  },
  {
    "text": "Man thank you for this video this has really been a great resource for getting me started with my cnc machine. Top quality content my dood.",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "video_id": "Y-OU0yaD62w",
    "date": "2022-10-16T14:58:49"
  },
  {
    "text": "I couldn't keep watching after 10 minutes in. It made my head hurt! Do you actually use the lasers ever? How about chillers for the CO2s? Sorry if you included it later but most of these people want fast solutions.... an aquarium pump in a bucket is NOT that! Especially for the bigger wattage machines!!!!!!! Is there a redemption? I guess I'll never know because I'll never click on another video of yours!  Just some advice... actually try them before you use them. PAID PROMOTIONS ARE THE WORST! Goodbye! Edited for 10 minutes in...",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-16T06:07:02"
  },
  {
    "text": "Do you have a review on the XTool Laserbox Rotary vs the glowforge ?",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-15T17:25:12"
  },
  {
    "text": "It looks like price has double up since the review.",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2022-10-14T13:57:19"
  },
  {
    "text": "Great review! I have a question, is there a low cost engraver that can solve the air pollution problem? I think manufacturers should take this issue seriously. The fumes from the cutting process are so high that I would need to buy a huge enclosure to cover the machine, which is a considerable expense.",
    "likes": 9,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-14T08:00:14"
  },
  {
    "text": "what exactly they pay you to call the laserpecker the worlds fastes engraver?   \nyou mean in the toy category?   ;-)",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2022-10-14T07:03:13"
  },
  {
    "text": "They offer an Air Assist for the M1 now... It's $159.00 USD for the M1 version. They also offer an \"All in One\" package now that includes the M1, air assist, a preorder of their honeycomb bottom, and the stuff from the Deluxe kit..",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser & Blade Cutter Review",
    "video_id": "dZZ5HgbPLRU",
    "date": "2022-10-13T15:43:15"
  },
  {
    "text": "What is length and width of glass tube.. info will help if in future will alternative need to replace can it be doable",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-10-13T13:43:28"
  },
  {
    "text": "great stuff!    how can we contact you for a direct question/ application?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q",
    "date": "2022-10-12T16:31:08"
  },
  {
    "text": "It's took  so Mach time to find this video no fish eyes Len's finally  please backup if google removed uploaded again",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-10-11T07:19:14"
  },
  {
    "text": "Hmm.\nI'm thinking of building a larger format laser engraver/cutter but don't need industrial quality for $10k plus. \nI'll start with a cheap Diode laser source until I get everything dialed in but build it with the intention of upgrading to a CO2 source.\nshould be fun.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-10-10T15:47:31"
  },
  {
    "text": "Thank you for your amazing videos! If you could have only one 3d design software, what would it be?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2022-10-10T15:39:56"
  },
  {
    "text": "1:25 and even if you don't have a table saw you can just plane it by hand. No need to buy all kinds of powertools.\n1:55 dowels are optional. They can help against slippage while gluing, maybe even make the joints marginally stronger, but you don't actually need them.\n2:20 this is actually nonsense. If you alternate the directions you're going to get a wavy surface. You're averaging out the warping, but not stopping the warping. If you keep them all in one direction and make sure it wants to bow in an upward arch, if you then fasten the middle securely the entire rail the top rests on will stop it from warping altogether (that is, unless there's so much force the fastening doesn't hold, but you shouldn't get such moisture extremes indoors).\n40:20 you did the breadboard wrong. In the board itself you can just drill holes, but the part it slides over can only have a normal drill hole in the middle (to keep the breadboard centered). The other holes need to be elongated slots rather than just holes, so the pins going through them have room to move sideways (but not length wise obviously). Just a few millimeters, but what you've done now is basically the same as screwing the board on. This creates stress. Also, there's no need to glue it in the middle. You can, but you should glue less wide than you did. Just a bit around the centre pin.\n 4:20 yup, you need to practice planing. Especially sharpening your plane. Make it sharp, slightly round the corners, use a shallow setting, work methodically, and you won't have marks. Also, you need to check whether the sole of your plane is flat. \n\nGood on you for keeping practicing and wanting to learn!",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg",
    "date": "2022-10-10T13:43:48"
  },
  {
    "text": "If the earth is flat show the bottom of the ocean.....\n\n\n\nYeah you can't because it's not flat lol",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-10-10T02:25:45"
  },
  {
    "text": "CAN YOU LET ME KNOW IF YOU CAN DO STAINLESS STEEL?foz2423",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2022-10-09T13:14:13"
  },
  {
    "text": "Will this cut sheet metal? I'm thinking of trying to make stencils for pcbs",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2022-10-09T13:09:16"
  },
  {
    "text": "I have a 5w and looking to upgrade. Can I just switch the module to a 20w? Is it really that easy?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-10-08T03:18:49"
  },
  {
    "text": "Absolutely stellar. You moved fast for an absolute beginning. I am some what familiar with sketchup. I see the value in switching over to fusion, and that is why I’m here. Cheers.",
    "likes": 3,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2022-10-07T16:57:59"
  },
  {
    "text": "Great video! what are the dimensions of the honeycomb panel needed for the Aufero 2? Thank you!",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter Review",
    "video_id": "BU6rgzlKA-I",
    "date": "2022-10-07T01:38:40"
  },
  {
    "text": "What's with the weird wobbles in the image in the latter 10-15% of the video?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-10-07T00:43:46"
  },
  {
    "text": "I’m interested in an expandable unit? Atomstack? \nNeje @10  but any 20 watt \nAlso, to work without Computer hook up.  Suggestion? Thx",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-10-06T14:58:19"
  },
  {
    "text": "I'm interested in working with lasers. One question I wished you had addressed is consumables. Do the diodes have a limited lifespan? How about the CO2 tubes as well? I know you mentioned upgrading the diodes so I'm assuming that's a DYI  project and if your diode is 'dead' you can order a replacement. How about replacing the CO2 tube? Are there any other parts that may wear out? Thanks.",
    "likes": 5,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-06T14:05:27"
  },
  {
    "text": "Hi and thanks for this outstanding video! Which of this lasers is capable to cut the metal ?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-10-06T10:28:00"
  },
  {
    "text": "HEY! I was your 1000th like!  Great video - thanks for publishing material like this.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-06T03:18:56"
  },
  {
    "text": "Atomstack is comming with a fibre laser head for about 500 dollars, will you do a review on it?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-05T23:45:24"
  },
  {
    "text": "You should look into Xtool's new 1064nm IR laser. It CAN and does engrave on metals like silver, gold, titanium, stainless, etc... Crap for wood but great for jewlery.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-05T22:05:14"
  },
  {
    "text": "Awesome video!\nA  level plane 360 view, great stabilization!\nI can watch this over and over!",
    "likes": 15,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-10-05T15:45:31"
  },
  {
    "text": "great video, but dude, get a filter for your mic or edit out your swallows. I barely could get through this video",
    "likes": 0,
    "video": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "video_id": "Y-OU0yaD62w",
    "date": "2022-10-05T15:03:42"
  },
  {
    "text": "Hi Brandon . I sent you a message on Instagram when you have a free minute I would appreciate your reply and advice \nThanks a lot in advance",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-05T08:57:39"
  },
  {
    "text": "we are ready to order the 20 w pro machine..is there a difference in the gray machine from the red machine?   If i order an extension table, do i need to order 2 honeycomb sheets...Does the software come with the machine?  what all would you order for this machine?  Can someone please help with these questions....what is the difference between the metal risers and the wood riser blocks?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-04T21:02:18"
  },
  {
    "text": "Hi..you might have a video of how to use EZcad for beginners....many thanks",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-10-04T14:46:38"
  },
  {
    "text": "This is a little off subject but I sure could use some assistance, I have a XTool D1 pro 10watt, I then purchased separately the 1064 infrared laser head. My question is can I use the power brick that came with the infrared also with the 10watt?  It’s kind of a pain switching back and forth. I’ve sent this question to XTool quite a while ago and have still not received a reply. Thanks in advance.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-10-04T12:39:36"
  },
  {
    "text": "This video could have been 4-7 minutes based on the worthwhile info and delete all the bull time wasting. Thanks YouTube for fast forward tapping with ease.",
    "likes": 4,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 Laser",
    "video_id": "W5LaxGh2l1c",
    "date": "2022-10-04T08:11:05"
  },
  {
    "text": "Wow, REALLY disorganized and a time waster. Glad i didn’t watch this live.",
    "likes": 0,
    "video": "Unboxing and First Tests of the OM Tech 40W CO2 Laser",
    "video_id": "W5LaxGh2l1c",
    "date": "2022-10-04T08:07:30"
  },
  {
    "text": "Awesome video! Thanks so much for uploading! I have never ventured in to this world and wondered if you thought you could laser engrave wooden golf tee pegs with this? Any help greatly appreciated!!",
    "likes": 0,
    "video": "Why make THIS?  Aufero Laser 2 Engraver and Cutter Review",
    "video_id": "BU6rgzlKA-I",
    "date": "2022-10-03T21:19:14"
  },
  {
    "text": "Would you pick the atomstack 20w over the xtool 20w when it comes to most bang for your buck?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-10-02T19:27:30"
  },
  {
    "text": "Can one of the diode lasers like the Xtool 20w mark on polymers (like polypropylene)?\n\nOr that only the fiber (raycus style) and CO2?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-02T16:19:40"
  },
  {
    "text": "Air assist and a scissor lift are easy inexpensive upgrades that can be 3D printed coupled with an aquarium air pump. K40 Whisperer doesn’t actually come with it. It’s freeware and can be downloaded, though.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2022-10-02T09:15:38"
  },
  {
    "text": "please sir am in dubai where can i get that machine",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-10-02T04:56:15"
  },
  {
    "text": "I run a 10K Mazak laser at my job but I’ve been wanting to get a small personal one like this to do fun crafts on the side. This helped out a ton for sure!",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-10-02T00:56:11"
  },
  {
    "text": "8:15 Max speed for Diodes 10.000mm/s for CO2 35.000mm/s  🤣  Complete Bullshit. Cutting speed for diode 350mm/s. Even more  Bullshit.  I think you messed up mm/min with mm/s.  10.000mm/s would be 10 Meters or about 30 Feet per second in Imperial. At such speeds The mechanics would totally desintegrate itself.😉\n\nEven a cutting speed of 350mm/min is hardly possible with diodes if you dont want 10s or 100s of Passes.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-10-01T22:19:55"
  },
  {
    "text": "How does this compare to glowforge?? Is it more versatile?",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgrades",
    "video_id": "ZeajuzAjL9M",
    "date": "2022-10-01T21:52:53"
  },
  {
    "text": "Are the links to the test files for tile engraving still available?",
    "likes": 0,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8",
    "date": "2022-10-01T20:18:36"
  },
  {
    "text": "hi brandon, what is the thickest wood it will cut please?and keep up the good review,rot",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-10-01T04:43:31"
  },
  {
    "text": "How did I not think to use my D1 Pro to carve a pumpkin? Now I need a pumpkin.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-30T10:28:48"
  },
  {
    "text": "What about colour etching on metal/aluminium?  https://www.youtube.com/watch?v=0nxqcKUA2RU&ab_channel=ATOMSTACK",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-30T07:53:06"
  },
  {
    "text": "Great video, this unit be able to make small cut shapes of metal or other material?",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Smart 20W MOPA Laser Review",
    "video_id": "zYN0vb97caE",
    "date": "2022-09-29T14:02:39"
  },
  {
    "text": "I\"m sorry, but this video is terrible in my opinion. When introducing a new software to people, you do NOT constantly zoom in and out and talk a mile a minute. This is another excellent example of \"just because you CAN do something, that doesn't mean you SHOULD.\" I would love for you to redo this video so people can actually learn from it.",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o",
    "date": "2022-09-28T12:22:50"
  },
  {
    "text": "$700 as of today.  i think $500 is more reasonable for a 10w laser",
    "likes": 2,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-09-27T19:59:31"
  },
  {
    "text": "Hi, I'm trying to find the best laser cutter for Extruded Polystyrene (XPS) Rigid Foam Insulation (It's that pink very dense foam - the pink panther one). Can you recommend one for a 3-4 inch thick foam and a bed size of at least 2 X 2 ft.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2022-09-27T18:40:08"
  },
  {
    "text": "2:48 I wonder if suction make be better than blowing smoke out and about. Suction could go through filters to help clean it",
    "likes": 0,
    "video": "My Favorite Laser Just Got Better! - xTool D1 Upgrades",
    "video_id": "ZeajuzAjL9M",
    "date": "2022-09-27T13:16:20"
  },
  {
    "text": "thank you for this review. Do you think it will be possible to expand the machine to 140cm by changing the frame and belt ?\nIs there a limit to the size other than the physical size of the frame ?",
    "likes": 1,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "video_id": "XHsf7Hzs-0g",
    "date": "2022-09-26T20:41:43"
  },
  {
    "text": "10:00 they suggest they have a Ultra Fine 50 Watt LASER as well; and may be more...",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-26T17:59:50"
  },
  {
    "text": "Can you use the x tool rotary with the Ortur LM3? Seems like it’s better than the Ortur rotary",
    "likes": 0,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro Review",
    "video_id": "78yEfhWEJZc",
    "date": "2022-09-26T16:18:16"
  },
  {
    "text": "like ease of use (glow forge) but at HALF the price i am willing to learn a little and will go for the \"g\" machine",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-09-26T01:01:00"
  },
  {
    "text": "how come there are no videos showing the XCS software with this ...its like no one wants to actually show it ..lol ..been trying to use mine with my m1 and its so confusing",
    "likes": 1,
    "video": "The Best Rotary for a Diode Laser - xTool RA2 Pro Review",
    "video_id": "78yEfhWEJZc",
    "date": "2022-09-25T01:21:01"
  },
  {
    "text": "I wonder if a BL Touch from the 3D printing world could be added to a CO² laser.  Once calibrated and outer dimensions specified it could perfectly dial in the focal point.",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-25T00:49:58"
  },
  {
    "text": "I need some help deciding on a machine - I’m completely new. I have an apparel decorating business with embroidery. \n\nI have clients asking for leather die cut patches and other engraved items such as Yeti bottles and other water bottles. \n\nI was looking at the x-tool but thinking I should be looking at something a little better??? Thoughts",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-09-24T22:03:23"
  },
  {
    "text": "Do you have any idea how the xTool D1 pro 20w compares to the Atomstack x20 pro?  Thanks.",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-23T17:33:37"
  },
  {
    "text": "Product: ATOMSTACK X7 PRO 50W Laser Engraver,  15% off\r\nLink: https://www.amazon.com/dp/B09HKHWQ9L\r\nCoupon Code: B64TMTVT\r\nCoupon Code Price: 569.99*0.85-30=454.5\r\nOriginal price: 569.99",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao",
    "date": "2022-09-23T08:00:28"
  },
  {
    "text": "Hi I wanted to ask I want to cut acrylic mostly just round the edges of a acrylic sheet and some rectangle cutouts which one of those would do the 17-7/8 in. x 12-7/8 in. x 6-1/8",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-09-22T12:44:46"
  },
  {
    "text": "Thanks  so much for your  review.  I have been having  such  hard time  deciding  what to by. I am really  interested  in making  earrings.  Do you recommend  this  for that?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2022-09-21T05:27:15"
  },
  {
    "text": "Correct me if I am wrong but, compared to a CO2 laser, a diode laser doesn't use gas, so it doesn't have a limited shelf life (which affects CO2 tubes, even when they aren't used)...",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-21T02:36:19"
  },
  {
    "text": "It should cut better if you cut clockwise into the work piece.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-09-20T22:16:17"
  },
  {
    "text": "great video, I would like to ask you what cnc/laser would you recommend for engraving skinny tumblers and coffee mugs with handle? Looking forward to your advice.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2022-09-20T17:25:50"
  },
  {
    "text": "Purchased this exact Engraver for my son  and returned, (I myself have a 60W MOPA Fiber and a 100W CO2, so..no new to laser here), if you understand the words SLOW and UNDER-POWERED...you will stay away from this expensive \"toy\" no much of difference from a 10W Power (just the fact that they try to manipulate the power saying in the ads that the machine is a 130W power (but the diodes are 4x5W =20W) tells that they try to mislead the new buyers with minimum understand on how machine power and laser power works...my only guess, the machines giving to youtubers must be \"special ones\" given for free in exchange of a good word. Save yourself from a mistake",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-20T02:26:14"
  },
  {
    "text": "being tied to glowforge to run the machine gets a big, \" NO THANK YOU \" from me",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2022-09-19T20:45:43"
  },
  {
    "text": "There are a couple ways to get a stable focus, either eyeballing it or drawing lines on an inclined plane (too much to go in to here--search Youtube).  But once you find the height, measure it with calipers.  Then make a block that height--in my case, I 3D printed a simple rectangular block, was able to get within 0.05mm of the desired height, I think.  Then, if you want to etch, place your block on top of the etching surface, and let the laser module rest on the block while tightening.  If you want to burn, set your block on the empty honeycomb (or whatever sacrificial surface), and let the module rest on the block while tightening--remove the block and insert your material to burn.  This puts the focal length at the bottom of the material.  Note, this only works for up to a few millimeters of material.",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0",
    "date": "2022-09-19T18:22:41"
  },
  {
    "text": "In 1947, a couple of aliens flew to Earth in a silver saucer-shaped craft. After closely observing mankind, they shit themselves laughing and crashed into the desert in Roswell, New Mexico. The US Army found the shit covered craft, conducted an investigation, deducted what happened and out of embarressment told the public it was a weather balloon. ,",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-09-19T13:16:40"
  },
  {
    "text": "you state they increase the size to 20mm  but you fail to make it clear that its probably that it moves 20mm in one revolution vs 8mm",
    "likes": 0,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module Review",
    "video_id": "FnYy-QJqQsQ",
    "date": "2022-09-19T08:42:32"
  },
  {
    "text": "Really, this vibrating clump does cost $500 ? Man, how lucky am I that I got a real milling machine for less than twice that money, Sieg X2P. No CNC but does mill steel or 1/2\" aluminium in 1 pass. The original Genmitsu 3018 for $180 ist a bargain, but $500 for nearly same construction is way too much.",
    "likes": 1,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-09-18T09:01:36"
  },
  {
    "text": "very cool... that jet was so interested in you.  great video quaity... good job!!",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2022-09-17T16:34:46"
  },
  {
    "text": "Great video!, just what i was looking for...im thinking of starting a small bussiness with this..but i was wondering of the X10 version is good enough..what do you think?",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-17T10:31:06"
  },
  {
    "text": "As a fellow content creator I gotta ask... where in the world did you get those awesome light bars in the background?!?! AND are you using a slider or gimbal for some of the slow pan shots? Thanks! Sam",
    "likes": 5,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-09-17T04:40:24"
  },
  {
    "text": "Help… brand new to any of this.  We have been paying a TON to purchase engraving items for our business and hope to get this OR the S10 atomstack.  Problem is the PRICE….?? \n\nSo my questions: \n- which one S20 or S10 model is easier to use… (software/mobile options)? \n\n-does settings come in a book or are they posted somewhere? (Seems like x tool models provide this with their machines). \n\n-looking to engrave: Wine glasses, bottles, metal business cards etc….  Assuming rotary tool is purchased with the machine…. Does the 20w REALLY needed?\n\nAny and all help would be appreciated.  (My head is swimming right now)",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-16T19:06:34"
  },
  {
    "text": "I picked up the atomstack X7 but mistakenly got the 40W however I did get the Extension and its 410 x 850mm  Its Huge!!  Very happy with the purchase",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao",
    "date": "2022-09-16T13:47:04"
  },
  {
    "text": "This is the best video I've seen so far trying to switch from SketchUp to Fusion. The only problem is it's really hard to follow because it goes so fast, but I found changing the playback speed to .75 solves that problem. This video has really helped me understand how the software works. Great job, and thanks for sharing your knowledge. Your videos on laser cutters are awesome too!",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2022-09-16T00:52:33"
  },
  {
    "text": "Atomstack x20 Pro or xTool D1 Pro  which one do you recommend guys?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-15T21:25:14"
  },
  {
    "text": "I'm considering Lars is one those c*cks*ckers that was hire just to build a big group of users and make them adicted (\"guys it will always remain freee, woooow how fantastic it is, woooow i'm so excited, woooow woooow\"). It's clear it was the plan since the beginning. Evem more - that was its fundation because they, AD, needed thousands and thousands free beta tersters. I keep saying - NO TO CLOUD SERVICES. And no to corporaitons. No to autodesk. They literally fucked all those hundrets of thousands hobbists that were using F360 just a couple of time a year, occasionally, sometimes twice a year, for their own use. This is so unfair you pricks.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2022-09-15T13:26:32"
  },
  {
    "text": "First, great video! Great presentation style, nice and concise, good info delivered well. One thing I would have loved to have heard from you is what the main differences between a diode-based machine and a co2-based machine. I know you touched on diodes are more “beginner/budget”, and more compact and portable, but what are the pros and cons of each? Who’s the audience for each platform? And why would a diode be a better fit for this type of person, be a co2? And visa versa? I get that typically a co2 machine has a bigger work area, but I can’t image that’s the only benefit of going the co2-based route. Thoughts?",
    "likes": 1,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-15T13:12:47"
  },
  {
    "text": "Can't watch. You move your head too much. You're turning away from the microphone.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-09-14T22:27:07"
  },
  {
    "text": "None of these machines should be using the word PRO in their description. They are at best a hobby toy. The Chinese machines have part replacement issues and the water cooled are a real clumsy system that takes up space. Real pro machines, the kind that will last if you are trying to make money, are well over $12,000 dollars. Diode lasers required a LOT of patience and lots of scrap material to get the engraving where you want it on the work piece.  The video is spot on but lacks in total coverage of lasers that are out there.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-14T20:38:51"
  },
  {
    "text": "If i have a 10-25000 usd budget could you name the best one for me? Idk much about these yet but I'm trying to find the best for my dad's company",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-09-14T20:33:07"
  },
  {
    "text": "You are having problems with aluminium because you are not using the correct type of end mill. If the mill is chocking up use an end mill with more flutes or a higher rotation speed. Also you need mills with cutting geometry specifically for soft metals like aluminium and brass on low powered machines like this. If you had tried this with brass it would have probably given even worse results because brass is so soft it tends to grab the cutter so definitely needs correct end mills with the correct geometry. Also a shorter end mill will help and repositioning the spindle higher up in the mount will produce less stresses in the z axis and gantry assemblies.",
    "likes": 10,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-09-14T18:04:20"
  },
  {
    "text": "I bet it's fast at double to triple the price.  Think we are a full year away from these being affordable or worth it for small shop/hobby.   Time isn't a factor unless you are doing mass production.  For most, I'm betting this is such overkill it just won't come into play this year for most of us!   I rather spend money on a quality CNC  table top system.  At 3k, I can get a nice cnc setup, which has an optional laser.  ;)",
    "likes": 0,
    "video": "It's 48x FASTER than a Diode Laser! 3PLASERS EM-Smart 20W MOPA Laser Review",
    "video_id": "zYN0vb97caE",
    "date": "2022-09-14T16:50:48"
  },
  {
    "text": "Ah,  I see.  You learned me something.  \"They\" all say 10,20, 40 watts, but reality is, it's not true.   'Effectively' 10Watts, 20watts, would be more honest.  Website has a Atomstack X20 Pro 130W !\n\nI want to see that bad boy in action!   This is a great find.   The pricing on 40w system is really good!",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-09-14T16:28:13"
  },
  {
    "text": "Love these reviews, but would like to have your opinion on a laser that is portable and fast. I am looking for a laser to put in my craft show trailer. My main pourpose would be for engraving anodized aluminum minimalist wallets, flasks and tumblers.\nI currently have an XTool D1. I was going to use it, but it takes it around 10 minutes to do a wallet and I want this time frame brought down. So, I am thinking a fiber may be the best choice....but I also want to keep it sub-$2000 if possible. It will be powered using a gas powered generator and will be in an enclosed area (meaining out of spectator viewing range - but still well ventilated).\nThoughts?",
    "likes": 2,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-14T15:33:13"
  },
  {
    "text": "Would you use this laser engraver for phone cases with custom logos?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2022-09-14T13:23:35"
  },
  {
    "text": "They loose the drag chain ? 😢Otherwise, at 8:28 Is it really the xTool test on top of ortur test? It seems you were able to cut at 20% 50mm/s just the frame before? I've been really happy with the LM2 pro(and the support), but I will wait for their 20W version.",
    "likes": 0,
    "video": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "video_id": "5Id6Ba2cXE4",
    "date": "2022-09-13T18:37:24"
  },
  {
    "text": "cable management - use some zip ties - great content #specifications matter #stonehenge",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-09-13T11:21:18"
  },
  {
    "text": "Hello and thank you for the video.  I just bought the Xtool D1 Pro 20w.  I am entirely new to all of this.  I downloaded your test file but I still don't fully understand the laser or lightburn. Do you have a test file you used on the D1 cutting 3mm Birch?  Or is there a magical setting I don't know about in lightburn that will cover these parameters for me?  Any advice would be greatly appreciated and thank you in advance.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-09-13T03:07:54"
  },
  {
    "text": "All I want to do is leather hat patches and engrave tumblers...SOMEONE PLEASE HELP!! WHICH ONE??",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-09-13T00:01:21"
  },
  {
    "text": "questions, i just bought the plans. what are the standard size sheets you used for the ply? my D1 has a cutting area of about 20x20 (ish) and are the templates set to work on a table that size?   Also what size paint bottle are you using? ( GW or Dropper size)",
    "likes": 0,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg",
    "date": "2022-09-12T18:01:41"
  },
  {
    "text": "My apologies if this was already brought up, but I am looking to buy the Gweike Pro and the comment about the Autofocus function was a curveball for me. The unit clearly states it has an Autofocus Laser head separate from the camera. You could not use the rotary engraver without an autofocus head due to the irregularity of what you are engraving. Am I missing something?\n\nThanks",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-09-12T14:35:15"
  },
  {
    "text": "I bought this 3020 in Nov 2021 strictly for aluminum cutting. I’ve been using a competitors machine for over a decade and it works great. I was disappointed with this machine and had several issues. It will cut aluminum but not not very well. The 1/8” bit must be all the way in the shaft. (And to prevent milling the table it’s best to lower the Z axis to the lowest point and raise the spindle in the holder so the bit can’t reach the table.) But the spindle is just not rigid enough to handle the cutting, the length of the shaft allows slight flexing. And the spindle doesn’t have enough speed or torque. I found that even slowly cutting a 1” hole in 2mm aluminum with 9 passes was nail biting. It did cut the hole but was a struggle. The finished hole was a few thousands under size because the spindle rigidity was causing it to flex inward. And just drilling a 1/8” hole w the milling bit would sputter when reaching the bottom, and wallowed the hole almost every time. So to fix both issues I hack sawed the spindle holder (another problem-only a 55mm spindle fits), and mounted a $70 rotozip (600W 30K RPM) with metal strapping. Now it mills, drills, and cuts much better. Note that after less than 10 hours the 300W spindle stopped working.\n\nThe other issue I had was that most all of the USB software I tried wouldn’t run a few commands of my existing gcode. Also, it was essential that I could stop and start the gcode from any gcode line, and couldn’t do it! So, to get around those problems I abandoned the USB controller and bought a parallel stepper driver and use LinuxCNC (or Mach2).\n\nOverall it’s a nice little machine but wouldn’t recommend for aluminum unless your into mods.",
    "likes": 9,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-09-12T12:52:00"
  }
]