[
  {
    "text": "Ok i was just using TinkerCad and noticed there was ALOT of limitations but that is expected on a WEB BASED 3D MODELING... I mean come on.. So i looked in to FUSION360.. and since im a bit older.. i can tell you how i felt reading the changes even years after it happened.\n\nYall remember Photoshop? Like every single person on the planet knew of and used photoshop at least a few times in their lives.\nThen they did the cloud thing.. and guess what.. NO ONE uses photoshop anymore except their super rich nich businesses that already havent moved on to other technology.\n\nThats the vibe I get. Autodesk was something of a community of free users improving their help and tutorials and user interface. Everyone knew what autodesk was even if you never used its software. \nThey will go 100% cloud and be premium for a insane priceing stradegy only to attract the richest of the rich customers all while making their name on the free version no longer offered.\n\nFU Autodesk\n\nMoving on to something else before i get used to your software then you take it away and charge $2600 a year.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Version?",
    "video_id": "3ceo1sNpDgs",
    "date": "2022-12-03T05:02:31"
  },
  {
    "text": "for 4000$  I can buy good machine from factory, 24x39” . why Pay for this garbage",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-03T04:54:52"
  },
  {
    "text": "Thanks for the review, I’m thinking of purchasing one in the future. Do you know if the Omtech 60W machine is able to cut clear or frosted acrylic?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-03T00:49:41"
  },
  {
    "text": "Cool all in one. I assume they only offer a low power laser to keep cost down, and if you're looking to cut something, why not use the CNC function? \nI'd really like to see you review the Genmitsu 4030, which seems to have pretty solid build quality for the price and plenty of add-ons like extension rails to massively increase the work area and a 10W laser that would give you 2/3 of these functions, but very possibly provide much more superior performance for the same cost.",
    "likes": 0,
    "video": "How Good is this Thing? Snapmaker 2.0 Laser Module Review",
    "video_id": "FnYy-QJqQsQ",
    "date": "2022-12-02T21:44:41"
  },
  {
    "text": "Hi,\nI am new to the laser world and am looking for a cheap laser engraver for 3mm mirror acrylic mainly, will the on tech 40w desktop laser work/ I will be creating small items for projects.\nAppreciate any advice you can give.\nThanks",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-02T21:26:12"
  },
  {
    "text": "I just got mine yesterday and came from glowforge so was super nervous about how user friendly it would be. Everything worked great out of the box- I followed Cam’s setup instructions. I had a couple initial hiccups running it with my Mac (no usb and I needed a usb to usb c conversion and then still my Mac not recognizing it for whatever reasons and next trying to run it through a gfci outlet was a no go and still trying to figure out Wi-Fi/Ethernet connection stuff). But now running lightburn on my daughter’s pc it is working great. Much more powerful /fast/capable than my glowforge plus and wow for the price. If you follow the unboxing and setup videos that are on YouTube, read the manual thoroughly, then it doesn’t take long to understand it and get running. TBD if I can get my Mac to recognize it. Also 7mm hold down pins was my first cut and that appears to be the sweet spot",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-02T18:44:21"
  },
  {
    "text": "I checked out your link for the glowforge but when I hit up the chat bot with a question I waited and waited and finally I had to go do something else.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2022-12-02T17:11:04"
  },
  {
    "text": "My wife recently went from a Glowforge Plus to a Thunder 100w Nova 51. She’s doing ok with the transition to light burn but still having trouble using the rotary attachment. Any recommendations or tips I can pass along to her?",
    "likes": 3,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-02T07:29:51"
  },
  {
    "text": "for $3500 I got a 100w chinese laser that can cut 23\"x37\" and has a motorized bed, rotary attachment, chiller and air assist compressor. Granted you should have some experience before going this route, but you can get a lot more for your money.",
    "likes": 4,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-02T01:12:41"
  },
  {
    "text": "Great video especially for us newbies , I'd love to see a follow up video for pricing ?? Appreciate ya !!!",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-12-01T21:18:30"
  },
  {
    "text": "This is exciting but can you show if it has a full pass thru (the gweike cloud does not) and how a rotary will work? I felt like the gweike cloud was going to make it impossible to engrave tumblers as such. I love my China 50W laser but it has a lot of modifications done to it so it is less user friendly.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-01T02:58:17"
  },
  {
    "text": "Thanks. I have ordered the Artisan to replace my 350. The single point attachment of the platform is a good point.  Jim Bell (Australia)",
    "likes": 4,
    "video": "Is this feature worth $2400?  The Snapmaker 2.0 Rotary",
    "video_id": "9sBdrrkRMHc",
    "date": "2022-12-01T02:46:22"
  },
  {
    "text": "I've been comparing the Omtech Polar to the Gweike Pro and the Omtech looks a little nicer but it's $1000USD more money.  I'd say for that much difference Gweike wins.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-12-01T01:09:32"
  },
  {
    "text": "Seems that the Polar's biggest drawbacks are the heights you can engrave both flat and with the rotary. Flat is .66 inch with tray and 2\" without the tray  and  the rotary is 1.18 to 2.91 inch. Don't know many shot glasses or glasses that small.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-30T22:48:50"
  },
  {
    "text": "This is amazing! I absolutely love, love this! Do you have plans for an ink pad storage tower? Or do you know where I can find them?",
    "likes": 0,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg",
    "date": "2022-11-30T16:13:20"
  },
  {
    "text": "custom rubber stamps? is that possible with one of these low powered 20 watt lazers",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-30T11:30:46"
  },
  {
    "text": "I know this is kinda off the beating path - but since you briefly featured your MF2028-60, do you happen to have any data on that machine's precision?  @omtechlaser doesn't publish it, and I've been trying to get an answer from them for a week or so now.  Kinda concerning that this isn't readily available from them.  \n\nI have a K40, and they actually do publish a 0.010\" precision rating for that machine, but nothing for the 55 or 60W machines.  Anyways - figured I'd ask you because you've been using OMTech for a while.  Thanks MOBS!",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-29T17:27:28"
  },
  {
    "text": "I just tried to purchase one, however, the discount code isn't working from the affiliate link.... What do I do?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-29T08:37:46"
  },
  {
    "text": "Would you buy this over the master 2 today the master 2 is $318",
    "likes": 0,
    "video": "The Best Laser engraver on a budget",
    "video_id": "eZMyGyXsMys",
    "date": "2022-11-28T16:36:41"
  },
  {
    "text": "Thanks for your video! Do you have any spec comparisons or recommendation toward one or the other between the Gweike and the Makeblock/xTool Laserbox Pro?  I'm currently torn between the two and need a professional opinion to sway me in either direction. (To give you an idea, I would be using the laser cutter/engraver for typical Etsy work with acrylics, mirrors, wood, etc. I know either machine would fit for that purpose, but I do plan to eventually grow my shop and learn how to use the machines for more purposes down the line. I'm looking for a machine I can grow with and learn more about as well as do the typical beginner stuff.)  Thank you!!",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-27T04:33:26"
  },
  {
    "text": "honestly... this thing looks cheap right away. i mean, it's $500. this is one of those things where you will actually pay MORE by trying to save money and going cheap.",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-11-26T22:05:37"
  },
  {
    "text": "I know this is a year old but you can get a k40 to a 12×24 work area that's still cheaper than a glowforge.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2022-11-26T21:00:36"
  },
  {
    "text": "hmmm, I dont see agate stone, such as carnelian being something that this machine can engrave. Can someone verify if this can engrave agate stones/crystals/gemstones, such as carnelian?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I",
    "date": "2022-11-26T18:15:24"
  },
  {
    "text": "Hey there, went to order a Polar and got this message(Enter a valid discount code or gift card).tried it twice...any ideas? Thanks in advance",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-26T17:49:30"
  },
  {
    "text": "Better get one of the 'new' (oh well for lack of a better term) 3020 machines that can go up to 5 axis. They look really promising for a small CNC aside from the up to 5 axis benefits.\n\nAlso you do not want the powersupply attached to the machine. Dust, (metal) chips and EMI are some reasons why.",
    "likes": 7,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-11-26T17:44:17"
  },
  {
    "text": "How would you compare the Polar to the Gweike RF laser system.  I am interested in your thoughts about comparing the 50W DC to the 38W RF laser source.  Looing at quality of the laser, speed of cutting/engraving a quality of the engraved product.",
    "likes": 4,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-26T03:56:21"
  },
  {
    "text": "To start with I'm looking to write names on a 1/2\" thick piece of wood so would yall recommend this or the laser thingy?",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2022-11-26T03:52:18"
  },
  {
    "text": "Usually find your reviews good but man this one seams like you did it quickly just to  get it out of the way.👎🏻",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-26T02:20:38"
  },
  {
    "text": "Hi Thank you for the tutorial. Can this cut colored and Transparent Acrylic?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-11-25T20:09:03"
  },
  {
    "text": "Thank you! I was looking to upgrade from a diode laser but space is limited so the big OMTech was out of the question. I was just about to buy a glowforge basic and after seeing this video I placed my order for the polar pre-sale!!! I had no idea they made a desktop version. I used your link, I hope you get affiliate credit!",
    "likes": 9,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-25T18:15:59"
  },
  {
    "text": "I just added both to cart to see final price and looks like g machine adds $300 shipping. Omtech is free shipping. Could a deciding factor. \n\nHowever with g machine being $2550 right now for Black Friday and omtech appearing to not have a Black Friday deal on it seems g machine is still cheaper.",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-25T15:26:20"
  },
  {
    "text": "You soups add a warning for using leather, the tanning process uses some serious toxic chemicals, including cyanide and arsenic.. hitting them with a laser is bad..",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-25T03:03:08"
  },
  {
    "text": "I just bought a Gweike (comes in 3 days!) after seeing your video reviewing it. Now I see this one and feel I should have went with an OMTech Polar..",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-25T02:40:41"
  },
  {
    "text": "Great review.  I have purchased the X-Tool D1Pro with all the attachments.  Half of the order is in and the other half will be here early next week.  Can't wait to get it all set up.  \nMy question is, what do you put under the honeycomb mat?  I am thinking that it would be a sheet of metal.",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-11-25T00:25:48"
  },
  {
    "text": "I just built my own laser.  It’s bigger and faster with 120 watt co2 and was $4000 Canadian dollars all said.  Put many many hours on the machine and it’s been awesome.",
    "likes": 4,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-24T23:23:20"
  },
  {
    "text": "Why omtech continues to make products that are not compatible with 110V and 220V :(",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-24T11:55:25"
  },
  {
    "text": "neurotic presentation and speech but lot of information. Thanks",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-11-24T09:57:24"
  },
  {
    "text": "The discount code doesn't seem to be working for me.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T23:33:27"
  },
  {
    "text": "I have a glowforge.  I would never recommend a glowforge because I own a glowforge.  I want to get rid of my glowforge and get a \"real\" laser cutter and not a laser \"printer\".",
    "likes": 95,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T22:56:54"
  },
  {
    "text": "Love your videos...so thanks for them 👍 Have you had any experience with the Gweike RF desktop laser? I currently own the Ortur LM2 Pro & use it mainly for engraving ceramic tiles & slate. I would like an upgrade in speed 🤔",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T22:04:51"
  },
  {
    "text": "I’ll be purchasing a laser next year and your videos have been invaluable; definitely will sign up for one of your classes once I get it in my shop!",
    "likes": 21,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T21:37:38"
  },
  {
    "text": "I am curious what the power requirements for these machines are? Do they require a 110v or a 220v line?",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T19:36:22"
  },
  {
    "text": "I'm curious how big of a tumbler you can do with this on the rotary. Trying to find videos with the G machine all you see is people using some dowel rods in it but not really showing useful product in the rotary. I like the idea of polar as it'll be easier to get into my basement but I'm wondering if I wanna limit myself or just go with the bigger blue machine you have to the right and make my garage be the new shop area. Think it'd be hard to get that big machine into the basement",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T18:15:00"
  },
  {
    "text": "Glowforge is a compete pos. Prior to buying my 50w Omtech, I rented a Glowforge from a friend, and it was 100% unusable because you HAVE TO scan the bed with the camera prior to every burn. So, if you think you’re going to design something and pound a bunch of them out, 1 after the other, you’re going to be seriously disappointed. It makes no difference that every piece is on exactly the same material and there is no need to scan every time. You HAVE TO. Their software is crap and replacement parts are more trouble than their worth.\n\nI had a Lightburn camera on my Omtech. I took it out and threw it away. I can’t imagine what could possibly be the use for something so wildly inaccurate, and that’s after having spent far too much time mastering the calibration procedure. I’d disagree with the statement that Omtech support is great. It’s not. I had an issue with a loose X axis belt. I spent several days going back and forth with them and their suggestions for what to do had nothing - literally zero - to do with the problem, which was a loose belt. I figured it out on my own. Aside from that, I’ve been VERY happy with the machine and I’m coming up on a year of using it for production manufacturing.",
    "likes": 1,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T16:47:05"
  },
  {
    "text": "I thought with a co2 laser you still needed to wear glasses.. is that not the case?",
    "likes": 0,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T16:39:44"
  },
  {
    "text": "Pretty good price point, I was surprised it was affordable as it is.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T16:10:43"
  },
  {
    "text": "Is there any possibility you could do a comparison and overall review on a Omtech 2440 and anything that is comparable to it like the thunder or whatever else? I am going to the ISA Expo in Vegas in April and will be purchasing something.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T15:53:25"
  },
  {
    "text": "Glowforge is going to have to make a pretty big decision in the next few years.",
    "likes": 18,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T15:47:44"
  },
  {
    "text": "Will you do a video showing the Polar, or Gweike passthrough in use.",
    "likes": 7,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T14:41:46"
  },
  {
    "text": "Great breakdown. Is the working area deep enough for Yeti tumblers on the polar? I see the rotary but it doesn’t look very deep.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T13:47:09"
  },
  {
    "text": "Gweike is pronounced “G-wic”\nGweike is also the collaborative partner with OMTech meaning they manufacture the polar.",
    "likes": 2,
    "video": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "video_id": "15b3sLZ5pkY",
    "date": "2022-11-23T11:46:17"
  },
  {
    "text": "What is the difference between x20, a20 and s20 pro? Only color? But s20 and x20 are silver both",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-11-23T07:20:08"
  },
  {
    "text": "Do you think the blade can cut a slightly thicker fabric like a 2mm neoprene?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser & Blade Cutter Review",
    "video_id": "dZZ5HgbPLRU",
    "date": "2022-11-23T05:40:25"
  },
  {
    "text": "What size beam does the Gweike Cloud use? is it a small fine laser beam or is it pretty thick?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-23T02:43:31"
  },
  {
    "text": "Can I ask how long it took for you to receive the Gweike Laser?\nI have placed an",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-23T01:35:14"
  },
  {
    "text": "Let's not forget to mention that Glowforge has zero customer service.  I bought a Pro and the laser tube died after 23 cuts, their answer was for me to pay $1,651 send mine back and then they would in turn send me an old refurbished Glowforge Pro, what the heck?  I haven't even used my new Glowforge Pro for a month and it quit, then they insult me with a refurbish offer and to pay them more money!  Forget the Glowforge!  Zero customer service.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-22T22:51:50"
  },
  {
    "text": "I spy an OMTech Polar! I did a couple videos on it already. Working on a couple more.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-22T15:41:32"
  },
  {
    "text": "I'm new to this.  I'm a hobbyist woodworker and it seems clear that a diode machine will be what I want.  But I still have so many questions.  What does air assist do?  What wattage would I want and what difference does power make (speed?).  What software is most common and will I have to spend money on that?  Can the software run on an ipad (don't have a laptop)?  How long do diodes last and what do they cost to replace?  Can I run these in a cold environment (think garage in Minnesota in the winter)?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-22T15:18:46"
  },
  {
    "text": "what laser machine is strong enough for engraving Oak wood cutting boards as you talk about at number 2?",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-22T02:02:04"
  },
  {
    "text": "I want buyer Neje  laser machine \nDo you think is good brand",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-22T00:02:43"
  },
  {
    "text": "No payment?  The machine is your payment, 😂😂. Great video though",
    "likes": 0,
    "video": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "video_id": "3r6YwFF_tME",
    "date": "2022-11-21T21:45:11"
  },
  {
    "text": "If you do wooden coasters, Finish them in a polyurethane or epoxy. I have had amazing luck with Zar solvent based polyurethanes. I have a couple test coasters I made, that I have been abusing for the last year. They have held up flawlessly, no surface degredation, I am constantly putting hot and cold items on it, leaving water on it ... etc. Been amazed at how well it has held up.",
    "likes": 31,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-21T21:21:17"
  },
  {
    "text": "I have no idea how I ended up here, but I was looking at signet rings and thinking of how I could engrave them myself. Wondering how this would work with a surface that is not round.",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2022-11-21T19:48:13"
  },
  {
    "text": "Very nice video, one thing to mention though... Maybe I missed it, but I think it's very important to mention that diode machines can't cut transparent materials like clear acrylic and co2 ones can.",
    "likes": 9,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-21T19:45:20"
  },
  {
    "text": "Hello and thanks for your time. Witch one you can recommend me to cut 1/4 and 1/8 acrylic in a clean and smooth way?. Thanks for the advise.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2022-11-21T16:11:18"
  },
  {
    "text": "I just learned that diode lasers can't engrave metal. If you want to engrave metal and wood you need 2 different machines. What producers puts on web sites is actually metal coated with something and laser cut this 'something'. So... fast buying - bad buying if you are beginner like me.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-21T10:08:13"
  },
  {
    "text": "why does k40 not make an upgraded 1500 dollar version?!",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2022-11-21T04:21:46"
  },
  {
    "text": "Since this video is two years old, do you have an updated recommendation?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2022-11-20T14:04:24"
  },
  {
    "text": "So your bookmarks example shows a Hobbit or Lord of the RIngs map?  Where and how do you go about getting permission to print that image?  Isn't that a copy right issue?",
    "likes": 5,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-20T13:12:05"
  },
  {
    "text": "Any thoughts on the Epilog CO2 lasers particularly the pro series 36 inch? And also 60 w fiber from Tykma any feedback would be appreciated",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-19T17:36:48"
  },
  {
    "text": "Photo isn’t spelled just with a P, 😂🎉❤. ROTFLMAO, Good one! Just teasing. Love the video and your Polar.",
    "likes": 2,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-19T17:28:51"
  },
  {
    "text": "Is the m1 worth for a beginner or is d1 better? for a 16 year old boy who want to start a side hustle.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-19T14:27:28"
  },
  {
    "text": "Boy, really quick is right. By the time I got QGIS downloaded you were done, so I have to watch about 10 more times to really get anything out of your video. Thanks though!",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o",
    "date": "2022-11-18T07:25:33"
  },
  {
    "text": "Which device do you recommend for engraving gemstones like agate?\nFiber laser or co2 or diode? also what is the minimum watts should i look for to engrave on gems?",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-17T20:18:13"
  },
  {
    "text": "I love the video! Do you know where I can find the video of you showing us how you made your maps? I’d love to make a map of my local area! I live in the middle of Wine Country! I think it would sell really well if done right.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-17T19:25:58"
  },
  {
    "text": "What would be my best option (engraver) for stainless steel cups?",
    "likes": 0,
    "video": "3 HUGE Upgrades in the xTool D1 Pro!",
    "video_id": "F_33OeMTf1s",
    "date": "2022-11-17T16:52:58"
  },
  {
    "text": "I am looking to open a shop in a mall for laser engraving products. I wanted to know if ventilation system would be mandatory ? if anyone can help",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-17T16:18:47"
  },
  {
    "text": "I thought kids puzzles were a liability nightmare at least in the US.  If a kid chokes on your puzzle you are going to get sued.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-17T15:52:28"
  },
  {
    "text": "Do you have a current breakdown of the best diode laser? I'm trying to figure out which one would be best for what I want to do",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-17T15:45:42"
  },
  {
    "text": "Personally I 3d printed bar taps with a screw insert in a small block of wood epoxies into the bottom for longevity. Made $6k from a single owner of 6 stores. Good money, just have to go visit the bar, talk with the owner and show him a product. If he likes it, it's a very easy sell. Especially if they can give you their store logo art work to put on the top. It's kind of branding the bar so to speak. That is my secret business lol, wasn't trying to advertise it but its ok, it's not original,  just business",
    "likes": 11,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-16T22:59:08"
  },
  {
    "text": "I find literally the same designs and drawings all over. Researching petroglyphs in Southwest USA turned up two designs created by uncredited authors being sold on mugs, tshirts, woodcraft, metal craft, etc. by at least 10 different sellers... as their own work. This crap is rampant. I can find tshirts with readily available art work being sold at discount stores all over the metro. One guy on youtube publishes a design build, and viewers complain when he doesn't make dimensions or code available.  When a creator does publish build files, code, etc., you can subsequently find that design being sold online as some douche's original work.\n\nSome people are actual creators. Everyone else seems to be ripoff artists.",
    "likes": 6,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-16T10:42:41"
  },
  {
    "text": "Great video - 2 and 3 listed as tumblers in the description.",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-16T03:00:52"
  },
  {
    "text": "Just because Glowforge is based in the US doesn’t mean their support is better. I have found that it takes weeks for them to reply to any email and try to blame any machine issues on the user.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-15T22:32:36"
  },
  {
    "text": "Air assist is an option now, and they have also released a riser base with a honeycomb. Love this machine.",
    "likes": 8,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser & Blade Cutter Review",
    "video_id": "dZZ5HgbPLRU",
    "date": "2022-11-15T18:46:33"
  },
  {
    "text": "Please review the consumable CO2 tube in both kits in terms of usage capacity, cost and reliability. Do they have inbuilt fire detection and laser shut off features? I reckon Glowforge would be easier to service.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-15T06:28:04"
  },
  {
    "text": "If by \"ultimate\" you meant 1/16th the size, then Wow you did it ! Congrats it's amazing !",
    "likes": 0,
    "video": "Making the Ultimate 3D Carved Sign from Disney's Haunted Mansion",
    "video_id": "VGgg1HUTbJ4",
    "date": "2022-11-15T03:21:05"
  },
  {
    "text": "Hey can you tell me what type of omtech laser is that? It doesn’t seem like a k40",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-15T02:21:57"
  },
  {
    "text": "Is this a space where a person would have to purposely be doing things wrong to not turn a consistent profit with any of the high end machines?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-15T00:41:47"
  },
  {
    "text": "step one) steal artwork from the internet \nstep two) engrave it on useless tat",
    "likes": 1,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-15T00:17:15"
  },
  {
    "text": "Just pre-ordered the polar from omtech. Can’t wait for your review.",
    "likes": 0,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-14T23:10:28"
  },
  {
    "text": "I agree with all of these products and recommendations! Great work and great video! 🎉",
    "likes": 4,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-14T14:39:11"
  },
  {
    "text": "Thank you for the awesome video.  I’m currently making ornaments for a local state college to give out.  I definitely like selling local rather than on Etsy.",
    "likes": 7,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-14T13:45:38"
  },
  {
    "text": "So your first idea is to take a design from a copyrighted work?  Come on...  This is literally why Etsy is flawed.  Tons of vendors stealing each others work and selling as their own.  You mentioned copyrights at the end of the video but your first item has copyrighted material as well:  \"Tolkien's original drawings, paintings, maps, designs, scripts and other graphic works are protected by copyright and may not be copied\".",
    "likes": 33,
    "video": "Top Ten Products to Sell with a Laser Engraver & Cutter (2022)",
    "video_id": "i8KiBEkECvI",
    "date": "2022-11-14T13:38:04"
  },
  {
    "text": "I loved all the information you gave. Thank you. What is your recommendation /advice to use a laser engraver on stone",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-13T23:35:29"
  },
  {
    "text": "Hi, can you post the link to this specific aufero laser 2?",
    "likes": 2,
    "video": "The Best Laser engraver on a budget",
    "video_id": "eZMyGyXsMys",
    "date": "2022-11-13T08:25:17"
  },
  {
    "text": "Hi mb, \nI love your videos!  Do you think this machine can also be used vertically against a wall?  Is the motor strong enough?\n\nGreetings,\n\nMartijn from the Netherlands",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2022-11-13T07:36:17"
  },
  {
    "text": "Thank you helping making my decision easier.  Started with Fusion, and keep thinking I might switch to Sketchup, I just need to stick with it… :)",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2022-11-12T20:43:55"
  },
  {
    "text": "I never hear anyone specify what computer you can use. Mac or windows? Are there any that can not be run on a Mac?  Please do a video on setting up the computer and what computer you use.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-12T15:39:53"
  },
  {
    "text": "Loved this video. Going to have to explore doing some things like this for sure. Thanks for sharing.",
    "likes": 1,
    "video": "Make any Image you want for FREE - AI Art Beginner's Guide",
    "video_id": "D13YvWCqfFI",
    "date": "2022-11-12T14:52:30"
  },
  {
    "text": "It would be useful to mention the sound output also",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-12T13:31:43"
  },
  {
    "text": "Hi, which diode do you think is best at around $300?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-12T07:29:59"
  },
  {
    "text": "been trying figure out software for it. about to break my computer over my head",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2022-11-12T03:38:49"
  },
  {
    "text": "I love all of your videos.  They are so very informative.  Have you got any info or experience with the  ATEZR P20 PLUS 20 watt laser?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-11T15:25:43"
  },
  {
    "text": "I need to laser engrave a piece that is 15x15 inches large.  Will it fit inside the gweikecloud? My engrave area on that is definitely within the work area specs, but I cannot find definitive info on what size material will fit inside the machine.",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-10T16:36:50"
  },
  {
    "text": "Hallo, thank you for your video. What laser can you recommend me for starting A business with engraving ultrasound pictures to gold pendants please?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-10T05:28:22"
  },
  {
    "text": "Hi Brandon came across your video and would like to know what would you suggest for a beginner at using laser.\nI create O scale dioramas and want to design and cut my own buildings.\nGreat video but still not sure which Laser cutter that I need.",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-10T03:54:37"
  },
  {
    "text": "Hi do you recommend any laser machines\n that can laser engrave tall items 7 to 8 inches tall with a wooden base etc",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-08T03:05:18"
  },
  {
    "text": "Im interested in how this compares to the FS Muse Core, since their prices are so similar. This machine appears to have more going for it at a similar price point if I'm not mistaken? Espacially since its in close competition with this top of the line Glowforge machine.",
    "likes": 2,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-07T20:26:06"
  },
  {
    "text": "What size honeycomb bed would fit it? everything is cm not inches?????",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2022-11-06T15:05:27"
  },
  {
    "text": "I'm looking to do string inlay.... veneer - .9mm is common, brought to final thickness witha hand tool, and inserted into a routed slot 1/32 wide by 1/16 deep and  leveled to the surface with handtools.  I sounds like cnc would be perfect.  Thoughts?",
    "likes": 0,
    "video": "CNC vs Laser vs 3D Printer - Which is BEST?",
    "video_id": "e4i87h9ybVE",
    "date": "2022-11-06T06:46:48"
  },
  {
    "text": "4 laser diodes at 6 W each hmm that seems more like a 24 watt laser to me,, hows that work? Also the cut chart you posted is for the Atomstack X7, do you have one for the X20 or A20 Pro??",
    "likes": 0,
    "video": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "video_id": "eSXvnfVeF5g",
    "date": "2022-11-05T16:00:27"
  },
  {
    "text": "Would this machine cleanly cut 7.5 to 14 mil Mylar for stencil making?",
    "likes": 0,
    "video": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "video_id": "XHsf7Hzs-0g",
    "date": "2022-11-05T00:37:11"
  },
  {
    "text": "I'd like to know if it can engrave on and cut pure silver and gold(916) surfaces ?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2022-11-04T15:02:15"
  },
  {
    "text": "Hope we will have \nnext cooperation for the EM-Smart One 20W fiber laser review. :)",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2022-11-04T03:16:21"
  },
  {
    "text": "Dang it.  I was looking at this for a while and with the $200 discount from you and the Black Friday discount I am getting this for $2650 shipped.  Could not pass that up.",
    "likes": 1,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-11-03T15:32:08"
  },
  {
    "text": "Please HELP! I was going to get the X-20 pro but no air or metal table{$1500}. I can get this with both $1100 \"ATOMSTACK A20 Pro Laser Engraver Cutter, 130w High Energy CNC Laser Engraving Machine, 20w Laser Cutter and Engraver Machine with Air Assist, Support APP, DIY Laser Engraver for Wood/Metal/Glass. What would u do?",
    "likes": 0,
    "video": "Top Laser Engravers and Cutters to Get in 2022",
    "video_id": "gvOL0MKGr84",
    "date": "2022-11-02T21:17:45"
  },
  {
    "text": "I’m both impressed and slightly horrified at the potential/inevitable Nineteen-Eighty-Four style uses of this kind of AI tech.",
    "likes": 3,
    "video": "Make any Image you want for FREE - AI Art Beginner's Guide",
    "video_id": "D13YvWCqfFI",
    "date": "2022-11-02T12:37:46"
  },
  {
    "text": "Do you have a contact to talk about getting a laser?  I have several questions.",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner's Guide",
    "video_id": "D13YvWCqfFI",
    "date": "2022-11-02T00:45:11"
  },
  {
    "text": "Your Mom's House has a running gag about Garth Brooks being a serial killer.  One of their fans used AI to show what that would look like. https://youtu.be/rI5kUOT9DU4",
    "likes": 0,
    "video": "Make any Image you want for FREE - AI Art Beginner's Guide",
    "video_id": "D13YvWCqfFI",
    "date": "2022-11-01T19:36:22"
  },
  {
    "text": "Great Review, I am looking and getting my first laser and I am wonder what you would think would be the best machine for a good price to cut and engrave acrylic stands for figures and acrylic signs.  Would prefer clear or something has some transparency to it?",
    "likes": 0,
    "video": "The First Laser AND Blade Cutter!  xTool M1 Laser & Blade Cutter Review",
    "video_id": "dZZ5HgbPLRU",
    "date": "2022-10-31T01:32:35"
  },
  {
    "text": "How long did it take you to print the helmet? I am working on a print in a smaller size and it is giving me 30 hours. I have already set up a number of customer settings but maybe I am missing something. Any advice would be greatly appreciated. Cheers...",
    "likes": 1,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "video_id": "TAE1QBmVYSI",
    "date": "2022-10-30T22:57:08"
  },
  {
    "text": "I’m looking for an inexpensive machine that will engrave but cut a letter out of wood all the way through. Can you suggest ir Tell me if this one would do that?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw",
    "date": "2022-10-30T10:08:44"
  },
  {
    "text": "With the new Monport 40 watt laser most of you you upgraded is already there now for $657.00 including a CW3000 water cooler and the Lightburn software license.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2022-10-29T23:53:34"
  },
  {
    "text": "I paid $150,000 for a Laguna DLS 3000w fiber laser. You'd be surprised at what a disappointment it is with both support, software, and performance. Actual real good lasers are a half million or more. Bystronic makes amazing 5000w fiber lasers. I've never had a problem with them",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2022-10-28T20:12:22"
  },
  {
    "text": "Thank you for doing these videos. \nI’m wanting to cut round circles at 1/4 mid wood. Any suggestions?",
    "likes": 0,
    "video": "Better and Cheaper than Glowforge?  Gweike Cloud Laser Review",
    "video_id": "jRKfJd3K7Gg",
    "date": "2022-10-28T03:05:33"
  }
]