[
  {
    "text": "The first ad was for an engraving company, so fool thought is was the actual Video, Silly me...lol",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-01T07:13:14"
  },
  {
    "text": "Hi, any desktop laser cutters to cut up to 8mm acrylic plexiglass sheets? can you please guide me.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-10-01T07:13:13"
  },
  {
    "text": "After a lot of research I went the modified K40 route. I upgraded lenses & mirrors, added air assist, amp meter, better temp displays and a better internal and external fan. I also expanded the bed area by cutting down the exhaust shroud. I did run through a major tune-up and alignment to really dial everything in before use. I didn't bother with a chiller, a 5-gallon bucket serves me just fine. I also haven't bothered to upgrade the controller board, the original works just fine for my workflow with K40 Whisperer. I mainly use it for cutting plastic or plywood parts for prototyping rather than engraving, so the stock controller is fine. All in, it easily came in under $800 to have a very versatile machine in my arsenal that I can add and upgrade to later if needed.",
    "likes": 6,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-10-01T00:54:35"
  },
  {
    "text": "I’m interested in starting a small sports labeling/engraving business, mainly engraving basketballs and footballs, and possibly making trophies and awards. What type of laser do you recommend for these applications?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-29T19:31:08"
  },
  {
    "text": "thanks for your excellent videos ! btw, which laser would be strong enough to produce a similar effect like this one here?  https://www.youtube.com/watch?v=iHYBz_dAkpg  thanks and best of luck with your work!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-29T17:19:30"
  },
  {
    "text": "Pretty sure this video just so me my glowforge pro..",
    "likes": 0,
    "video": "Should You Buy a Glowforge?",
    "video_id": "4c4kxlYg-E8",
    "date": "2021-09-29T02:01:04"
  },
  {
    "text": "Would love to see more on the software. How do you create items to be etched or cut? For instance, I want to replicate a paper cutout piece of art I purchased and got ruined. Do you scan that in or how doe sit work?",
    "likes": 1,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-28T20:23:54"
  },
  {
    "text": "Speaking from my heart you shouldnt mention that these machines have a range of 20-100kHz. Open the machine and check the fiberlaser module and you will see it yourself. If its a \"cheap\" Raycus this will eventuelly be a QS-Version (RFL-P20QS blue) with a range of 30-60kHz. This is what the chinese guys sell you as an 20-100kHz. If you use it out of this range the module will fail within months. Btw. even the good cheap china fiberlaser modules on these machines are RFL-P20QE versions with have a range of 20-60kHz. So be prepared.",
    "likes": 33,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-27T23:23:40"
  },
  {
    "text": "No mention of the SparkMaker LaserPro.. Any reason in particular?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-27T20:23:36"
  },
  {
    "text": "You know, when talking about ”Pro” level cutting, we've had good luck with getting used machines through Mitsubishi.  5'x10' cut area, and 4kw will cut up to 1\" carbon steel (O2 assist).",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-27T19:47:52"
  },
  {
    "text": "The exhaust fan should be at the exhaust end of the tube... that way you're never pressurizing the tubes... you're always pulling air into it.  The reason for this is so that you never push smoke out of the ducting... you're always drawing air through any leaks in it.  (It's always a negative pressure, instead of a positive pressure, in the tubes.)",
    "likes": 30,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-27T02:50:51"
  },
  {
    "text": "Hey Make or Break, nice video!  Really good at placing the various options in terms of feature set and capabilities.\n\nI’m specifically looking to cut foamcore (aka foamboard.)  Which has two issues, the paper layers burning and the sandwiched foam melting back leaving concave edges.  Have you ever experimented with this material?  Any advice or recommendations on laser choice?",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-27T00:54:58"
  },
  {
    "text": "Thanks for the review on this and all your other lasers.  I know you said fiber lasers are not for wood, but what about glass?",
    "likes": 2,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-27T00:37:09"
  },
  {
    "text": "Thanks for this!  A GREAT laser primer!!!  (New subscriber!)",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-26T14:12:38"
  },
  {
    "text": "if i wanted to engrave keyboard keycaps what would be my best option?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-26T02:10:57"
  },
  {
    "text": "Everyone seems to think we all run Macs or Windows.  It would be nice to specify when you speak about a product that it will run on these different OSs.  I retired out of the computer industry and have never used a package like Lightburn.  So intuitive and easy to use.  The forum there also has a lot of great people, including the developers.  RDWorks which comes with the Ruida controllers is Windows based and useless for a Linux user.  Lightburn covers the main three, Linux, Windows and Mac, no monthly or yearly fee.  Being a Linux user, proprietary software is not even considered.  Thanks for the video.  First laser was a ss laser for my little cnc machine.  Got me hooked, now have one of the 50 watt (lol) China Blue machines since last mid June.  Great machine.",
    "likes": 3,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-25T17:27:24"
  },
  {
    "text": "great list but many of these can be ordered directly from China for 1/3 to 1/2 the price. Especially the lower end of each tier is usually just a relabel. Glowforge is really anti consumer so I would STRONGLY advise against it.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-25T16:14:52"
  },
  {
    "text": "Hi there, have you tried Neje diodes 40w double laser?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-25T15:07:16"
  },
  {
    "text": "How strange, I was known as Laserpecker by all the ladies way back in my high school days!",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-09-24T23:09:15"
  },
  {
    "text": "Thanks for this video. It was exactly what I was looking for. My new toy is on the way.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-24T12:28:13"
  },
  {
    "text": "What about cutting or engraving on curved surfaces? Your video showed cutting on a pumpkin. How does the machine keep focus on something that is curved?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-24T11:41:49"
  },
  {
    "text": "How much will that whole set up run me if you don’t mind me asking",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser",
    "video_id": "12qsUg0XpTo",
    "date": "2021-09-24T03:20:11"
  },
  {
    "text": "I'm actually surprised that there was no mention of Gravograph/Gravotech. Granted, those machines are on the pro level in terms of features and price point, but I'm still surprised that the name wasn't brought up.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-23T22:03:51"
  },
  {
    "text": "OK I'm old and just getting in to lasers and what they can do when I etch glass I have like holes in the burn the coating I'm using is cold galvanizing compound. What could it be ? glass is cleaned very good but 3 times now this has happened trying to find out why the holes in the letters.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw",
    "date": "2021-09-23T21:35:14"
  },
  {
    "text": "I own the lk5 I love it. Where would I get the stl file for the upgraded fan shroud?",
    "likes": 4,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "video_id": "TAE1QBmVYSI",
    "date": "2021-09-23T18:10:31"
  },
  {
    "text": "hello Brandon, can this laser cut metal like silver 3 mm thick",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-23T16:55:03"
  },
  {
    "text": "Thank you for this channel I feel like I instantly came to the right place! I'm interested in buying a quality laser cutter /engraver that can do 2mm possibly up to 4mm metal what are my options? I know it could be pricy but don't want to buy something I'll outgrow right away",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-09-23T14:51:56"
  },
  {
    "text": "I got one to get into 3d printing. My sttings i must not fully understad. I can print boats all day test prints but as soon as i print a file of my own look out it turns into a wereking ball. I don't get it. Any advice?",
    "likes": 1,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "video_id": "TAE1QBmVYSI",
    "date": "2021-09-23T14:18:26"
  },
  {
    "text": "At 9:19, a screw fell out.  That got an eyebrow raise out of me.  I was wondering if the whole thing was about to come loose and shoot the laser at the camera.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-23T13:38:16"
  },
  {
    "text": "How can you not have bigger epilog on this list? They are like the premier professional laser cutting company if you want the best. The zing is far from pro IMHO it is not really worth buying. I would buy the bigger machine",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-23T02:53:28"
  },
  {
    "text": "very clear, how would thgis work on leather?  small areas. I do leather carving by hand so leather needs to be moist. How would this machine perform on thin (2mm max) leather? Thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-22T20:33:11"
  },
  {
    "text": "Actually my 5w diode laser can cut 4mm plywood but I gotta go real slow with 5 passes or so. But, it works, but it's only suitable for really small stuff. I did some finger joint boxes for CNC router bits, roughly 15x10x10cm box size. Took a few hours but I just left it running so that was fine. Also a bit of cleanup work was necessary to get all parts out.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-09-22T18:28:50"
  },
  {
    "text": "Thank you for this very informative video.  I want to cut 2mm acrylic at various colors.  Does the OM Tech 50W have any limitations on the color of acrylic it can cut?  For example, I noticed that some low-end CO2 laser cutters are unable to cut blue acrylic.  Thanks.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-22T17:42:04"
  },
  {
    "text": "I’ve been looking at the LK4 for a while and I saw someone selling a used one with around 100hours printing time for ~$200usd.  Is that a good price? 🤔",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "video_id": "TAE1QBmVYSI",
    "date": "2021-09-22T16:06:09"
  },
  {
    "text": "Years ago I worked, extensively, with an Epilogue Summit 2000/25. That machine was built in the mid 90s. Back then you connected to it, as a printer, so Epilogue provided a print driver. Being older it had no USB, so it has a parallel printer port connector. But I \"printed\" thru Corel Draw, which would both cut and engrave. The engraving portion, was provided with a simple image file format (.jpg, .png, .bmp, etc), and the cutting with a vector format (.dxf), that I imported into corel, to make the final file, to be engraved & cut out. Is this still an option on modern engravers ? The prices on these new units are hobby affordable, as Epilogue units start around $20K, so not going to happen, unless you're in the business.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-22T14:17:40"
  },
  {
    "text": "9:36 FDA? I didn't realize that the Food and Drug Administration certified lasers.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-09-22T09:22:12"
  },
  {
    "text": "AMazing Brandon - ... Really a Cool Project - The Ice Box Thing - Kept it REAL -......  As it got higher the Sky got a FEEP Darker Blue- The Timeout on the Balloon was amazing - ... and the Jet FLyBy for a 2nd and third Look - was INCREDIBLE-\n\nIm sure 360 Camra Companies will use this Project - Now your CLASS needs to figure out how to Monetise it ... (SMiling)\nWell DONE !",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-09-21T14:42:28"
  },
  {
    "text": "If I want to cut acrylic, twill material for clothing and engrave images into leather and metal, what am I looking to buy?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-21T11:51:25"
  },
  {
    "text": "We have a $30k retail trotec and a similar epilog at our maker space and I would rather have my $3k 60w omtech (rebranded shenhui) laser any day, even without considering price. I have used several laser brands at various maker spaces throughout my career and so far the omtech lasers have come out far ahead. I hope this helps someone make an informed decision. Thank you for high quality, informative video.",
    "likes": 3,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-21T06:30:18"
  },
  {
    "text": "simple and cool table saw jig, that chainsaw joke was actually funny but only because i fully thought you were gunna let that chainsaw fling the scrap 90ft in a random direction lol",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y",
    "date": "2021-09-21T01:45:51"
  },
  {
    "text": "We have an epilog and a universal at our makerspace and the universal has been a far more reliable and capable cutter.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-20T18:01:36"
  },
  {
    "text": "Hey Brother, Great video. Appreciate the time you take to make these videos. Incredibly helpful!",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-20T12:22:48"
  },
  {
    "text": "Need a cheap one currently a college student so not to the point of getting a glowforge or laserbox. Id say the max I could afford is up to 1k which won't really get me anywhere.. I rlly want to start my business tho. I can use the lasercutter at my school but I want my own personal laser for when I go back home during the summer.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-20T05:58:36"
  },
  {
    "text": "Hola, una pregunta loca.... que si ya habeis bajado de la luna???",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-20T03:21:27"
  },
  {
    "text": "6:10 you put the collet on upside down (backwards). =) i'm sure its just something that slipped by editing but for those using this as reference... put the collet into the nut (the text on the collet should be facing the work peace; there's also a little notch inside the nut for pressing collet in and out); screw collet and nut into spindle loosely; and then insert cutting bit into the entire assembly before tightening everything down.",
    "likes": 1,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-09-20T01:17:58"
  },
  {
    "text": "I think it would be safe to add Gravotech to the Pro list.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-19T08:58:28"
  },
  {
    "text": "Shucks you got me interested in the 50W one. Wish you would have gone more into which upgrades are unnecessary on the 50W vs the 40w to get near glow forge. It almost sounds like you don't recommend any upgrades but no biggie more research for me!",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-18T13:15:45"
  },
  {
    "text": "Go make or BREAK (?!!) something in your shop... LOVE IT!  Break (then FIX) is my life!  Awesome idea on the shelves!  I'll have a drill press on one end, and a soldering station on the other (on a portable/removable elevated a metal tray).  Wish me luck!",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Storage for the Shop",
    "video_id": "0N1_P62GMuw",
    "date": "2021-09-18T05:01:17"
  },
  {
    "text": "I would like to see a demo of it engraving on Stainless Steel if you could?",
    "likes": 7,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-09-17T14:57:21"
  },
  {
    "text": "Seems like minimal upgrade as far as performance over our 20w. May just see about getting the laser module if it's not too expensive. For just a little more money you can get a k40 instead of this.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-17T06:15:16"
  },
  {
    "text": "I'm curious whether it could be used to engrave onto a Lego brick (i.e. ABS). Either a piece of text onto a single brick, or maybe even a design engraved across several bricks connected together.",
    "likes": 3,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8",
    "date": "2021-09-16T14:08:46"
  },
  {
    "text": "I work at a custom fab shop, what would be good for 3/8\" plate steel and .125 aluminum? At 4x8' sheet",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-16T03:18:34"
  },
  {
    "text": "Totem S 40W / NEJE Master 2S Max / Atomstack A5 Pro / Ortur Laser Master 2 pro\nI found the four. would like to know which one of the favorites is and which one is best for small knives, normal kitchen knives, silver key rings, zippo, silver engraved bracelet for children. thank you in advance for the help and information I will get. nice day",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-15T23:34:35"
  },
  {
    "text": "Great video.  Gave me all the information I needed to start my research on what I want or what I need for what I want to do.  haha",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-15T19:48:56"
  },
  {
    "text": "Hi there, great informative video thanks.... Will this machine engrave black text on metallic plates and jewellery. cheers",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-15T08:43:00"
  },
  {
    "text": "K40 because it does the job for 500$. Maybe a stronger and fully fledged one is the perfect 2nd laser cutter. Thanks a lot for the video",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-15T00:51:43"
  },
  {
    "text": "Great video and information! Seems like the omtech machines have gone up in price quite a bit since this video haha. It's $480 in the video but on the website it's $680. The old question of risking the eBay k40 vs a \"trusted\" omtech is starting to become more valid again... Oh well I guess this is just the way it goes",
    "likes": 1,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-15T00:13:26"
  },
  {
    "text": "Can you please tell me what laser machine can do very small or micro engravings on metal with high resolution that you can see with a magnifier  . thnx",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-14T11:36:36"
  },
  {
    "text": "Great built!  If you could show rendering that would be great, thank you!",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4",
    "date": "2021-09-13T23:49:37"
  },
  {
    "text": "I enjoy seeing your mistakes and tips on how to avoid them. Thanks for showing the whole process! It is very helpful!",
    "likes": 0,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser",
    "video_id": "12qsUg0XpTo",
    "date": "2021-09-13T23:39:27"
  },
  {
    "text": "Good review and lots of great information.  I had a little Elksmaker diode laser and realized it could burn wood and leather.  I switched to 3D printing and that opened a new world.  I still follow lasers, but if I got back into it want something that could cut and engrave metal.  Your channel helps get me up to date, but the prices are a lot more than a 3D printer that can really do something right out of the box.",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-13T23:30:22"
  },
  {
    "text": "Where can I get the omtech 50w laser. There are so many versions of it on eBay. Will you please provide a link to the one you recommend. Thanks!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-13T15:37:34"
  },
  {
    "text": "You can do it for half that amount, ( https://www.youtube.com/watch?v=iL3WUZiQriE&t=665s) the ones I convert run lightburn off CNC shield V3 and Uno which uses GRBL in PWM Spindle with a simple one transistor two resistors not gate circuit to have the capacity to control the power of the laser in software. the total cost of upgrades I do is around 600$ Canadian dollars TOTAL.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-13T15:01:04"
  },
  {
    "text": "nice video until you \"trashed it\" with that stupid music",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY",
    "date": "2021-09-13T09:23:47"
  },
  {
    "text": "Very informative - I got an Elks maker laser engraver years ago and purchased 3rd party software.  I soon realized that I could only burn so much wood or leather and made the switch to 3D printing",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-13T03:20:02"
  },
  {
    "text": "OptLaser 15W for 800$ ??!! Sorry but you made a huge error on price... go check the price of the 15W on their website",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-13T02:28:04"
  },
  {
    "text": "So much info, great video. Thank you for taking the time to create this amazing summary.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-12T19:41:33"
  },
  {
    "text": "Nice video,  but your description of co2 vs fiber is completely wrong.  You described a galvo vs xy laser. Both co2 and fiber support galvo and xy, depending on its use case.",
    "likes": 4,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-12T13:00:20"
  },
  {
    "text": "Is there a budget laser that's best for polymer and plastics. Like magazines for guns and grips for guns",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-12T12:44:28"
  },
  {
    "text": "The other thing you can do when you make it like that is stain the various pieces different colours and then glue it up.  Then it looks like different kinds of wood in the block.",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU",
    "date": "2021-09-12T06:49:02"
  },
  {
    "text": "First time viewer and immediately subscribed.  I learned a lot - thank you 👍😎👍",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-12T03:38:06"
  },
  {
    "text": "So best laser around 2k$. That I can use for firearm engraving and stippling.. but also for plastic, leather, cups etc. ?????",
    "likes": 2,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-09-12T01:24:34"
  },
  {
    "text": "Thks, you're right too much trouble.\nOh nice white balance in the video.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-11T22:34:44"
  },
  {
    "text": "Hi, I’m looking for a laser where you can scan an image really good and cut out the image.\nOnly needs to cut paper or card, ty",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-11T21:49:19"
  },
  {
    "text": "Can 3mm acrylic sheet be cut via diode laser such as orthur machine?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-11T21:05:39"
  },
  {
    "text": "Thk-you, thk-you, thk-you, thk-you, thk-you, ........................ ∞xthk-you; for raising above the geek details & endless jargon.  Very few can/will.\r\nI’m a retired physicist & just want a laser engraver/cutter as a professional hobby.  ?Would I probably regret DIYing a CO2 laser engraver/cutter? \r\n         For example https://www.youtube.com/watch?v=5zpbXpHWSB0&t=31s \r\nEven if I make the perfect DIY CO2 laser engraver/cutter to brag about, ?Will software application suite compatibility screw-me over anyway?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-11T17:12:42"
  },
  {
    "text": "If they gave you the machine..then they gave you 7k to do a review which makes you working for glowforge. Cut the bullshit.  And you left out what your kickback is.  It's $500.  Yes, you get $500 every time someone clicks your link and buys a slowforge.  Come one man...seriously?",
    "likes": 0,
    "video": "Should You Buy a Glowforge?",
    "video_id": "4c4kxlYg-E8",
    "date": "2021-09-11T15:18:01"
  },
  {
    "text": "Sorry you have to be an idiot to buy a glowforge. Nobody should ever buy a glowforge. Anybody that recommends a glowforge is somebody that you should not listen to. I know it's popular but listen, any day they can say your laser is dead and it stops working instantly. They go under your laser stops working instantly. They get hacked your laser burns down your house. You lose internet for any reason you have a brick until you get service restored. They will someday say we want a monthly fee for you to use your laser, you will have no choice but to pay. That is the only reason for their design choice of no offline usage, you will be forced sooner than later to pay a monthly subscription to use your machine. Anybody who says different is a liar. Friend don't let friends buy a glowforge. Loved the video by the way. Keep up the good work",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-11T01:18:44"
  },
  {
    "text": "Hi whats the smallest logo it can burn, for eg how small could I make the windows logo..",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-10T16:11:21"
  },
  {
    "text": "Great review. I need an engraver but I have fire strikers as part of a flint fire starter kit. I blue the steel. So I'm wondering what result this machine would give? Also, can it engrave glass?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-10T15:53:28"
  },
  {
    "text": "$4k plus doesn’t feel like “ a hobby” machine to me. Cool machine, but hardly something you’d pick up for shits and giggles. I think the Beamo at $2k would more hobby friendly.",
    "likes": 4,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?",
    "video_id": "Cls3-R8BoEs",
    "date": "2021-09-10T14:11:45"
  },
  {
    "text": "This was a very helpful video and very well put together. Thank you \n.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-10T13:40:23"
  },
  {
    "text": "If you have the space buying a Omtech 50w to 80w and adding a camera using lightburn software will out perform Glowforge at a cheaper price point..  minimal upgrade just add a camera.  plus larger work area and ability to use thicker material. Omtech Rocks.  I own one and love it.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-10T12:15:58"
  },
  {
    "text": "Nobody noticed the screw that fell out of the beamo while it's engraving?",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-09T23:55:19"
  },
  {
    "text": "What's the min. requirements for a laptop to run Lightburn on a Ortur LM2 Pro",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-09T23:44:21"
  },
  {
    "text": "Can a diode laser \"engrave\" powder-coated metal?  It doesn't need to cut a groove per se but more like altering the color of the coating.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-09T21:59:47"
  },
  {
    "text": "I just tunned into your channel and it is very informative. I am on the virge to buy what is called a mixed laser. It pretty much is a CO2 laser coupled with oxigen in order to cut metal. They are telling me that it is also called hybrid cutting machine. Do you know any thing about these types of machines?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-09T19:34:04"
  },
  {
    "text": "Thanks for this video am very new and this is my 1st time to buy a laser cutter. this is the 1st video that explains those power button please my question is the 3 ➕ and minus ➖ buttons only for the power?  and can i set directly from 40k whisperer software?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-09-09T18:27:04"
  },
  {
    "text": "2:00 wtf? That looks like a glitch to me.  You had the wood cut out around the sink and suddenly it pops out from the edge and connects itself where you did not have it connected.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88",
    "date": "2021-09-09T18:16:02"
  },
  {
    "text": "I'm so glad I stumbled upon this video!  I the noobiest noob and I want to begin a creative career using one of these machines.  I appreciate the time you took to build your spreadsheet as that was a bullet point on my to-do list.\nI'd welcome any advice from you and all other makers regarding anything laser and business.  (I'm an apartment dweller and would be venting my machine out a window.)",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-09T15:43:40"
  },
  {
    "text": "Hi, I may have missed it but how is this for engraving cylindrical parts?",
    "likes": 1,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-09T10:53:09"
  },
  {
    "text": "WHave you any experience with Neje they have an 80w laser at this moment",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-09T09:57:14"
  },
  {
    "text": "New subscriber here. I have recently bought an Atomstack A5 pro to use primarily for wood engraving and also for cutting templates for hand routing out of 3mm plywood.Am using LightBurn  software which is brilliant. I would be really interested in what you think of yours when you get it. Am I correct in thinking that Airassist isnt worth having on a low power laser as the chances of setting fire to something is minimal?",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-09T08:03:15"
  },
  {
    "text": "I'm looking to cut cardboard... would this or something else would do the job?",
    "likes": 0,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8",
    "date": "2021-09-09T02:01:02"
  },
  {
    "text": "Hi, can you recommend me a laser engraver for urns that are mode of brass metal. What we will be engraving is just the names or may be picture of a pet. Thanks",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-09-09T01:48:31"
  },
  {
    "text": "I have an Ortur LM2, two Jtech 7w's for my CNC's, and just got an OMTech 60w for batch work :)",
    "likes": 3,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-08T22:20:06"
  },
  {
    "text": "is it good for a fake / pu leather engraving? does it have to be a perfectly flat surface or it`s ok to engrave on the curved/round as well?",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser",
    "video_id": "GjfWcQidYLM",
    "date": "2021-09-08T22:19:58"
  },
  {
    "text": "They want you to spend 5000$ after tax and possible add-ons, yet it only comes with a 6 month warranty. A lot of faith in your product.",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?",
    "video_id": "Cls3-R8BoEs",
    "date": "2021-09-08T20:09:59"
  },
  {
    "text": "Do you think that chinese laser would engrave acrylic lets say like a quarter , meaning that kind of depth or contour? We could even call it the 25cent engraving if you will, thanks for any input.",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU",
    "date": "2021-09-08T17:53:05"
  },
  {
    "text": "Did the unit at 9:20 chuck a screw on the workpiece?  What is that?",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-08T17:17:37"
  },
  {
    "text": "Hey Brandon, great info and stuff to consider..your channel is a good help. Wondering if you have seen or heard anything of the GWEIKE cloud yet? looks like a glowforge copy but hard to get any impartial views as yet.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-08T16:03:41"
  },
  {
    "text": "Curious what the quality of a beamo 30W laser would be with say cutting acrylic & engraving",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-08T06:35:41"
  },
  {
    "text": "When it comes to software, it's also worth pointing out which ones rely on online services. I know you said \"web based\", but not everyone quite gets what that means. Having been screwed by a company going out of business, turning my 3d printer into a brick, I will never buy tools like these that require an online service (as opposed to web-based software served up from the tool, like most routers). For the price of something like the glowforge, I'd want to ensure I could use it for as long as I decide to.\n\nProprietary software (that they eventually stop updating) is another no-no, but at least you can work around that by keeping a frozen PC around for the life of the tool. No way to work around a service requirement, though.",
    "likes": 77,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-08T00:24:30"
  },
  {
    "text": "Can you use fiber lasers to cut wood?  Or is there a laser unit wherein you can adjust the laser wavelength and not have to buy two lasers.",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-07T20:28:30"
  },
  {
    "text": "I would be interested to see a comparison of the LM2pro with the Atomstack 50w. I have some serious doubts on the longevity of such high power laser diode without quality air cooling.  Thanks for the great episode 😊",
    "likes": 1,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-07T19:22:58"
  },
  {
    "text": "I love the fact that Brandon means burning stuff in French. As in Firebrand or branding cattle. Cool association...😎",
    "likes": 5,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-07T16:48:36"
  },
  {
    "text": "Hi Brandon there is a laser that is blowing up on Facebook. It’s called the Yorahome 6550 diode laser. They claim that there’s is up to 40 W compared to the Ortur LaserPro. Have you thought about considering this one? Is it not worth the money? What are your thoughts please",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-07T16:26:12"
  },
  {
    "text": "Another amazing episode! You know your stuff Brandon, thanks for sharing. You're a rockstar dude!",
    "likes": 17,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s",
    "date": "2021-09-07T15:50:55"
  },
  {
    "text": "Hey,\nNice video.\nAre this device able to engrave/mark glass at around 100 micrometers (0.1mm)?\nCheers",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-07T13:10:36"
  },
  {
    "text": "Can this cut 3mm acrylic or plywood, does the laser has good power",
    "likes": 0,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look",
    "video_id": "fa7JugG_6-g",
    "date": "2021-09-06T03:38:00"
  },
  {
    "text": "Great rundown. I bought my K-40 about 2 years ago and did all of the mods. Loved it, but wanted a bigger work area and bought a 60 watt \"Red and black\" unit from ebay for around $3000 and have never looked back. The only thing I had to add was a ma meter. I gave my K-40 to my daughter and she is having a lot of fun with it. Great review, thanks for the info.",
    "likes": 2,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-09-05T17:04:46"
  },
  {
    "text": "What in your opinion is the best for etching/engraving glass?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-04T18:31:18"
  },
  {
    "text": "Where/how can I get that power/speed & power/freq file?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE",
    "date": "2021-09-04T14:55:20"
  },
  {
    "text": "Can this be a good engrave for small aluminum parts",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU",
    "date": "2021-09-03T21:49:25"
  },
  {
    "text": "Please NEVER delete this video!!! IT'S SO FUN TO WATCH!!!!!! :) :) :) :)",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-09-03T21:14:42"
  },
  {
    "text": "HOW DID I MISS THIS??? I have the same kind of bench, and I am making these TODAY! Thank you",
    "likes": 2,
    "video": "How to organize a Messy Drawer with a Laser Cutter",
    "video_id": "F5rxP_uGSrU",
    "date": "2021-09-03T16:53:50"
  },
  {
    "text": "Thanks for the great review! I'm thinking of getting one of these to step up my foam crafting hobby... Do you know if this machine can engrave and possibly cut XPS or Styrodur foam? Cheers!",
    "likes": 2,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-03T07:21:38"
  },
  {
    "text": "Laser master 2pro is currently the most accurate laser engraving machine",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-03T06:34:17"
  },
  {
    "text": "Now lets see...\nLooka flat 2 me..\nU kno why\nHe made the firmament to seperate \nThe wateea above\nFrom\nThe waters below\n\nThen lucifer FELL FROM THE HEAVENS UPON EARTH AND 1/3 OF HEAVENS ANGELS FELL AS WELL...\nso FUCK NASA",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-09-02T21:23:17"
  },
  {
    "text": "Mine worked great for a few months, then the servomechanisms crapped out. You get what you pay for.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4",
    "date": "2021-09-02T17:43:09"
  },
  {
    "text": "Is there any chance to cut 8mm thick plywood with this?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc",
    "date": "2021-09-02T14:36:48"
  },
  {
    "text": "Where can I get the ortur laser engraver. Kindly share the link to buy these",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s",
    "date": "2021-09-02T06:47:04"
  },
  {
    "text": "At 1:53:37 at one of the sides of the ballon is a purple light going back and forth. Its probably light reflecting from the lenses but still looks cool.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4",
    "date": "2021-09-02T06:04:51"
  },
  {
    "text": "Hanzhen harmonic drive gear ,  robot arm gear ,  over  30 years experience  ,,",
    "likes": 0,
    "video": "A Robot Laser Arm??!! - Rotrics DexArm First Look",
    "video_id": "fa7JugG_6-g",
    "date": "2021-09-01T01:39:31"
  },
  {
    "text": "A comparison like this is how I got away from the K40 and to a 50W larger laser. I'm so glad to have that since the z height has been great to do larger items, my roller, etc. I did similar math and am very glad I skipped the K40.",
    "likes": 4,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs",
    "date": "2021-08-31T17:22:45"
  }
]