{
  "videoCommentCounts": {
    "What is the Best Laser Cutter and Engraver for You?": 47,
    "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review": 19,
    "Did I Waste $1500 on a 50W Laser Cutter from China?": 12,
    "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review": 38,
    "Fusion 360 - Did Autodesk just kill the FREE Version?": 24,
    "I Sent Baby Yoda to Space (sort of....)": 1,
    "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review": 16,
    "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review": 8,
    "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)": 11,
    "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review": 10,
    "The Makeblock Laserbox - Is this the Laser Cutter You've Been Waiting For?": 9,
    "Is Fusion 360 worth learning over Sketchup?": 7,
    "Welded DIY Metal Bed, This is What I MESSED Up": 1,
    "Can I Stain a Maple Butcher Block Countertop?": 1,
    "How to make Dovetail Joints in Fusion 360 - Woodworking Joints": 3,
    "Designing Furniture with Fusion 360 for Absolute Beginners!": 3,
    "Does a $200 Laser Engraver Make Sense in Your Shop?": 5,
    "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review": 3,
    "Turn Real Things into 3D Models with Photogrammetry": 7,
    "Testing the OM Tech K40 Laser": 8,
    "Custom Farmhouse Sink, Dials and Oven Top for a Play Kitchen // DIY": 1,
    "Build a Baby Gate (for cheap) // DIY Woodworking": 1,
    "Why are custom laser cut maps so hard to make?": 2,
    "3 Ways to Make Wooden Shims (DIY Wedges)": 1,
    "How to Make a Kids Play Kitchen: The Frame/Doors/Drawers!": 1,
    "Unboxing and First Tests of the OM Tech 40W CO2 Laser": 1,
    "How to Make a Cedar Window Planter Box": 2,
    "Laser Cutting Eleven's Head From Stranger Things (DIY Lightbox)": 1,
    "How to Make a Butcher Block Countertop // DIY Woodworking": 2,
    "Building a Modular Paint Organization System": 1,
    "How to Make a Wooden Mallet // THOR Hammer!": 1,
    "Making the Ultimate 3D Carved Sign from Disney's Haunted Mansion": 1,
    "6 Mistakes Not to Make When Building a Farmhouse Table": 2
  },
  "videoTopicMapping": {},
  "patternFrequency": {
    "goals": {},
    "pains": {},
    "questions": {},
    "identityMarkers": {},
    "technicalTerms": {}
  },
  "emergingThemes": [],
  "batchProgress": {
    "analyzed": 1,
    "totalBatches": 30
  }
}