[
  {
    "comment_id": "UgyMjKViEfEb_bQU91t4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Could this sort of laser engraving device be used to engrave words onto plastic wall switch plates, to label what each switch does?",
    "author_name": "@frederickwilt5541",
    "published_at": "2024-05-02T17:24:30",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugxg0GgLYFVTk5H3Ghp4AaABAg",
    "video_id": "09SMj_jGjGw",
    "video_title": "Great Deal or Overpriced Hype? - Carvera Air CNC",
    "comment_text": "Am I the only one who finds it super annoying the way this guys talks. When......he......talks.....about......the......machine...........like........this........its.....hard...to....focus........on....what........hes.....saying....because....it.....sounds.....like......hes......having.....a..........seizure. If you could just speak at a normal pace that would be swell. I literally cant make it more than 5 minutes through your videos for how incredibly distracting and annoying it is.",
    "author_name": "@atherisgreen1391",
    "published_at": "2024-05-02T07:15:04",
    "like_count": 4,
    "reply_count": 5
  },
  {
    "comment_id": "Ugwh7R5JXNMu9cSWHQB4AaABAg",
    "video_id": "09SMj_jGjGw",
    "video_title": "Great Deal or Overpriced Hype? - Carvera Air CNC",
    "comment_text": "I'm curious how it compares to the Milo CNC or the upcoming ones from Voron & RatRig?",
    "author_name": "@ImplicitConversion",
    "published_at": "2024-05-02T02:38:37",
    "like_count": 2,
    "reply_count": 4
  },
  {
    "comment_id": "Ugx1UuCEKDwHfA_DoKl4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "Hi there! I’m considering getting either the Xtool F1 or the Xtool D1 10W. The price of the F1 is my main concern, but I do want to engrave high quality images. Have you ever done a comparison of the resolution you can get engraving with both? As they both have 10W lasers I was wondering if the D1 could actually do as good a job?",
    "author_name": "@jonnygiles7457",
    "published_at": "2024-05-01T22:53:17",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzPakMxiTkK1lc6Rq14AaABAg",
    "video_id": "09SMj_jGjGw",
    "video_title": "Great Deal or Overpriced Hype? - Carvera Air CNC",
    "comment_text": "I've backed this on KS mostly because it interests me. I've never done any CNC but have several 3D printers. I would note that the shipping costs seem to remove a lot of the benefits of KS. I think that's something you could mention. They're currently estimating $350. The Carvera has 'free' shipping on their website so the later price of the air may come with that also.",
    "author_name": "@GuyH77",
    "published_at": "2024-05-01T22:22:55",
    "like_count": 3,
    "reply_count": 2
  },
  {
    "comment_id": "UgxMrsKbRNebfHHSHch4AaABAg",
    "video_id": "09SMj_jGjGw",
    "video_title": "Great Deal or Overpriced Hype? - Carvera Air CNC",
    "comment_text": "Does the Kickstarter price really include the laser and/or rotary tool?",
    "author_name": "@v4lgrind",
    "published_at": "2024-05-01T19:18:51",
    "like_count": 2,
    "reply_count": 4
  },
  {
    "comment_id": "UgxGSorE2YD3Sf3oOBN4AaABAg",
    "video_id": "09SMj_jGjGw",
    "video_title": "Great Deal or Overpriced Hype? - Carvera Air CNC",
    "comment_text": "200w spindle,  linear rods, etc.. stay away from this pice of trash, if you plan to acsually cut metal",
    "author_name": "@Basement_CNC",
    "published_at": "2024-05-01T18:55:08",
    "like_count": 2,
    "reply_count": 3
  },
  {
    "comment_id": "UgxjKIR-4z-ppQyEZQR4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Does anyone have one of these as I have a question please, the falcon 2 has a button on the top of the module to switch the laser from 40w to 20w for a smaller beam to engrave, does the falcon 2 pro have the same feature ? I can see in the video it has the button on the top but no review I have watched mentions it, Many thanks",
    "author_name": "@bookdealer8933",
    "published_at": "2024-04-30T07:03:02",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzF_mlEvBnS8BBN60Z4AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "Get a few of those comments my self. Usually just grumpy people who think we lie for a living not realising how much time and effort go into these videos. Keep up the good work, I love your channel",
    "author_name": "@JamesDeanDesigns",
    "published_at": "2024-04-28T21:25:40",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgyBKmoVunSNy5u39ah4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "How would you edit the spreadsheet for making multiple identical items? i can get 50 key rings out of a single sheet of Perspex but cant work out how to edit the spread sheet for this. Could you do an updated calculator?",
    "author_name": "@roydickens9286",
    "published_at": "2024-04-27T16:22:14",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxB7xhLFFSX6LzTrSx4AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "Have an Ikier K1 pro 48. Decent enough laser. Laser head is heavy enough that using at full capable speeds can accelerate maintenance timelines.",
    "author_name": "@jimmiller2270",
    "published_at": "2024-04-26T20:19:02",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwNLLs87NKT7z5NYjp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Awesome video! Have been on the fence about which engraver/cutter to get and have been leaning towards the Falcon Pro 2 as I love Creality's 3d printers. Very helpful!",
    "author_name": "@xXPhanillaXx",
    "published_at": "2024-04-26T17:51:50",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwRJrS4xJ40FG1NaZ14AaABAg",
    "video_id": "Y-OU0yaD62w",
    "video_title": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "comment_text": "four pages of written notes later, im feeling a bit more confident with this program. thanks man!",
    "author_name": "@chrisgenovese8188",
    "published_at": "2024-04-26T17:46:12",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgyGE-zudiI9A0Rnqb54AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "please consider a video or test with board foam cutting. The remote control hobby that uses board foam would love to know the options for laser cutters with board foam.Thanks",
    "author_name": "@alexherrera3918",
    "published_at": "2024-04-26T13:00:45",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgyfaeWwF_63SsxRT-B4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I am just not sold on Chinese lasers with glass tubes. They are not reliable when it comes to power and electronics. Regardless, of what you do to them, servo motors, fixed alignment racks, tech support etc. All glass tubes C02 lasers are inferior to Epilog, Trotec, Universal and Kern lasers. Compare them side by side with engraving and observe the results.",
    "author_name": "@FrostedImages",
    "published_at": "2024-04-26T12:17:04",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwpUbtQkwsznwh4eoh4AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "Your thoughts on the Roly Lasermatic solidified my choice. It's works like a dream brudder. Thanks again!",
    "author_name": "@ShelbyWeatherbee",
    "published_at": "2024-04-26T03:37:52",
    "like_count": 4,
    "reply_count": 1
  },
  {
    "comment_id": "UgzGI_MH307okay2Cd54AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "I have an ortur laser master 2 that was my first laser. Seval upgrades. Then i purchase an OMTech Polar 50w which worked good for 11months and now needs replacing has developed a slew of issues. Im going Thunder next. I need reliability and support.",
    "author_name": "@IIIofV",
    "published_at": "2024-04-26T02:01:33",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzyXe2MN6dtPcJ_g7x4AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "I don't have a laser (yet), but I keep looking at the NEJE MAX 4 with air assist and honeycomb platform.  Reason is work area is large enough at 29.52” x 18.11 but the frame will fit on a 2'x4' table that I call roll outside the garage to use.  Thicket stuff I want to cut is 1/4\" MDF so I've been watching your videos to get an idea of what I need/want in a laser.",
    "author_name": "@Hugocraft",
    "published_at": "2024-04-26T00:12:02",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy-hxoI_6T911Y1N_x4AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "Filled the form in, I have a 100w no name, had a 50w no name, and a K40, as well as a outur master, and 2 f1's from xtool oh and a creality pheanananador (or how ever thats spelt) thats still waiting for me to have room at the laser workshop",
    "author_name": "@derekwright2388",
    "published_at": "2024-04-25T23:39:04",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwxfFRbQtFqHT0KBlF4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I clicked on the link to see how much these are going to cost, since as of right now it is only a pre-order. There were a lot of ways to contact them to have them get back to you, but no way to actually find out the price without them having your contact info and being able to possibly spam you with sales calls. Maybe I'm the only one, but that makes this a non-starter for me. I used to teach laser cutting at a maker space on a $75,000 laser cutter (I did not own it), so I know they can get up there, and I'm sure this one is no where near that. But, I'm not going to jump through hoops to find out.\n\nSome people will say, \"Well, if you have to ask, you can't afford it.\" Except that if you are a small shop, and have a budget, it is actually possible that you could afford it, and you would like to know so you can set aside the money,.......   \n\nIt's more like, \"If your potential customer has to ask, then you probably shouldn't be hiding it.\"",
    "author_name": "@LincolnWorld",
    "published_at": "2024-04-25T22:49:27",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgzMDMLsmhM055ML_d54AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "Thank you for tackling what could be a thorny subject. Personally I always love to listen to reviewers' takes on the machines and I usually form some opinion using an aggregate of reviews. And even this only forms part of my overall opinion. Reviews are great but they never take the place of doing your own hard research. And you have to accept that MOST of these lasers are built in part or in whole in China where the quality is not always consistent. So no matter what you do you may end up with a bad sample of an otherwise good laser. I am much more concerned about the company I am buying from and their customer service than the actual laser itself 99% of the time.\n\nBut that being said I do thing the reviews have value as long as nobody doing them tries to hide the fact that they received the laser for free for review. Honesty and openness are the requirement for these reviews to have any merit. You have never given me any reason to think you are otherwise so I love following your channel.",
    "author_name": "@jackhelm9852",
    "published_at": "2024-04-25T22:10:28",
    "like_count": 4,
    "reply_count": 0
  },
  {
    "comment_id": "UgyCc5KKBcL_cXvYwCp4AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "P2 (still in the box while we wait for our new house to be finished), Glowforge (good comparison?) and the F1",
    "author_name": "@tonystobb8364",
    "published_at": "2024-04-25T22:03:20",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyHpG9KVdaAXSuYq354AaABAg",
    "video_id": "GDMetcDuzsI",
    "video_title": "Can You Trust Product Reviews?",
    "comment_text": "I bought an Orion Motor Tech (omtech) 50w a few years back and it has never worked right from day one, had a bad tube they refused to replace, i requested a discount on a new one and they refused also, many of the screws were not tapped right or stripped, power supply died, the controller has intermittent issues, honestly it was a complete lemon and the \"warranty\" was useless.",
    "author_name": "@spikey911usa",
    "published_at": "2024-04-25T21:37:58",
    "like_count": 4,
    "reply_count": 0
  },
  {
    "comment_id": "UgxX5xL0SxdYrfT_yJ94AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I watch you regularly, and expected that your knowledge level would be a bit higher. First, she talks about the speed. Owning an Epilog Fusion Pro, I know something about speed. At top speed and max output power, you are hardly leaving a mark on wood. So, the speed argument is a little dumb. The accordions on the side of the gantry to protect the internals of the machine is something Epilog has had for years. The idea that somehow, the autofocus built-in to the lens carriage is something new is also wrong. Epilog, Trotec, and honestly several others I can think of have been doing that for years. Servo motors? Welcome to 2020. Let's talk resolution. 1000 DPI, is nowhere near class-leading. She talks about how happy she is about how rigid they are, being built of steel. Why did they add several hundred pounds to the machine by cheapening out with steel when they should have gone with military grade aluminum. I notice that my Epilog is under 300 pounds while the Aeon with the same bed size is 550 pounds. Some of them go up to 1,500 pounds. She talks about being able to change frequency, well I am not certain, but I think several companies have had that for years. I know I can change that on mine. The drop-in water cooled tube that doesn't change alignment is cool, bravo on that point! Even if you could buy one, (many people can not get a regular Mira for months) some interviews have said their Signature series (the only one that can boast all of this speed and ceramic RF core) is not even on the horizon for 4 to 6 months. Last thing is price. Who in the name of all that is holy is going to pay Epilog prices for a Chinese machine? I think it is just a reverse engineered Epilog or Trotec. There was a time when I would have looked at an Aeon or Thunder, but they were just too slow for my production needs. And please, add an LCD screen! What a strange place to try to save a buck, the one thing you will touch EVERY SINGLE TIME YOU USE THE LASER!",
    "author_name": "@jasonbliley6429",
    "published_at": "2024-04-25T19:33:36",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "Ugz3Po4M0p5D3wEzGjp4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "Have you ever seen or know of anyone who has the AP lazer?  When I was looking at buying one was really intrigued by this company and even went and talked to a local person who owns two of them.  She raved about the customer service said it was 24/7 and all in the states.  She told me she was working on a job and called at 2 am and a person answered and even set up her project for her.  She said she rather have them tell her how so she knows for next time.  The reason why I didn't buy one was the one I wanted was 35K.  Lol So I went with the Xtool D1 Pro 20w and now I have 2 of them.",
    "author_name": "@paulveenstra6305",
    "published_at": "2024-04-25T16:13:05",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzWrIo0hGa_WRjVTp54AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "Waaaaaaay too expensive, for that money I can make a 2KW diy fiber laser that does 10mm steel. But ok different application altogether.",
    "author_name": "@xConundrumx",
    "published_at": "2024-04-25T16:03:01",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxFhZakMlkZfxxpm6h4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I have a small awards and engraving business and I am looking for a good laser for under $5000 to start would need to engrave brass aluminum glass acrylic leather  wood silver and gold. Also a rotary feature Any insight or unit to start with",
    "author_name": "@lionsjewelryedc1794",
    "published_at": "2024-04-25T15:48:15",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwplKzgPrhiu8ZN7Q14AaABAg",
    "video_id": "S3TneioSp9I",
    "video_title": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "comment_text": "Most of my projects are of wood. How would I engrave the center of a 12\" or 16\" wood bowl with my logo and signature. Doesn't look like it would work for my wood bowl needs. Good review BTW  :)",
    "author_name": "@scottparat",
    "published_at": "2024-04-25T06:29:55",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgySLokGACAm-4vAu1J4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "when are they gonna start replacing the old lcds on these laser machines? For god sakes it’s 2024.",
    "author_name": "@dannyboycalifornia",
    "published_at": "2024-04-24T23:49:05",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugznzb-W6PPVULAzxTB4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Does the enclosure prevent the use of a rotary equipment to engrave on cylindrical object? The open-air frame seems easier to raise upwards to create enough space for the rotary and the glass/cup/mug item.",
    "author_name": "@irlsolidspace",
    "published_at": "2024-04-24T10:47:28",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgysuUeW-9Rqm0PS6rJ4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "You lost me when you claimed that 5000/1200mm/s is nearly 5 times... this is just a hidden advertisement",
    "author_name": "@rondlh20",
    "published_at": "2024-04-24T06:45:54",
    "like_count": 1,
    "reply_count": 4
  },
  {
    "comment_id": "UgzgxE7Xgx8bwLfBZQt4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I was there on the last day and had been to their booth.. WAY too busy so I kept going on . Their lasers did look intimidating. I need to Dedicate 2days next year. I had forgotten how big the were since its been a few years since my last one. Also didn't know they were neighbors of mine. Im in Palmbay  the city just south of Melbourne :) Guess I should have popped open their brochure since I snagged one.",
    "author_name": "@SuperMouseDV",
    "published_at": "2024-04-24T04:38:54",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwfiS5I6WTHiHE9TA94AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "When does it arrive, they quoted me 4-6 months which was confusing",
    "author_name": "@henryoppermann134",
    "published_at": "2024-04-24T02:56:21",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzlmKXnVKiK8sfzYRV4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I tried to buy one but I can't wait 3-6 months. Businesses that buy these kinds of lasers probably need the machines asap or they lose money. These redlines probably won't be out for another year. Looks pretty and all sounds nice, but will hold off until they can redline their shipping timeline.",
    "author_name": "@skallinator",
    "published_at": "2024-04-23T22:35:25",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "UgzohEvS-G4BqlMAiSF4AaABAg",
    "video_id": "FKMfPaY8zVY",
    "video_title": "This is the World's Fastest Laser",
    "comment_text": "I’ve always wanted to try out one of their lasers in person. I’ve heard lots of good stuff about them and have seen at some sign show in dallas before i really got into lasers a few years ago.",
    "author_name": "@Jeffdoeswhat",
    "published_at": "2024-04-23T20:22:16",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxdybjYsji5T6MxrfZ4AaABAg",
    "video_id": "cveCdHiOy_A",
    "video_title": "I Made This Book Nook With A Laser, Can You Tell?",
    "comment_text": "Hi Brandon! Ive been watching your videos on what laser engraver to purchase and was wondering if you could recommend me the right one for the products I’ll be producing. I have a clothing brand which offers soft goods, hats and military patches etc. I’ve been outsourcing leather patches but I want to start to purchase what it takes to cut the middle men out. Id really like to get an engraver that could work well with leather for patches and also have the capability to engrave on metal like gun magazines etc. Any recommendations would be greatly appreciated and feel free to send me affiliate links- thanks!",
    "author_name": "@cody8620",
    "published_at": "2024-04-23T19:06:24",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwa2jkSRZvTVeKjEQh4AaABAg",
    "video_id": "cveCdHiOy_A",
    "video_title": "I Made This Book Nook With A Laser, Can You Tell?",
    "comment_text": "Sweet build - super cool tip on programming an arduino with chatgpt, I had no idea that was a thing.",
    "author_name": "@chalkwatts",
    "published_at": "2024-04-23T01:46:29",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "Ugx7zXEU50um8Bac4Gt4AaABAg",
    "video_id": "KYGUPqJ2bL4",
    "video_title": "How to Make a Cedar Window Planter Box",
    "comment_text": "I like your style. Only thing I would change - don’t poly the box. The beauty of cedar is the silvery finish you get when it weathers.",
    "author_name": "@mhansl",
    "published_at": "2024-04-23T00:34:53",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz6_RgdckSCLPpoxop4AaABAg",
    "video_id": "cveCdHiOy_A",
    "video_title": "I Made This Book Nook With A Laser, Can You Tell?",
    "comment_text": "Cool project. An Arduino Nano would be a functionally equivalent but much cheaper alternative to sticking an Uno on the back.",
    "author_name": "@GeekRedux",
    "published_at": "2024-04-22T21:14:05",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgzfenT3IsfvqcKku8J4AaABAg",
    "video_id": "cveCdHiOy_A",
    "video_title": "I Made This Book Nook With A Laser, Can You Tell?",
    "comment_text": "I have been planning to to make something exactly like this for my wife who is a big book worm and Harry Potter fan. Thanks for sharing your video and sources.",
    "author_name": "@johndoe6032",
    "published_at": "2024-04-22T16:51:47",
    "like_count": 2,
    "reply_count": 2
  },
  {
    "comment_id": "Ugw8ZoIJ1-pRiKsKzI14AaABAg",
    "video_id": "cveCdHiOy_A",
    "video_title": "I Made This Book Nook With A Laser, Can You Tell?",
    "comment_text": "To be fair you haven’t posted a lot of videos of you breaking things either. 😂",
    "author_name": "@radish6691",
    "published_at": "2024-04-22T15:38:15",
    "like_count": 5,
    "reply_count": 0
  },
  {
    "comment_id": "UgzsNzgKhdxTwbSfusV4AaABAg",
    "video_id": "cveCdHiOy_A",
    "video_title": "I Made This Book Nook With A Laser, Can You Tell?",
    "comment_text": "Nice build, a laser cut book nook is definitely on the list of future projects.",
    "author_name": "@danthemakerman",
    "published_at": "2024-04-22T14:42:12",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "Ugw8AvAXNUmsbLK5VwB4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Just got my hands on the ORTUR Laser Master 2! Can't wait to explore its capabilities 🤩 #laserengraving",
    "author_name": "@AmipazlimazJak",
    "published_at": "2024-04-22T09:03:27",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgxsHza5WLNaDkHMFmt4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "There are two classes of enclosed diode lasers: craft and hobby.\nIn the craft class, I'm curious why you decided to include the Aura and WeCreat but skip xTool M1 which might be older but still comes out better than Aura, and the WeCreat is basically a somewhat improved clone of.\nThere's also the new Flux Ador which is again very similar in form factor to xTool M1 and WeCreat.",
    "author_name": "@YaaLFH",
    "published_at": "2024-04-21T16:50:21",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwGF0B39RIW_0oexsZ4AaABAg",
    "video_id": "qZBxCROqMqY",
    "video_title": "Is This xTool P2 Feature Worth The $$ ?",
    "comment_text": "Curved surface engraving doesn't actually require a camera.\nBatch processing is useless, even in the demo you had to adjust positions which defeats the purpose. Certainly not good enough for production use unless your clients don't mind sloppily aligned engraving.\nSecond \"bonus use\" is not camera related either, material thickness is measured with the red dot.",
    "author_name": "@YaaLFH",
    "published_at": "2024-04-21T15:16:38",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzbsr3rLN3DPJLkL_J4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Thank you for this great video! I wonder if a fibre laser engraver (e.g. laser pecker) at 20W can be used to cut at 0.2 mm to 0.3 mm thick aluminium alloy shim?",
    "author_name": "@boscoyu_sci",
    "published_at": "2024-04-21T11:17:36",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxMH0e_JLLZN8nBGjl4AaABAg",
    "video_id": "fa7JugG_6-g",
    "video_title": "A Robot Laser Arm??!! - Rotrics DexArm First Look",
    "comment_text": "As a kickstarter this printer has printed 4 bigger printers in parts but the best use was putting a 50w laser on it and cutting 3mm ply was my best decision",
    "author_name": "@ZaviiNetStudios",
    "published_at": "2024-04-21T09:29:47",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxmx_ypIHTIZvxkbiN4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Any imof these able to cut thru 4mm thick steel?\nSoft steel not heat treated yet.",
    "author_name": "@rileycoppicus1128",
    "published_at": "2024-04-21T01:06:51",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwqyARf5-yPjL5dxfd4AaABAg",
    "video_id": "ENCJEaBGFKQ",
    "video_title": "Why do these lasers cost so much?",
    "comment_text": "Looks like Thunder sent a lot of free their stuff to a lot of YouTuber. So many positive reviews barely anyone said they spent their own money 😂.",
    "author_name": "@Jake-2011-",
    "published_at": "2024-04-20T19:53:40",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxw8SDJr2xZIkLHKkJ4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Thank you for sharing your document.  Very helpful for someone like me at the beginning stages of creating a business.",
    "author_name": "@davidsorensen5166",
    "published_at": "2024-04-19T01:23:18",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwr78bjZavD9E3atQd4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "What rpm did you use for the aluminum?  You'll get better performance with a shorter bit asbitll be more rigis.",
    "author_name": "@anthonys7311",
    "published_at": "2024-04-18T20:27:58",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz0Wl-xr0EDNWKi-zZ4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "apparently Omtech dont even carry out any quality control at all. they ship direct to customers and offer support thats it",
    "author_name": "@twt1919",
    "published_at": "2024-04-18T16:36:14",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzMnFwO33SogiQNOJ14AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I am loving my Atomstack A70 Max. So powerful for a diode. The only downside is the non--enclosed part, but I just run it in my garage with the door open and fans running.",
    "author_name": "@StevenDavisPhoto",
    "published_at": "2024-04-18T02:47:57",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwa7VF3R2fjy3xVfcN4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "$25/hr??? That's so not worth it.  But I also live in the Bay Area. Haha.",
    "author_name": "@StevenDavisPhoto",
    "published_at": "2024-04-17T04:52:11",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugz7hLYn8etRxL_jwBx4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Everybody with a decent laser is making layered maps now. It's super saturated.",
    "author_name": "@StevenDavisPhoto",
    "published_at": "2024-04-17T04:50:43",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "Ugw0wjkqLYWQ-R8f3k54AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "I just discovered this laser engraving business because of an Instagram video my friend sent me. I'm always looking for a way to make extra money. I'm really interested in this and am looking to buy a machine and begin doing this. I'd be very interested in seeing how you would begin an Etsy store and market it and so on. I already have some ideas and would love to pick your brain about it",
    "author_name": "@mrdrofcrows",
    "published_at": "2024-04-15T22:52:36",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgwQVX2eHGL9gdG0Gx14AaABAg",
    "video_id": "eZMyGyXsMys",
    "video_title": "The Best Laser engraver on a budget",
    "comment_text": "Isn’t a Temu laser engraver just as good 😂😂, when it’s around this price point, you might aswell go with the cheapest option. There all probably made in the same factory anyway.",
    "author_name": "@johnnylego807",
    "published_at": "2024-04-15T09:27:52",
    "like_count": 3,
    "reply_count": 2
  },
  {
    "comment_id": "UgzgSsJVdcLDdQWXclF4AaABAg",
    "video_id": "78yEfhWEJZc",
    "video_title": "The Best Rotary for a Diode Laser - xTool RA2 Pro Review",
    "comment_text": "SO, if you had a glass that was TAPERED, you would be $hit out of luck since the chuck \"head\" does not pivot to make a tapered glass level....",
    "author_name": "@ainttakenanyshit",
    "published_at": "2024-04-15T04:01:45",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwqkMlah0WgnDvy1k94AaABAg",
    "video_id": "OdN45lx-wRA",
    "video_title": "My Favorite Laser Design Resources (Free and Paid!)",
    "comment_text": "Great video! Just \"trace\" your png image once you have it in LightBurn. It will then turn it into SVG :) I used it all the time and love it!",
    "author_name": "@keelynoxleymitchell",
    "published_at": "2024-04-14T02:04:09",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwR2tg0LrZ470GSePx4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "I did not hear you mention the bottom plate on the Lasermatic can be dropped for larger pieces.",
    "author_name": "@mikedoyle5362",
    "published_at": "2024-04-13T16:33:50",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgyBN-FuPR5Kk20e9894AaABAg",
    "video_id": "BZ3G-DfWSf4",
    "video_title": "Can a 3D Printer Giant Conquer Lasers Too? Creality Falcon2 Diode Laser Review",
    "comment_text": "A \"mini memory card\" seriously? In 2023 you still don't know what a \"Micro SD\" is?",
    "author_name": "@Luca_s_Lab",
    "published_at": "2024-04-12T23:42:13",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy-4_8cGYV2EE-xn2Z4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Ive got an algolaser delta. Unless they improve the reliability i dont recommend it.  When it works its decent but its buggy.  Support is trying so i give them that",
    "author_name": "@nwmi493",
    "published_at": "2024-04-12T22:00:36",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwHSgRQwUXp83fDsg14AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "Hey am a jeweller and need a laser for cutting gold or silver am a subscriber please",
    "author_name": "@AffectionateDragonflies-dy4gb",
    "published_at": "2024-04-12T16:44:22",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgywcchBIQ4I5hbvKgh4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Out of all of the machines you just reviewed….. which can do cylindrical items?",
    "author_name": "@debbiejohnson3724",
    "published_at": "2024-04-12T11:36:59",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxLUupKiQ1pKOVDhg14AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "Compare this to the RM J750, I think it beats it and the price is amazing for a 90W CO2.",
    "author_name": "@Fleshybitz",
    "published_at": "2024-04-11T00:41:37",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzL0LVC8G-abKtzoj54AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "I would be using this in my house.. do they sell a fume extractor or what is one you would suggest for the MK2 30w",
    "author_name": "@garynunncreative",
    "published_at": "2024-04-10T18:45:30",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwzjYHqrtGBOyYSlz14AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "\"Make This With Your Laser To Leave Your Day Job\"\nHow about showing us what the title of this video is that we can make that will enable us to leave our day job.\nPerhaps you should make a video of how to be a click bait artist.  Glad I've got ad blocker running.",
    "author_name": "@thecentralscrutinizerr",
    "published_at": "2024-04-10T05:14:19",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgzRTmeqQkbi_r2aAq14AaABAg",
    "video_id": "pKlWvRaqils",
    "video_title": "The ALMOST perfect laser: The xTool S1 Laser Review",
    "comment_text": "Hi there, I am wanting to get a photograph engraved on stainless steel using the X-tool S1 with the 2w IR laser. I am based in the UK and wondering if you are able to do this? if so please reach out to discuss further. Many thanks, Joe",
    "author_name": "@JosephBegley-gf5rn",
    "published_at": "2024-04-09T11:36:53",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxHOiErvw1QjIogP8d4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Nice video but I can't get the page you refer to: The Laser Comparison Chart to work, am I doing something wrong?",
    "author_name": "@Livasmorfar",
    "published_at": "2024-04-08T19:18:05",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzS7ZhCJCVrpVPtlAJ4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I would have to agree with the way you sorted them. Just one point that you missed that's probably the most important one. And that is, the LaserMATIC is the *only machine* that works in absolute coordinates with absolute precision because of the fixed honeycomb. _By the way, it's pronounced, \"Rowlee\", named after a man called Roland._",
    "author_name": "@TheLouisianaHobbyGuy",
    "published_at": "2024-04-08T15:48:11",
    "like_count": 12,
    "reply_count": 1
  },
  {
    "comment_id": "UgxPBloFsgezuzrMsnl4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Great video! I'm looking to cut embroidered patches on twill fabric.\n\nBut the Falcon website says Fabric can be engraved but NOT cut. I find that surprizing. I was hoping to get away with the 22W one, but now I am hesitating the entire project. I was excited about Diode lasers as the size of the work area is much larger than any desktop CO2. But now I am worried, I could not find any people using it for twill patches so your input is greatly appreciated. \n\nBelow is copied from the website\"\nDiode laser cuttable: paper, wood, leather, MDF, felt, some dark opaque acrylic\r\nDiode laser engravable: Paper, Wood, Leather, MDF, Stairless steel, Some dark opaque acrylic, Bamboo, Fabric, Dark",
    "author_name": "@pacotubeful",
    "published_at": "2024-04-07T21:34:41",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzqIiSvMjlynii9dRB4AaABAg",
    "video_id": "j4GmodbLZlE",
    "video_title": "Should You Get a Fiber Laser?",
    "comment_text": "I just bought the xTool F1 because I want to engrave stainless steel and brass. Does that mean I can do neither with it and need a fiber laser instead?",
    "author_name": "@kait1952",
    "published_at": "2024-04-06T22:49:57",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzqCZHOQD2PhfIRER94AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "When I click on the budget link I get a page not found error....",
    "author_name": "@DarkCHAOS714",
    "published_at": "2024-04-06T12:26:00",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwnagnW1N8RmZQK8tZ4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Great review as always. Haven't made my mind up yet. Thank You",
    "author_name": "@doug9121",
    "published_at": "2024-04-05T18:11:47",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxYPy4SDvBCF6IIMMp4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "One factor on your cost analysis. So im going from a Cnc, and have a laser on the way. So reality machine time is human time. Yes you can leave a bit, and do other things but those hundreds of hours of machine time, you still need to be in the shop. More just pointing out the time calculation gets complicated. So woodworkers do this math a little bit different, total time divided by total profit(minus materials) is your hourly rate of pay",
    "author_name": "@IntrexinCustom",
    "published_at": "2024-04-05T14:03:21",
    "like_count": 10,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxl34kY7h07X3jAGAB4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "As soon as I saw that this thing existed, I came looking for your review. The price is a little painful but thank you for your video",
    "author_name": "@AndrewLaSane",
    "published_at": "2024-04-05T13:47:38",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxLhiGoyqhM_DaSZw94AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "So i dont know about the others, but i will say your xtool s1 is a basic setup. With how they sell them they always bundle things. So i just got on the easter sale, i do think there is a big gap between just the base machine and what they are actually selling. Like the riser base was tossed on with everything. But going with max config and having thr conveyer adds a whole lot more working area than others.",
    "author_name": "@IntrexinCustom",
    "published_at": "2024-04-05T13:46:12",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxZCtr0MSqGHXoC3ZV4AaABAg",
    "video_id": "GivrQWLjeLk",
    "video_title": "Laser Companies are Lying to You",
    "comment_text": "when shopping and chatting on Alibaba, we soon learn that China people have thier own meanings of many words",
    "author_name": "@DwightStebner",
    "published_at": "2024-04-05T13:02:30",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzRV78BgFpxGt7Edmp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I think Snapmaker Ray 40W deserves up your chart man! Its high fidelity and precision, very accurate and safety precautions are an important factors.",
    "author_name": "@R-optic",
    "published_at": "2024-04-03T08:24:45",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgznhTgrkL7yOWqX3Zl4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Anyone can point me out to laser machine 60-70cm width working surface for just perspex cut and similar work.\nThank you guys",
    "author_name": "@thriveforbest3217",
    "published_at": "2024-04-01T16:30:37",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwc5csUFsTRcJ9EuMV4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Best review of lasers I ever seen ❤ guy is brilliant and everything summarised so good",
    "author_name": "@thriveforbest3217",
    "published_at": "2024-04-01T16:25:30",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgzamcNBPEu4YDvv-np4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "2 min in to it and I like this guy 🎉 let's dive in",
    "author_name": "@thriveforbest3217",
    "published_at": "2024-04-01T16:18:16",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwOx_Pgtmbv1d5YWlZ4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Vidéo qui pourrais être intéressante sauf que vous parlez trop vite aussi bien pour la traduction et les sous titre \nEn plus venté XTool parcequ’ils sont à distribuer leurs produits à tour de bras c’est pas est impartial d’autres marques sont professionnels en la matière et complet dès le départ sans ajout pour un prix bien moins élevé que toutesles machines XTool qui plantent quand ont conçoit des séries plus important alors qu’elles sont vendu en temps que matériel professionnel",
    "author_name": "@Creationsmorvan",
    "published_at": "2024-04-01T10:52:25",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwFYFe3db0t5GjAM0R4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Thx. I assume these are all diode lasers? If so, would you be able to do a video like this for desktop co2 lasers please?",
    "author_name": "@jasmindrace",
    "published_at": "2024-04-01T07:17:59",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgzG7Q60RbiR6a2-V8l4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "You didn’t mention the software cost for the Glowforge which I think is very important. Glowforge premium subscription is $50. Month, $600 a year. If you don’t get the premium subscription the basic is bones. Yes, I mean dead bones, 100% strip to do most things. Most of the features such as symbols, shapes, and most of the other features is tuned off. And very limited to two types of fonts. This company “Glowforge “ is the most expensive laser cutter out there in terms of their software. Plus, you can’t use any other software with the Glowforge Aura or Spark models. It is sick and down right greedy.",
    "author_name": "@LouRao",
    "published_at": "2024-03-30T16:24:58",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwdihjL07pNN0Hx3s94AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "If you're looking for a lower-power diode laser (10W or less), and you already own a 3D printer, some companies (such as Creality) offer a bolt-on laser module for your specific model.  This way, you utilize the motorized axis control of the printer you've already spent your bucks on, and can get the laser unit for MUCH cheaper than a stand-alone laser cutter/engraver.",
    "author_name": "@kevin.lotsberg",
    "published_at": "2024-03-29T00:13:11",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzrv-wBoCSelEsoENF4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "I tried to download the budget planner tool but ut says the site cant be reached. Even when i click the link in my email to subscribe?",
    "author_name": "@butterflykisses4587",
    "published_at": "2024-03-28T12:49:53",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgynBNrA3SQCYWzXqr14AaABAg",
    "video_id": "qZBxCROqMqY",
    "video_title": "Is This xTool P2 Feature Worth The $$ ?",
    "comment_text": "Considering the xTool P2 for your laser cutting and engraving needs is a good idea, but I would also recommend exploring the Monport laser for its exceptional features and benefits. Here's why:\r\n\r\nEase of Use: While the xTool P2 may offer some convenient features, the Monport laser is renowned for its user-friendly interface and straightforward operation. Whether you're a beginner or an experienced user, you'll find the Monport laser easy to set up and use for your projects.\r\n\r\nHigh Quality: The Monport laser is known for its high-quality engraving and cutting capabilities. It delivers precise and detailed results on various materials, ensuring that your projects come out beautifully every time.\r\n\r\nAffordability: Despite its high quality, the Monport laser is affordable, making it a cost-effective option for hobbyists, small businesses, and professionals alike. You'll get excellent value for your money with the Monport laser.\r\n\r\nOverall, while the xTool P2 may have some appealing features, the Monport laser offers a compelling combination of ease of use, high quality, affordability, versatility, and reliability. Be sure to check out the Monport laser product page for more information and to see how it can enhance your laser cutting and engraving experience. https://monportlaser.com/collections/co2-laser-engravers/products/monport-40w-lightburn-ready-12-x-8-co2-laser-engraver-cutter-with-fda-approval?sca_ref=5031521.ka374VZjm3",
    "author_name": "@MeganBrix-ej4ml",
    "published_at": "2024-03-28T07:18:32",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxttVCl1vFuyjFguEF4AaABAg",
    "video_id": "qZBxCROqMqY",
    "video_title": "Is This xTool P2 Feature Worth The $$ ?",
    "comment_text": "A superb review. Learned so much. Thanks. I’ve an F1 but the P2 is going to be my next machine. You’ve helped me make my final decision.",
    "author_name": "@nathanwolf5547",
    "published_at": "2024-03-28T02:31:23",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgzGJA8gS9GefVNKmgJ4AaABAg",
    "video_id": "HvgyRSbQUTI",
    "video_title": "Worth it? How the xTool P2 CO2 Laser Stacks Up Against the Competition",
    "comment_text": "I have a question for you, I've seen the Glowforge reviews now the XTool P, if you have to buy a laser machine today which one would you buy. Give the reasons.",
    "author_name": "@sarasiqueira1",
    "published_at": "2024-03-27T16:25:55",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy2aJwyCYDmjzt48vN4AaABAg",
    "video_id": "qZBxCROqMqY",
    "video_title": "Is This xTool P2 Feature Worth The $$ ?",
    "comment_text": "Great video as always, the different case use examples were a nice touch.",
    "author_name": "@danthemakerman",
    "published_at": "2024-03-27T14:19:14",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwNuaV7rGB8uHsd0JJ4AaABAg",
    "video_id": "qZBxCROqMqY",
    "video_title": "Is This xTool P2 Feature Worth The $$ ?",
    "comment_text": "Great !! It will be nice if they do the same for the Xtool S1. Camera should be consider a standard in all Lasers. Thank's !!",
    "author_name": "@anthonyroman9815",
    "published_at": "2024-03-27T14:13:47",
    "like_count": 3,
    "reply_count": 0
  },
  {
    "comment_id": "UgwGtcWVzTNLlt6J6SN4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Informative video, thank you.\n\nMay I ask in your opinion which is the quietest to operate\n\nRoly mk2 30w\nCreality falcon 40w\nXtool S1 40w\n\n\nkind regards",
    "author_name": "@tonyfoster6852",
    "published_at": "2024-03-26T23:12:16",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwWnI1qEkQoLIS2K4B4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "If you already have the S1, would you get the S1 1064nm Infrared Laser Module of the F1?",
    "author_name": "@thatchlombrozo2419",
    "published_at": "2024-03-26T17:40:50",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgzR2bxlK1TJzL_2kzZ4AaABAg",
    "video_id": "HvgyRSbQUTI",
    "video_title": "Worth it? How the xTool P2 CO2 Laser Stacks Up Against the Competition",
    "comment_text": "Do you think the \"xtool P2\" laser is better than the \"Muse 3d\" \r\nI really like both machines because of there live 3d autofocus/scanning/ Z-achse controll. \r\nWhich machine would you recommend?",
    "author_name": "@NewLOL74",
    "published_at": "2024-03-26T09:21:27",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzNZ5lXmP9CB3Lp1tZ4AaABAg",
    "video_id": "3cFe6kGzS88",
    "video_title": "Is Fusion 360 worth learning over Sketchup?",
    "comment_text": "I swear to god Fusion 360 is the shittest least intuitive program that has ever existed..",
    "author_name": "@seyahatt6843",
    "published_at": "2024-03-25T16:25:00",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwM5Jux_FcvpmTsDCB4AaABAg",
    "video_id": "15b3sLZ5pkY",
    "video_title": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "comment_text": "Would this machine die cut through .035” HDPE? Or is there something else on the market that would better suit what I’m needing?",
    "author_name": "@rochsner23",
    "published_at": "2024-03-25T05:08:19",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxZlzgeDpHblPJcfW54AaABAg",
    "video_id": "Y-OU0yaD62w",
    "video_title": "Get started in Fusion 360 for CAM & CNC - Complete Beginners Tutorial",
    "comment_text": "hi  there by  chance  could  you  give  us  a  tuto for  4  axes  Rotary  lecture",
    "author_name": "@carlos-z8q9f",
    "published_at": "2024-03-24T16:11:40",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw1ARrq6h0zHQOtth94AaABAg",
    "video_id": "GjfWcQidYLM",
    "video_title": "Testing the OM Tech K40 Laser",
    "comment_text": "Excellent! is there any chance you could review the new K40+ which seems to have relevant upgrades",
    "author_name": "@stellardynamix",
    "published_at": "2024-03-24T09:53:10",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw_Z8ol5TIrYVxMtUF4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "xTool 40W for $2400.00 is a RIPOFF! They flood the market with advertisements and confuse people with their marketing hype. Don't believe it!",
    "author_name": "@MyLifeAsMitch",
    "published_at": "2024-03-22T14:33:29",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugx0LzLz_iwHv6hNJdt4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Have you tried the new Wecreat yet? $1200.. thinking of trying it",
    "author_name": "@melaniebettencourt6195",
    "published_at": "2024-03-21T17:50:29",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgxBcMoum2aQ2G8lp4V4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I own the F2P as well and I'm a bit saddened by the inability to raise the z-height on this unit, despite being promoted on Creality's own listing page. I suggest anyone looking into this printer be VERY cautious. You're paying a lot of money for a supposedly versatile tool. If you think someday you might use a rotary tool on this thing -- you probably won't. The tray CANNOT be removed to extend the legs so you can fit a rotary. The device uses a magnetic switch to detect when it's removed, and shuts off the laser. So just be aware that you are basically buying a $300 CNC laser with a $20 lid on it and a PC case fan to vent it.",
    "author_name": "@scrampker",
    "published_at": "2024-03-21T16:52:30",
    "like_count": 3,
    "reply_count": 3
  },
  {
    "comment_id": "UgzM9OVAMf1iPgHnnid4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "I own the F2P as well and I'm a bit saddened by the inability to raise the z-height on this unit, despite being promoted on Creality's own listing page. I suggest anyone looking into this printer be VERY cautious. You're paying a lot of money for a supposedly versatile tool. If you think someday you might use a rotary tool on this thing -- you probably won't. The tray CANNOT be removed to extend the legs so you can fit a rotary. The device uses a magnetic switch to detect when it's removed, and shuts off the laser. So just be aware that you are basically buying a $300 CNC laser with a $20 lid on it and a PC case fan to vent it.",
    "author_name": "@scrampker",
    "published_at": "2024-03-21T16:49:03",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwrfWgVpF0xQtH7fRF4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "I have A20Pro. Only problem I can't find where to buy replacement parts. I need to replace my cracked focus lens on M100 Module. I have emailed Atomstack support but Atomstack has not returned my emails.",
    "author_name": "@dickwaters7950",
    "published_at": "2024-03-21T13:34:23",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz1ys4cgjsejBgbcqZ4AaABAg",
    "video_id": "HvgyRSbQUTI",
    "video_title": "Worth it? How the xTool P2 CO2 Laser Stacks Up Against the Competition",
    "comment_text": "For safety, do safety glasses need to be worn when the lid is closed? How about when using the conveyor system? Just want to make sure when people enter my space are there any safety concern?",
    "author_name": "@patberry3388",
    "published_at": "2024-03-21T13:24:24",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxLcRgSrkCD7z7DPzV4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Great overview. I am trying to cut very basic inserts for sample boxes. The material polypropylene foam. One inch thick. We need flexibility because devices constantly change, which means our circles may have different circumferences. Any rec's?",
    "author_name": "@PatrickGawrysiak",
    "published_at": "2024-03-20T19:26:46",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwn1sM4k301ZwzMwwR4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "Using mirrors means the beam isn’t circular as it moves farther from the center. Have you noticed any decrease in sharpness towards the edges? Also, what happened at 7:04?",
    "author_name": "@marsrocket",
    "published_at": "2024-03-20T05:25:54",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgzzqGmymQcy80IRLMB4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "Could it cut leather/cork fabric say for making earrings or stuff like that?",
    "author_name": "@bozthescrewup410",
    "published_at": "2024-03-20T01:21:56",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxIjCKg2sbEXjtXxVh4AaABAg",
    "video_id": "j4GmodbLZlE",
    "video_title": "Should You Get a Fiber Laser?",
    "comment_text": "What is the best laser machine for cutting metal like silver, stainless steel and gold. Just want make name tags like neckless.  Please advise.",
    "author_name": "@info4750",
    "published_at": "2024-03-18T19:34:23",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwYYO1Pdi1T7aswpAR4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Do any of these diode laser cut and engrave mirrored acrylic? I heard you have to have a CO2 laser for that.",
    "author_name": "@ladybugs2965",
    "published_at": "2024-03-17T19:05:03",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugw1pO1b6In8NzWoCCR4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "This actually does a great job cutting, I was able to cut 1/8 Padauk in 2 passes.",
    "author_name": "@jonathanlaw475",
    "published_at": "2024-03-17T15:11:54",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "UgxYuS5NV-ptAJKmFyR4AaABAg",
    "video_id": "XHsf7Hzs-0g",
    "video_title": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "comment_text": "I would like to know where can I find a replacement for the pulley-coupling piece or how it is actually called?",
    "author_name": "@jesusmanuel3697",
    "published_at": "2024-03-17T13:21:46",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxIc3yD0h4HP6VX8c54AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "Bought mine on a whim and it’s become one of my favorites for engraving due to the speed",
    "author_name": "@bgateb",
    "published_at": "2024-03-16T21:34:14",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "UgybJH2AmU4wqMTuKIR4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "The machine does not have a camera but it does have a live preview! I find it very helpful for one offs because you can exactly line the piece up on the bed.",
    "author_name": "@evanbrand8810",
    "published_at": "2024-03-16T14:22:23",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgxwBznEmoqgqJWLdlN4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Roly has said the MK3 due out next year will likely have autofocus",
    "author_name": "@LetsDIYIt",
    "published_at": "2024-03-16T01:58:23",
    "like_count": 4,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxii2cv-3jfR-WN-Dt4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "Same... I was very hesitant to buy it because my bigger lasers do everything this does. However, it has actually became on of my favorite lasers to use. We use for on the spot personalization at our store, and people love it.",
    "author_name": "@mikeyneeley",
    "published_at": "2024-03-16T01:14:11",
    "like_count": 7,
    "reply_count": 1
  },
  {
    "comment_id": "UgygNLQltKGloDj1aCh4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Where can I buy the module replacement  view window part?",
    "author_name": "@dickwaters7950",
    "published_at": "2024-03-15T23:44:08",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyXzReaxHpQDlL8icx4AaABAg",
    "video_id": "zItfgB0OeHg",
    "video_title": "The xTool F1 Is Actually Pretty Awesome!",
    "comment_text": "1:52 - no, it won't.  The IR laser is removing the anodization, not the aluminum.  With as much as you do this, you think you'd not make that simple mistake, but I didn't think this channel had much in the way of moral fiber.",
    "author_name": "@ThantiK",
    "published_at": "2024-03-15T23:35:36",
    "like_count": 2,
    "reply_count": 2
  },
  {
    "comment_id": "UgzULxBK-5w9SfSzXIp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "What is the best laser engraver for extremely fine detail for home usage?",
    "author_name": "@DaSmokeDaddy",
    "published_at": "2024-03-15T17:02:13",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxemlPqDyqGpcEH5CN4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "does the falcon2 have its own program? i wanting a machine but have not decided yet.",
    "author_name": "@mtz3843",
    "published_at": "2024-03-15T15:37:39",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwd7-A-wOnBjakkA4N4AaABAg",
    "video_id": "paDgKFKD6yE",
    "video_title": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "comment_text": "I hate when people use engrave, etch and mark interchangeably.  They are not the same. Does it do etching to adept of at least 25 to 40 microns???",
    "author_name": "@gedionatphysicsmathelectro1867",
    "published_at": "2024-03-14T11:54:57",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzFMAyIOlaCSCPpYEZ4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I did like this comparison. HOWEVER. I've got to call you out just a small bit. I just bought the S1 after some considerable research. The full enclosure did sell me the most, but the extra features really made this purchase a no brainer. I find it odd that you didn't mention that the S1 has all the attachments. Extra modules (like IR laser, and 20W laser switchout, + future ones), The Rotary attachment, the riser for thicker material option (which also give you the pull out crumb tray feature), the pass through capability with the riser. The Fire extinguisher module option. The conveyor system module which allows for 10 FEET material.Do all the other machines offer this? I purchased all the above (except for the 20W, which I may still buy).",
    "author_name": "@stvcolwill",
    "published_at": "2024-03-14T02:27:47",
    "like_count": 4,
    "reply_count": 1
  },
  {
    "comment_id": "UgykUMfD65ymH0DlhOR4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "What are the copyright issues of making money off representations of property like stadiums?",
    "author_name": "@BlackDim100",
    "published_at": "2024-03-13T15:28:48",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgxomGJbDEuyBLrtEfV4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "for me, as a RC builder (which is mostly overlooked), I like the passthrough feature.  Being able to cut larger size parts is something not a lot of manufacturers have thought about.  The build quality looks great and when you ask them a question, they responds within 12hrs which is really great!!  also, the jig looks like a great tool for someone that would like to cut larger pieces!!  Looks like a great machine, for this price...",
    "author_name": "@egonverleysen695",
    "published_at": "2024-03-13T13:55:39",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgyJgQbxK0JH2iBxJp14AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "So, why did not include the Xtool M1 machine?? Since you included the Glowforge at 6w?",
    "author_name": "@janesfavsvideos",
    "published_at": "2024-03-13T05:49:21",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy8rWhwWHDM7fPlmSJ4AaABAg",
    "video_id": "XHsf7Hzs-0g",
    "video_title": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "comment_text": "Cool video, thanks. Just a quick question if I may - between the S9, S30 Pro Max and the S30 Ultra which one would be a better pick considering that the budget is somewhat flexible? It is for some general purpose cutting ( Balsa, Plywood, Acrylic etc. ) and less of engraving. I am somewhat inclined towards the S30 Pro Max with the 20W Laser Module.",
    "author_name": "@Bespoke-Rodriguez",
    "published_at": "2024-03-12T03:20:37",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwnZ1SANWZRO0gsxI94AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "AtomStack had also came out with a 70W, i have not looked at review yet for it however. I do like my S1, i replaced my D1 Pro with it",
    "author_name": "@Spirited282",
    "published_at": "2024-03-12T02:06:17",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw8xTimzg-gIibAFoZ4AaABAg",
    "video_id": "pKlWvRaqils",
    "video_title": "The ALMOST perfect laser: The xTool S1 Laser Review",
    "comment_text": "Would LOVE to see a side-by-side comparison of the S1 and P2.  Understand 2 different laser types but would be helpful for anyone looking to purchase & torn between the 2.",
    "author_name": "@tonystobb8364",
    "published_at": "2024-03-12T00:43:51",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxUmRTEnQOUDbwslQt4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "What laser cutting machine can I use to cut 18k gold, with 1 to 2 mm thickness, 100X 100mm working area, and for jewelry-hobby purpose?",
    "author_name": "@rameilfars9364",
    "published_at": "2024-03-11T06:57:14",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxD82JoloeGdVfv6Hl4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "A good bit of information. As someone like myself who has worked at the same place for 18 years and make wages have been very low i finally opened up an etsy store with the hope of one day saying adios and just work on my own.",
    "author_name": "@Spirited282",
    "published_at": "2024-03-10T20:13:44",
    "like_count": 15,
    "reply_count": 2
  },
  {
    "comment_id": "Ugxx0i8IWu44_F3Ry5h4AaABAg",
    "video_id": "aG-D9DseUjQ",
    "video_title": "The Easiest Way to Create Graphics for Custom Signage",
    "comment_text": "This video was nice and helpful.  I am a Kittl-Noob but certainly like some of ease of use for super cool automation. \n\nMind if I ask where you source that acrylic?",
    "author_name": "@jeremygreer87",
    "published_at": "2024-03-10T05:25:15",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy-VjU7nN-poXOj72p4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "I can see you've put a lot of work into this and really appreciate you sharing it with us. Now to find a great, profitable and unique idea. Got a spreadsheet for that effort? 😆",
    "author_name": "@jamievalentin1193",
    "published_at": "2024-03-08T14:13:55",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "Ugxpdk1QJvcUvAMJUdN4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "I just wish they'd make these with a bigger area. I want 20\" x 30\" working space minimum.",
    "author_name": "@jasonhurdlow6607",
    "published_at": "2024-03-08T02:00:33",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "Ugzhw7bxXHyXJsF4Vyl4AaABAg",
    "video_id": "HvgyRSbQUTI",
    "video_title": "Worth it? How the xTool P2 CO2 Laser Stacks Up Against the Competition",
    "comment_text": "So far this P2 model is looking like the way to go unless someone comes out with a better mousetrap.  for the price with the feedthru option, rotary capabale and the camera for parts placement I thinke they've got them beat.",
    "author_name": "@chalkline1505",
    "published_at": "2024-03-08T01:40:27",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgySES9GelYtZQDDwW94AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "With a less longer Bit, you could mill Aluminium much bettter. I have the TTC450 on my own and there is much more movement on the Z axis. but if your bit is not so long, you get better results. Have a great evening!",
    "author_name": "@InfinitySkyview",
    "published_at": "2024-03-07T20:40:23",
    "like_count": 4,
    "reply_count": 0
  },
  {
    "comment_id": "UgznWN9F5LSnguP6Gfd4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Hello sir i would like to know how to do for a sponsorship for a laser cutter engraver salle o e li,e xtool the red one you showed i would like to do all type of material as i gave my son m'y kidney and would like to work at home cause no more able to work outside or heavy work anymore as where i am its not available locally thanking you in advance",
    "author_name": "@ramjeansakeel8242",
    "published_at": "2024-03-07T18:48:58",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzZkclH41Wq6SMVhe14AaABAg",
    "video_id": "S3TneioSp9I",
    "video_title": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "comment_text": "What would you recommend for embossing or foil on to cards?",
    "author_name": "@Actiondicegames",
    "published_at": "2024-03-07T18:27:51",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzRulK5OGaHKxaKAJV4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "What would you recommend to engraver only letters onto shot glasses",
    "author_name": "@SoundMasters-by2wc",
    "published_at": "2024-03-07T00:20:43",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyEyjpAU60OCoSv5tp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Just upgrading my Roly with an XTool Fire safety set. I’m not happy to use XTool but there are no alternatives right now and it’s a standalone system, so it works with any enclosed laser you can fit it on, just don’t buy the S1 specific version.",
    "author_name": "@crowguy506",
    "published_at": "2024-03-06T17:44:04",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyOLiMywa3ErmqUDlF4AaABAg",
    "video_id": "ZeajuzAjL9M",
    "video_title": "My Favorite Laser Just Got Better! - xTool D1 Upgrades",
    "comment_text": "Those air pumps are $45 on amason and way less on ali express..... pretty sure they are same pump and they have variable speed control ehich the xtool pump doesnt. 😊",
    "author_name": "@hedleypepper1838",
    "published_at": "2024-03-06T13:38:20",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyE2BpqPNR9ORK04nl4AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "I've watched other comparisons where actual cutting time was measured. Before fully understanding the logic used to control the laser, I was surprised to see that machines with 600 to 1,000 mm speeds could only produce parts at roughly the same run time as machines with a maximum speed of 300 to 400 mm. The reason is that the faster machines have to overshoot the work area when ramping up and slowing down.\n\nUltimately, the best choice of laser comes down to (1) the purpose you intend to use it for (cutting or fine engraving) and (2) how fast it can perform the required task.",
    "author_name": "@gaiustacitus4242",
    "published_at": "2024-03-06T04:32:18",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz6jl_6hb_pM25Cpep4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Can i cut various types of foam with a cheap laser diode machine mostly under 5 to 10 mm thick, plus some ply and balsa 1.5 to 2mm?  Ta.",
    "author_name": "@Stuff-i-Like",
    "published_at": "2024-03-05T13:41:42",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgxBuXoBZlZoB9n1fRh4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Creality has a really good deal on the falcon 2 pro, making it 160 something dollars cheaper than the LaserMATIC. Would you still prefer the lasermatic? (Both 20w)",
    "author_name": "@Mineralvand",
    "published_at": "2024-03-05T12:54:05",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgycSGiziGise4JPSXJ4AaABAg",
    "video_id": "pKlWvRaqils",
    "video_title": "The ALMOST perfect laser: The xTool S1 Laser Review",
    "comment_text": "I love love love my lasermatic. And the customer service is top notch!!!",
    "author_name": "@frankalviso3147",
    "published_at": "2024-03-04T08:44:40",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgzjJGbg6LB8N_rOUx94AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "This guy talked about AI stuff but also back to make his advertisement. I am sick of this type guys on youtube they are not honest or expert in their field its all about making money by making videos here. I will unsubscribe!",
    "author_name": "@BGIS2000",
    "published_at": "2024-03-04T07:50:15",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgySIniK-0HmRrWZ6aZ4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Surprised to see that the Polar wasn’t on your list.",
    "author_name": "@ImaginationDesign",
    "published_at": "2024-03-03T23:50:04",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "UgwAYbQC0Ia2BDYmWCd4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I am waiting for a galvo  combo all in one system like the diode lasers are getting.",
    "author_name": "@TheFeist77",
    "published_at": "2024-03-03T23:48:12",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzjz_c8UoRqR_QaXMJ4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "I've got the Lasermatic Mk1 and Mk2, both at 20w and am extremely happy with them. Thank you for a nice review. Also on the Lasermatic, the rotary sits on registration pins so the placement is set. Hoping to upgrade the Mk2 to 40w later this year. Then looking at getting a fiber laser for metal marking.",
    "author_name": "@landreywoodworks4957",
    "published_at": "2024-03-03T23:35:18",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "Ugzuq7vGBUbGO20Rmc14AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Love my Roly Mk2, support and customer service are 2nd to none!",
    "author_name": "@3sticksoutdoors",
    "published_at": "2024-03-03T18:37:24",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "Ugy-tRPMqETlCbCJKC14AaABAg",
    "video_id": "8MRSoOHMWdw",
    "video_title": "Should you buy a Fiber or a CO2 Laser?",
    "comment_text": "Could we get an explanation on the different wattages for a CO2 laser?",
    "author_name": "@username14219",
    "published_at": "2024-03-03T01:17:25",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwtPSTYbkOnTot1C1l4AaABAg",
    "video_id": "j4GmodbLZlE",
    "video_title": "Should You Get a Fiber Laser?",
    "comment_text": "FYI: you can etch stainless with metal marking spray ( we do it at work every day ) on an CO2 machine. But the cans we buy run almost $100 each.",
    "author_name": "@brainfarth",
    "published_at": "2024-03-03T00:20:00",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgwjQ3E14TIgnHu-1lZ4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Was a out to pull the trigger on the WeCreat until I i saw your recent ranking video and you put this one at the top.\n\nHow does the height/cut depth differ between the two? (Not sure if the terms are right. I'm asking about how tall of a piece can you put under the laser to engrave?)\n\nAlso, how do the fans ability to clear smoke out conpare between the two?\n\n\nThanks for the great information and reviews!",
    "author_name": "@justinbanks2380",
    "published_at": "2024-03-02T18:54:51",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxSJxd7IG6xto_ky6h4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Another great video, love all the info you put out.",
    "author_name": "@danthemakerman",
    "published_at": "2024-03-02T18:08:53",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgysGieEx9jw42AKquV4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Fantastic video. Just one correction, the XTool S1 is not fully Lightburn compatible, just the basic features.",
    "author_name": "@MyLifeAsMitch",
    "published_at": "2024-03-02T17:21:00",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgyQWMnQzedNzL1WDuN4AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "Will the thunder bolt allow you to use a different rotary or just theirs? It adds almost $1000 bucks to price. Great video!",
    "author_name": "@blueskyjax",
    "published_at": "2024-03-02T17:19:59",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwnHuxUbdfPFiNUrxl4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "V-Rollers vs Linear Rail and/or Precision Ground Rod is another aspect that has me intrigued.  What is your opinion on all that?",
    "author_name": "@ericlotze7724",
    "published_at": "2024-03-02T15:30:32",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgzE1bch-7szCjgxMXh4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Great video. Side note. Xtool - Lightburn compatibility on S1, F1, and P2 is a bit.. wonky. Work is being done on that though",
    "author_name": "@gilaraujo",
    "published_at": "2024-03-02T15:11:13",
    "like_count": 3,
    "reply_count": 5
  },
  {
    "comment_id": "UgwBuvWW0TsW3hD8tFp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Have you had a chance to try out the new Ikier 20W Fiber Laser ?",
    "author_name": "@ElectricBikeLaboratory",
    "published_at": "2024-03-02T14:48:40",
    "like_count": 2,
    "reply_count": 2
  },
  {
    "comment_id": "Ugz9PNs17lfCVikGqIp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Given that 30-40W will cut 15 mm plywood and ~20+mm wood/particleboard, once you get into/past that 30-40w range size starts to be become the more important metric for many/most. \n\nA 3-400mm square 70w laser will for most be a LOT less interesting than a 500mm+ square 40W model and available space becomes the real limitation.\n\nI would buy a 600mm square 40W laser over a 300mm square 70w laser for a similar price and it wouldn't even be a difficult choice.....",
    "author_name": "@mastermaker666",
    "published_at": "2024-03-02T13:10:23",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgyPa8L6N5zioFy4nGV4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Thanks for another useful video. If you have a moment, where does your Thunder \"Bolt\" sit in this lineup? That's the machine I am most interested in.\n\nObviously you could not cover everything, and one important factor you overlooked is maintenance. For example, the Roly requires removal of several tiny screws to clean the lens and shroud, while others use magnets and other methods. For me, difficult maintenance could be a deal breaker.",
    "author_name": "@Metal_Vistas",
    "published_at": "2024-03-02T12:55:05",
    "like_count": 10,
    "reply_count": 2
  },
  {
    "comment_id": "UgxjJdoahesQolUCd6B4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "I need to  cut clear acrylic so which one is better for that without breaking the bank? Thanks",
    "author_name": "@mikeledee8786",
    "published_at": "2024-03-02T12:42:13",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "Ugze7yhFSWK03TJzenF4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Avoid AtomStack. Poor customer service. Zero technical support. Bad company. I speak from experience!",
    "author_name": "@jimblack6733",
    "published_at": "2024-03-02T05:36:42",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyYeWHv1H_Ay9CjD7h4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "The Xtool S1 doesn't fully support Lightburn. There are several features that you cannot access through Lightburn. Also, I and many (most) S1 users find the marking system superior and more precise than a camera",
    "author_name": "@giandeau",
    "published_at": "2024-03-02T05:29:59",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgweyfajPUn50BI17EF4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "It was not an apple to apple comparison, suppose people want to buy a 40W or 20W machine, there should be a 40W vs 40W or 20W vs 20W comparison instead of a mix. It was kind of a mid-leading using $/w jumping from different watts.",
    "author_name": "@Wills-T",
    "published_at": "2024-03-02T03:47:52",
    "like_count": 5,
    "reply_count": 1
  },
  {
    "comment_id": "UgwQq4k2izh-8fmVEfd4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Do any of these machines have a fence? I use materials sometimes with certain patterns on them that I need the pattern to be square to the cut. I built one for my atomstack, but I’m thinking about going to one of these. \n\nIs there any desktop lasers (Diode or CO2) that have one? A camera is little too inaccurate because of the parallax of the lens.",
    "author_name": "@chrislabar22",
    "published_at": "2024-03-02T01:14:33",
    "like_count": 0,
    "reply_count": 4
  },
  {
    "comment_id": "UgxKaRU2F3x-ytZ4DYp4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "With a name like Make or Break Shop...do you ever actually make...anything?  Or are you just a sellout pushing laser cutters now?",
    "author_name": "@ThantiK",
    "published_at": "2024-03-02T00:52:17",
    "like_count": 5,
    "reply_count": 2
  },
  {
    "comment_id": "UgyEPAjyCzQq4bmVYDN4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "Apparently the ONLY way to get a working laser is to have them GIVE you one for free for reviewing it.",
    "author_name": "@toddo3591",
    "published_at": "2024-03-02T00:34:16",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugz3Z2RlvVbUEDZdK_d4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Thanks for putting this out man. It really reinforces my decision. I still can't believe how fast you were able to get this out. XD cheers brudder",
    "author_name": "@ShelbyWeatherbee",
    "published_at": "2024-03-01T23:42:36",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "UgwNZJPsi1IcZPkIukN4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Hey, why not include Xtool M1? You mentioned the Glowforge Aura, I think both compete on the same market, like craft and hobbyists. Thanks.",
    "author_name": "@itsmi18",
    "published_at": "2024-03-01T23:12:15",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzmQT0mcls34PrKMNR4AaABAg",
    "video_id": "hXx36nrMA3U",
    "video_title": "The Best Laser Engraver and Cutter to Get in 2024",
    "comment_text": "Tbh I think the price per Watt is a highly artificial non-informative number.",
    "author_name": "@abbofun9022",
    "published_at": "2024-03-01T23:04:26",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgwMUjBqAs9Gwyv66x54AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "This is a budget only if you sell the one item? I dont see how you have multiple items",
    "author_name": "@chrism7067",
    "published_at": "2024-03-01T18:25:05",
    "like_count": 2,
    "reply_count": 2
  },
  {
    "comment_id": "UgxMsvbiULVTXIknE_R4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "Great little machines\nTip i would have your bit shorter to give better rigidity\nEither push it up further into the collet or use a shorter bit",
    "author_name": "@spudnickuk",
    "published_at": "2024-03-01T17:25:11",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzOxpIhy16keX7jrVh4AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "Does the thunder have a pass through option like the xtool p2?",
    "author_name": "@DPSS808",
    "published_at": "2024-03-01T17:15:49",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgyD_yk8BiniuQKaKnp4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "You missed the MOST important aspect of this. Legalities. You cannot always create products from brands, names or trademarks. Just because people are selling it on Etsy, does NOT make it legal.  there are SO many illegal items on Etsy. I've liked many of your previous videos, but this one is kind of a disservice to your viewers.",
    "author_name": "@RonKillian",
    "published_at": "2024-03-01T05:17:42",
    "like_count": 35,
    "reply_count": 6
  },
  {
    "comment_id": "UgwD4qkyznLP_fB2Adh4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "I know it's not quite an apples to apples comparison, but would you put it over xtool d1 pro?",
    "author_name": "@gregorybarajas7528",
    "published_at": "2024-02-29T21:39:14",
    "like_count": 2,
    "reply_count": 0
  },
  {
    "comment_id": "UgzFbWE_yxU9nyKhP_14AaABAg",
    "video_id": "OdN45lx-wRA",
    "video_title": "My Favorite Laser Design Resources (Free and Paid!)",
    "comment_text": "Even as someone who is \"in with lasers\", your list is such a valuable resource! I appreciate you taking the time to compile this for us!",
    "author_name": "@Samcraftcom",
    "published_at": "2024-02-29T03:50:24",
    "like_count": 9,
    "reply_count": 1
  },
  {
    "comment_id": "UgwgOa-CkU6zcNLUyT94AaABAg",
    "video_id": "OdN45lx-wRA",
    "video_title": "My Favorite Laser Design Resources (Free and Paid!)",
    "comment_text": "Great video. I am thinking about buying an RM laser, I currently have a Roland VG3 540 printer. I am thinking they will pair well together.",
    "author_name": "@AJVALDEZ",
    "published_at": "2024-02-29T03:37:24",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxpmd3ruuMjYAB078x4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Wouldn't mind seeing a video on how to make the laser maps for smaller cities if thats something you know how to do!",
    "author_name": "@JMJCustomWoodworking",
    "published_at": "2024-02-28T19:37:31",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "Ugw6YsPZDU06qh0nf4B4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "just ordered one with your code. did the 22w and honeycomb and got a 200 usd discount, thats nice. ty!",
    "author_name": "@el_super_laser",
    "published_at": "2024-02-28T17:52:48",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgwuHPpoN119WFK8BDJ4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Any videos you want to do on developing, marketing, and growing a business I would love to see.",
    "author_name": "@jackhelm9852",
    "published_at": "2024-02-28T14:33:35",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "UgyG2Lu6TNRcU72gMnd4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Do any of the metal engraving machines have an option to do curved surfaces like on a yeti type cup? Also an absolutely awesome vid. Any of the higher end models you can recommend for the Aussie market?",
    "author_name": "@Gravattack",
    "published_at": "2024-02-28T13:32:46",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxqwL--ozl7cHp2WiF4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Great info in here Brandon I especially like the planning budget tool you shared that’s going to be super helpful for a lot of people.",
    "author_name": "@ChadsCustomCreations",
    "published_at": "2024-02-28T12:23:45",
    "like_count": 5,
    "reply_count": 1
  },
  {
    "comment_id": "Ugw5ajITFP3AH1niGgR4AaABAg",
    "video_id": "pKlWvRaqils",
    "video_title": "The ALMOST perfect laser: The xTool S1 Laser Review",
    "comment_text": "I have an M1 and have enjoyed it a lot. The camera, however, I have found is just simply not precise. It is a fish eye view that becomes nearly useless when trying to position anything that is not dead center right under the camera.",
    "author_name": "@NMayhem",
    "published_at": "2024-02-28T09:37:14",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw39xKJegl8sLtQ8cN4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Would you allow me to use the footage of your high altitude balloon VR 360° video? I would of course fully credit your channel.",
    "author_name": "@primonomeultimonome",
    "published_at": "2024-02-28T06:06:27",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "UgzhrvniJ4u1TMckHC94AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "As always, THANKS for the great information.  I'm still to inexperienced with my laser but once I've figured it out much better I was thinking about doing something like Etsy and this video and the file you shared will definitely help to determine if I think I could do that in the end.",
    "author_name": "@markjohns4651",
    "published_at": "2024-02-28T05:48:13",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgwBOIVc62EwqPJitix4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Have they updated it so you can control in lightburn yet, or is it exporting gcode then opening in their software and run that way?\n\n(Not a make or break, but a bit confusing that they list as lightburn capable, but it isn't integrated fully yet)",
    "author_name": "@justinbanks2380",
    "published_at": "2024-02-28T02:18:11",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw-ZzNZLAP8ZlXUsNN4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Super helpful on using it as an example to see if you can get enough money on something to see if worth it for you",
    "author_name": "@justinbanks2380",
    "published_at": "2024-02-28T02:16:17",
    "like_count": 3,
    "reply_count": 0
  },
  {
    "comment_id": "UgxnE0X1X0Ec6GkYOAZ4AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "can you substitute for nitrogen instead of CO2? only asking because Canada has a tax on CO2??",
    "author_name": "@Mr.WizardFrumble",
    "published_at": "2024-02-27T23:10:39",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxMHHmxX03f0nZVoS14AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "I spent a summer in Athens when I was in college. That was the best summer of my life.",
    "author_name": "@CornerCreekWoodworking",
    "published_at": "2024-02-27T21:57:24",
    "like_count": 4,
    "reply_count": 1
  },
  {
    "comment_id": "UgzHKCa88E4EVJj4Dot4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Another great video. I have a Xtool s1 and  sure  would like  videos  on making product with the S1....Thanks",
    "author_name": "@chrisoliver3851",
    "published_at": "2024-02-27T21:40:21",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgxF3eCyurfZmANTIGx4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Great video!  I have been on the fence about trying to sell the stuff I recently made with my laser.  I sort of got addicted to making comic book corner art pieces and originally, I was just going to keep them, but I really don't have the room for them at home.  I've been debating on whether or not to setup an Etsy shop.  I really appreciate all the info and effort. Thanks!",
    "author_name": "@danthemakerman",
    "published_at": "2024-02-27T21:11:11",
    "like_count": 3,
    "reply_count": 2
  },
  {
    "comment_id": "UgwyTz36h5WNRxrai9t4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "I don’t see how any of these strategies would work at all for somebody starting in 2024. Etsy is an absolute mess of sludge from drop shippers dumping junk from Temu, Ali Express. Every social media platform blocking any promotions for Etsy stores at every step of the process up to and including shadowbanning accounts and nerfing engagement entirely. This doesn’t even account for how much AI generated images have completely swarmed other store platforms to the point that it’s hard to tell what is a real storefront or just another grift. \n\nBy all means prove me wrong, but the strategies that worked in 2017 from standstill are no longer effective today. Perhaps this video would be better suited for people who already have stores and just need a few tips, but then a few sections of this video wouldn’t be relevant to them (e.g. pricing etc)",
    "author_name": "@Jimgress",
    "published_at": "2024-02-27T21:03:25",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwlmxRyD-6DfpRtNUp4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "ohhhhh shitttt i'm in DOUGLASVILLE GA (20 mins west of GA).... MY MANNN!!!",
    "author_name": "@torodatruth",
    "published_at": "2024-02-27T20:41:18",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgwOnS0FAxszHFNuAzV4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "Couldn't get the link to work on my MAC. Maybe me...",
    "author_name": "@terryclair2914",
    "published_at": "2024-02-27T20:38:49",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "UgyGCwl_MwXDbS6e20B4AaABAg",
    "video_id": "9oDRPfy0Eso",
    "video_title": "Make This With Your Laser To Leave Your Day Job",
    "comment_text": "You mentioned a program for seeing what is trending on Etsy, what was that?  I'd hate to see you delve into SEO, as that's not the thing, but maybe some other tools we can use to asses our shops' performance.",
    "author_name": "@chance9979",
    "published_at": "2024-02-27T20:27:43",
    "like_count": 1,
    "reply_count": 3
  },
  {
    "comment_id": "UgybYK5XsTmpPvXz2QN4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "I heard there is actually a 70 w laser available now or soon",
    "author_name": "@bestyoutubernonegraternumber1",
    "published_at": "2024-02-26T19:34:54",
    "like_count": 1,
    "reply_count": 2
  },
  {
    "comment_id": "UgxwciCXaf250YwIa_N4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Hi Brandon,\nWhat combo (CO2+Fiber) do you recommend for someone who wants to engrave metal and other materials in addition to cut wood materials for business?",
    "author_name": "@LadHusbandDad",
    "published_at": "2024-02-26T17:14:14",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugwk-0JoBOQPjM9frZd4AaABAg",
    "video_id": "gvOL0MKGr84",
    "video_title": "Top Laser Engravers and Cutters to Get in 2022",
    "comment_text": "I want to cut 1/8 th inch to 3/16 inch light plywood for model aircraft and boats which laser would you recommend",
    "author_name": "@Bear049",
    "published_at": "2024-02-26T16:31:32",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxT4gwobEzZlpfrGrh4AaABAg",
    "video_id": "5Id6Ba2cXE4",
    "video_title": "ORTUR'S BEST YET! - Ortur Laser Master 3 Review",
    "comment_text": "Hey I’m considering buying a laser diode engraver/cutter for using in my leather shop to help me cut and engrave leather with art etc. I was considering these Ortur and x tool machines but then I started reading reviews saying that the motherboards fry in them because they have issues with grounding out and the company is a nightmare to get ahold of and deal with. So what’s the deal? Are these good or are they garbage? Any input would be appreciated as spending a grand or so on any gear at the moment is a bit of an expense for me currently. I can’t afford to be throwing money away on a product that’s going to work for a week and then fail on me. So what’s the best machine for cutting/engraving leather even if it does cost like $1000-2000~ that won’t go and crap out on a guy?",
    "author_name": "@GaryJacobs-q2e",
    "published_at": "2024-02-25T23:34:45",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwZO1CwCm1CnbIyFVl4AaABAg",
    "video_id": "4UWmLxBdxcg",
    "video_title": "Will this Feature Change Lasers Forever? Gweike Cloud RF Laser Review",
    "comment_text": "I cant find any info regarding the max cutting depth of the RF have you done some test for this too?",
    "author_name": "@F57771",
    "published_at": "2024-02-23T20:11:04",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgzfY3xFKDKZnn72VVV4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "What would be the best to engrave anodized aluminum and clear chromate coated aluminum? Thanks for the advices!",
    "author_name": "@bazookagros",
    "published_at": "2024-02-23T17:44:35",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwpSRz-_zIBy5OZdVx4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "Thank you and Congratulations 🎉for your great videos. Cheers!\nSir, May I ask your opinion...\nNow that you have quite an experience with different laser machines and using them for your business, would it be wise for me to already buy the more relatively expensive machines (xtool) to start my cutting & engraving business?\n Or should I start with cheap ones and upgrade later on?\n Would this come more expensive in the long run buying these  cheap laser machine and upgrade to Xtool? \nShould I just master my skill sets with the cheaper machine and relearn the more expensive machine in the future? \nIf you were to start over, what would you do? \nI have a starting capital of $10k.\nWhat machines will you recommend? \nI'd like to learn from champagne glass engraving to large multilayer plywood art cutting like Mandala arts.\nBeing now a retiree, I have  all the time to focus and learn the trade.\nI would appreciate if you can help me decide.\nMany thanks,\nAlvin",
    "author_name": "@al_vin007",
    "published_at": "2024-02-23T11:42:09",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzhEoM3Ec7b8tECJn54AaABAg",
    "video_id": "ENCJEaBGFKQ",
    "video_title": "Why do these lasers cost so much?",
    "comment_text": "AP Lazers? What are your thoughts on them? Would love to see you review AP.",
    "author_name": "@greenwithNV",
    "published_at": "2024-02-23T11:02:13",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwWEx8fYtXGLNSBj2h4AaABAg",
    "video_id": "6EP1xBCK2yQ",
    "video_title": "Is the future of lasers?  -  WeCreat Vision Laser Cutter & Engraver",
    "comment_text": "going to get one soon, hoping it will cut 1/2 wood and do 3d engraving",
    "author_name": "@mtz3843",
    "published_at": "2024-02-23T02:34:09",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwyLJ8pf0FeopCmFJB4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "My understanding is while the customer service is here bit there is no quality control once it arrives.  Thats from Omtechs mouth.",
    "author_name": "@craigtallant4149",
    "published_at": "2024-02-22T18:07:42",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgzOrHAFHv9a5yrLte94AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Dang, I didn’t see that a couple days ago on their site… Got the M1 instead of the Falcon2 only because of the case. Ah, well…",
    "author_name": "@wowareolys",
    "published_at": "2024-02-22T08:45:26",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyMIsyKmCiCs2WtMmV4AaABAg",
    "video_id": "15b3sLZ5pkY",
    "video_title": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "comment_text": "Unresponsive customer support. Attempts to seek assistance with engraving problems were met with slow response times and unhelpful advice",
    "author_name": "@TabBrain",
    "published_at": "2024-02-22T03:52:02",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugzy86CCEZktWsQStzh4AaABAg",
    "video_id": "aBj0mJezcFU",
    "video_title": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "comment_text": "Overpriced for its performance. Comparable OMTECH CO2 lasers on the market offer better features at a fraction of the cost",
    "author_name": "@TabBrain",
    "published_at": "2024-02-22T03:40:22",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugyjo-x7BdZncVqbzKV4AaABAg",
    "video_id": "15b3sLZ5pkY",
    "video_title": "$4000 cheaper than Glowforge AND better?  OMTech Polar Review",
    "comment_text": "Fluctuating power output. The OMTECH CO2 laser's power levels vary, causing inconsistent results and ruining our projects",
    "author_name": "@TabBrain",
    "published_at": "2024-02-22T00:12:41",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzlMmrWqu74Cn6M2_N4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Could you share de model reference of the 1.6 module ? Creality told me it's the module  that can be adapted on a 3d printer but not its reference.\n\nI would also like to know how it's wired to the frame so if you can share the wiring on frame and module side it would be nice ! \n\nThanks !",
    "author_name": "@cyrilb.3157",
    "published_at": "2024-02-21T23:19:05",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw_Hr_J25d1zZZeMSV4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "I think you are good with the visible light...it is the light outside the visible spectrum that is the issue",
    "author_name": "@TFitz",
    "published_at": "2024-02-21T20:36:02",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugw5LCnHDsaTaQb6LSx4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "man, you should have reviewed the Lasermatic in 2023. Everyone is copying their design and failing.",
    "author_name": "@LSEngraving",
    "published_at": "2024-02-21T19:53:25",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "Ugz4kpLy83JC8WoStZh4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "If you are planning  \"doing a breakdown of Creality, Roly, and xTool soon\" can you also include the new \"iKier K1 Pro Max 70W Combo please\"?\nIt also comes with an enclosure and breaks the 40w barrier you mentioned.",
    "author_name": "@AllenCote4",
    "published_at": "2024-02-21T17:59:35",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugw9Ej4X9WtoyTyRzJt4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "sorry  i have cnc laser whit a 80 watt from AliExpress 12 volt 2x 40 whatt lazer insite diode laser",
    "author_name": "@Gospelfriek",
    "published_at": "2024-02-21T10:23:56",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgxeQXOonnftdaE48z54AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Wrong! 40w is not the max for a diode laser. Ikier has 70w and 48w versions.",
    "author_name": "@um4ooo",
    "published_at": "2024-02-21T09:52:49",
    "like_count": 0,
    "reply_count": 2
  },
  {
    "comment_id": "Ugywh27DzoR-9B1NKT94AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Looks great but what about extra height for a rotary or cutting something bigger than the laser bed size?",
    "author_name": "@gerritgeldenhuys2763",
    "published_at": "2024-02-21T06:15:53",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "UgwbhN2GcQsNWCfMTZR4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "So you have to engrave leatherette patches on sheet first with small watt laser and then swap to 40 watt laser to cut? How it would know the registration after swapping heads? So it not off?",
    "author_name": "@Born2Wander",
    "published_at": "2024-02-21T05:12:11",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugyx3HQBcbBU-e0Yuvl4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "2 different companies are now making a 70w diode laser and even have heads to switch to a 20w fiber laser add on, way better then the crap xtool 2w module for the same price lol",
    "author_name": "@paleogeology9554",
    "published_at": "2024-02-21T04:40:43",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "Ugx3HfKBurGurOtN1TB4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "I love the enclosure on this laser but alas I just purchased the XTool D1, Just waiting for it to arrive.  But I also have the We Creat and I love it the little I've used it, but I finally got my order of boards delivered today.",
    "author_name": "@markjohns4651",
    "published_at": "2024-02-21T03:22:20",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgxQHN1FMxnYYiz2c514AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Use what you have where you’re at . Stop thinking the next tool is going to help. I get sent countless products but when it comes down to it , you need to actually make something, please believe in yourself more than some snake oil tool.",
    "author_name": "@hacklabdesign",
    "published_at": "2024-02-21T02:53:36",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "Ugx7S30dh9u_92z3zdh4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Here you guys are pushing these >$1k lasers when you can just get a real K40 for like $400 :[",
    "author_name": "@ThantiK",
    "published_at": "2024-02-21T00:56:26",
    "like_count": 3,
    "reply_count": 6
  },
  {
    "comment_id": "UgzOm4PC-M4T4g2qvNN4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "wooowww.. genmitsu L8, lasermatic mk2, and now this... i think this one is much better.. :D",
    "author_name": "@AniMind2875",
    "published_at": "2024-02-20T23:19:01",
    "like_count": 0,
    "reply_count": 2
  },
  {
    "comment_id": "UgypNd-x8Y_fJ_NLF5Z4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "How safe is it? Is the enclosure rated to ANSI Z136.1 standards? What is the OD rating?",
    "author_name": "@dubmfg",
    "published_at": "2024-02-20T22:49:32",
    "like_count": 5,
    "reply_count": 0
  },
  {
    "comment_id": "UgzsjUg3OiPokEn2YLR4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Not laser friendly at all I need help! I want to know which laser would be best for me to use for cutting sublimation blanks out. The glow for just too expensive for me. I’ve looked at the Xtool M1 and two others they have. What’s the most reasonable priced for for the best results?",
    "author_name": "@rhondarhodes1586",
    "published_at": "2024-02-20T22:21:12",
    "like_count": 0,
    "reply_count": 3
  },
  {
    "comment_id": "Ugz7Cylb2J6Rm1Dtla54AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "How does this compare to the Roly laser magic?\n\nWhich would you recommend",
    "author_name": "@ShelbyWeatherbee",
    "published_at": "2024-02-20T22:05:35",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgxyTYu1CfW-r0ZyVvB4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "It's great to see so many companies jumping on to making enclosures for their diode lasers.  Great video!",
    "author_name": "@danthemakerman",
    "published_at": "2024-02-20T21:51:19",
    "like_count": 4,
    "reply_count": 0
  },
  {
    "comment_id": "UgzRtSG7jXMespr7DpF4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Thanks for the video! Very informative and it looks like  a very nice machine with a lot of thought put in to it. Curious as to why they would only offer a 1.5 watt laser for regular engraving? Standard seems to be 5.5 to 10 watt now. A 1.5 watt seems way to slow for my liking. How many lasers are integrated in to their 40 watt laser? Again, great video! :)",
    "author_name": "@disignscdn",
    "published_at": "2024-02-20T21:44:25",
    "like_count": 0,
    "reply_count": 2
  },
  {
    "comment_id": "UgykUk6sF9we3eFqBI94AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Seems the trend for future machines is defined. WOnders how long the 300$ lasers will still be allowed and available.",
    "author_name": "@gilaraujo",
    "published_at": "2024-02-20T20:51:15",
    "like_count": 3,
    "reply_count": 1
  },
  {
    "comment_id": "UgzG-awxVmtOUAMhenF4AaABAg",
    "video_id": "F3Zls-E55zw",
    "video_title": "Finally A Desktop Laser Cutter That Is (Mostly) Safe.",
    "comment_text": "Rip 2019 - 2024 or maybe rip my wallet for a laser diode",
    "author_name": "@LuKe411995",
    "published_at": "2024-02-20T20:06:15",
    "like_count": 6,
    "reply_count": 1
  },
  {
    "comment_id": "UgzQKAWorExG9tf44BR4AaABAg",
    "video_id": "OdN45lx-wRA",
    "video_title": "My Favorite Laser Design Resources (Free and Paid!)",
    "comment_text": "maybe have a list somewhere, or atleast show the adressbar",
    "author_name": "@Actio83",
    "published_at": "2024-02-20T19:46:11",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugxouwvcn2pHsISEMvt4AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "Hmm… And right after swearing on his grandmother’s grave that it was the best value for under $5K, what happened.  They jacked the price by $500.  Yep 10% hike.  Hope his grandmother is okay!  The recent “inflation” con continues, eh?",
    "author_name": "@BobGarrett66",
    "published_at": "2024-02-20T19:39:42",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgziQq_xT6ssfxSM28x4AaABAg",
    "video_id": "emC8Ojz8LK8",
    "video_title": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "comment_text": "Thanks! Hopefully one day, NASA will be able to afford a 360 camera.",
    "author_name": "@derp8575",
    "published_at": "2024-02-19T13:52:58",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgzSkC7rhbKKrtaKNVd4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "In your option would this be a bad idea to use this as a take to the craft shows with me? I know it’s bigger but for the cost and how well it’s made can’t beat it. Costing less than the actual portable and being able to engrave bigger things? If not any ideas? Thanks",
    "author_name": "@shawnm4718",
    "published_at": "2024-02-19T00:17:08",
    "like_count": 2,
    "reply_count": 1
  },
  {
    "comment_id": "UgyyPDN2fIjpF3-Pg1t4AaABAg",
    "video_id": "TAE1QBmVYSI",
    "video_title": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "comment_text": "Be advised that if you have purchase and receive a defective unit Longer has no customer support. I called and emailed after purchasing one of their units do to it having issues and not feeding any filament and PLA, TPU, PTGE and they will not respond. Furthermore they blocked my number from calling them as now it goes directly to voicemail but when I restrict my caller ID the phone rings before being directed to voicemail. I would avoid this company all together and picking an alternative option..",
    "author_name": "@joshuawolfe3669",
    "published_at": "2024-02-18T07:29:27",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxBj0Sy7HnKfQsTO5J4AaABAg",
    "video_id": "HvgyRSbQUTI",
    "video_title": "Worth it? How the xTool P2 CO2 Laser Stacks Up Against the Competition",
    "comment_text": "Great video. I am trying to figure if a co2 laser would be good for my small business. I currently own a Roland VG3-540 and was thinking about making custom foam boards cutouts. I wonder if the laser is the answer.",
    "author_name": "@AJVALDEZ",
    "published_at": "2024-02-18T05:56:04",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxjRDnlwQ21d_KMpEd4AaABAg",
    "video_id": "paDgKFKD6yE",
    "video_title": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "comment_text": "Really enjoyed the video. Just purchased and waiting on its arrival. Where are the test files that you mentioned? I do not see them in the links",
    "author_name": "@ASHLEYSMITH0727",
    "published_at": "2024-02-17T20:18:00",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgzJMCp4Cd8zbvyifQJ4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "You are obviously very knowledgeable but to be honest I am absolutely not lol I am lost.  I was hoping to know what I would need to invest for a machine that engrave (all materials) and cut.  I’m just a crafter interested in extending my repertoire and not to have to run to the craft store to get wood cutouts or letters.  TYIA",
    "author_name": "@brigittegousy203",
    "published_at": "2024-02-15T23:34:39",
    "like_count": 9,
    "reply_count": 1
  },
  {
    "comment_id": "UgxqyKBW9HDRGuZhR254AaABAg",
    "video_id": "pKlWvRaqils",
    "video_title": "The ALMOST perfect laser: The xTool S1 Laser Review",
    "comment_text": "Thanks so much for the great information.  How does this compare to the Creality Falcon2 40 watt?",
    "author_name": "@MakerDan55",
    "published_at": "2024-02-15T22:58:26",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxHkmdXgfaQeK3QQFR4AaABAg",
    "video_id": "3r6YwFF_tME",
    "video_title": "What Can a $500 CNC Do? Genmitsu 3020 Pro Max",
    "comment_text": "300*200 is just a bit on the low end, would love to find an entrypoint 300*300 cnc",
    "author_name": "@jeroenok9635",
    "published_at": "2024-02-14T00:16:12",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgywVH7E_qGTfzJ6LmF4AaABAg",
    "video_id": "HvgyRSbQUTI",
    "video_title": "Worth it? How the xTool P2 CO2 Laser Stacks Up Against the Competition",
    "comment_text": "Do you know if I can use Adobe Illustrator to pull my projects onto the xtool P2 software? I currently have 3 GF Pros and use Adobe for all my projects and then load right up on GF. I'm currently looking for a different brand laser because GF Pros break every 3-4 months I've had about 15 units in the last 3yrs! Thank you",
    "author_name": "@TheDaily-Bird",
    "published_at": "2024-02-13T16:47:51",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxZL9lsyrIQcSputKt4AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "I just want nice engravings, I don't plan on cutting thick wood as I will use a band saw for that.  My budget is 500+",
    "author_name": "@davidphan70",
    "published_at": "2024-02-13T00:57:53",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgwKf1iS3nb6sGvCdXZ4AaABAg",
    "video_id": "hDMTWUKVLVU",
    "video_title": "$2K Cheaper, 2X Better? - The Thunder Bolt Desktop Laser",
    "comment_text": "Still too expensive.  Why pay twice the price though??  I have twice the machine for less than half the price.  Get the chinese red black if you have space for it.  Thunder uses the same exact chinese parts.     I always recommend: https://youtu.be/Uck5EkeJ_2M",
    "author_name": "@chaucer44",
    "published_at": "2024-02-12T15:01:31",
    "like_count": 0,
    "reply_count": 1
  },
  {
    "comment_id": "UgyxHx2O0eZNUz1Eud54AaABAg",
    "video_id": "1KVInFhiKUM",
    "video_title": "The Best Laser Engraver & Cutter to Get at ANY Budget",
    "comment_text": "The most suitable laser for cutting natural and artificial leather?",
    "author_name": "@18senelis",
    "published_at": "2024-02-11T20:49:09",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgyUT0f3yfY0HazDkDh4AaABAg",
    "video_id": "eSXvnfVeF5g",
    "video_title": "This has some Serious POWER! Atomstack X20 Pro Laser Review",
    "comment_text": "Oh boy, get ready to hit delete on this video when the A70 pro comes out. I just think I’m going to buy it. Could you imagine that as your first ever engraver? Im so excited.",
    "author_name": "@reedrobb",
    "published_at": "2024-02-11T08:18:35",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "UgxhZDTBT_Cx8x1tZ5Z4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "I have the 10 watt Roly.  I really like it.  It works great.  It was able to cut through 7mm cedar.  I have kids so I like that it is fully enclosed.  Using its wireless, the Roly can act as a web server.  I load designs onto a micro SD, make the Roly act as a web server and I use the browser on my phone to tell the Roly which file to cut.",
    "author_name": "@harryragland7840",
    "published_at": "2024-02-11T00:10:06",
    "like_count": 6,
    "reply_count": 1
  },
  {
    "comment_id": "UgwKucGS1rBWw1LvHsJ4AaABAg",
    "video_id": "XHsf7Hzs-0g",
    "video_title": "Can This Laser Beat the Competition? Sculpfun S9 Laser Review",
    "comment_text": "I have a sculpfun s9 450x900 extend version,3D prinding benchmark and serice engineer with Cad Cam design trainng. (Making 3D parts from  sketch or technical dwg. Provided with BOM if not) and i still dont understand! Hard wood,not doing it for me! Regular wood? The fibers are going to burn and the contrast and shades are off. Recomandation! Flat soft wood,No fibres! Even! For portrait and face,use jarvis settings in Lightburn for good shades in Peisaje!",
    "author_name": "@lazarcata4112",
    "published_at": "2024-02-10T15:47:41",
    "like_count": 0,
    "reply_count": 0
  },
  {
    "comment_id": "Ugyr7p7KjT-tghPMMXR4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Is this a joke? I came for a \"Lasermatic review\" - I got opinions about a machine that has NEVER BEEN USED, followed by an Xtool advertisement.",
    "author_name": "@gpsblu3627",
    "published_at": "2024-02-10T13:43:10",
    "like_count": 1,
    "reply_count": 1
  },
  {
    "comment_id": "UgyByyNUM0zhYRT8k-54AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "No mention(not even on their site) of the maximum material thickness that can fit under the lens...\n\nWhen you start getting into lasers with power suited for primarily cutting that matters as 30-40+ watt laser will work for 15mm plywood and 19-22mm particle-board flooring which opens a whole other world as far as the functional tools and jigs you can make with those materials...",
    "author_name": "@mastermaker666",
    "published_at": "2024-02-10T12:23:52",
    "like_count": 1,
    "reply_count": 0
  },
  {
    "comment_id": "Ugy-Cv1zmTN32kBxIZF4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Laser entering the same territory that 3D printers did with the advent of BambuLabs..... been waiting for this",
    "author_name": "@mastermaker666",
    "published_at": "2024-02-10T12:00:02",
    "like_count": 2,
    "reply_count": 2
  },
  {
    "comment_id": "Ugz2yS-yfM7iBVS7WJN4AaABAg",
    "video_id": "R3eeLYiMFzw",
    "video_title": "The Desktop Laser to Get.",
    "comment_text": "Am hesitating between the WeCreat and this Lasermatic. Tend to lean to the WeCreate but first need to see what their price in Europe is going to be (expected in EU in March).",
    "author_name": "@abbofun9022",
    "published_at": "2024-02-10T09:28:42",
    "like_count": 1,
    "reply_count": 3
  }
]