[
  {
    "text": "Bought a Full Spectrum 18 x 24 machine 3-1/2 years ago at approx. $9,000. Had to replace laser 8 month later. ($600) 2-1/2 years old and Main processor and power supply failed. Called F.S. and got nothing. They had stopped making the main control board and offered NO assistance. Bought a new power supply and Main processor from Light Object and got machine back up and running. Quite different software to learn, but, now I prefer it. I CAN'T recommend F.S. for their customer service or warranty. Just had to replace an axis driver. Another $50 gone! Please do your OWN research!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "What would you charge to generate a vector file of Lake Jackson in Georgia and send to me for my laser?",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "Welcome back! It's been too long and I'm reall glad to see you haven't abandoned the channel.",
    "likes": 1,
    "video": "Welded DIY Metal Bed, This is What I MESSED Up",
    "video_id": "yEoa70UNDnI"
  },
  {
    "text": "Hello, how long continuous work can this machine work, for example only engraving in 3mm comparison?",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser",
    "video_id": "12qsUg0XpTo"
  },
  {
    "text": "Hi great video. I maybe missed it but what Laser watt did you use for Jimmy? thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Here’s a real one. No fish eyed lenses https://youtu.be/WwimocU0IIc",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "there are a bunch of fiber lasers around 2k  usd , just have to ship them from china, i know a good one that i have shipped to the us before.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Would this laser be able to fit a tumbler spinner inside to engrave?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "is it possible to change the engraver laser for a stronger one?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "CO2 laser is ironically the treatment I get for my face/skin lol!\nThanks for the information! Are the first China lasers good for acrylic blanks? Thanks",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "is this machine can laser mark in to metal like alloy or stainless?........ thanks",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Our company's products are mainly laser machines. Those who are interested can visit our website:www.danuomachinery.com",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Felt like you went through my garage and stole all my tools! your miter saw, router, drill press, tape measure are same as mine 😁👍🏼",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Storage for the Shop",
    "video_id": "0N1_P62GMuw"
  },
  {
    "text": "I tried to buy from GearBest and they asked for a copy of a utility bill to \"verify\" my identity. I didn't send a copy of my personal information because that seemed sketchy/scammish and they cancelled my order. I would like to buy one of these but is GearBest the only place to buy it?",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Wow 🤩 how the heck do u know computers and woodwork geez!",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY",
    "video_id": "d3paxgFMtYk"
  },
  {
    "text": "How much this machine l want once where l can buy it please ?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Is there a way to engrave on the leather and metals like copper and silver?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Do you sell this machine? I need another one like this",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Can you leave this machine doing its work while away from home unsupervised? Like, any risk it might cause a fire?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I have been watching your videos with growing interest and some hope in my creative heart! I do have one burning (pun not entirely intended) question. With enough passes, will this machine cut through  0.3 mm hardwood veneer? If so, will it leave discolouration around the edges? And finally, if the answer to my initial question is no, can I purchase upgrades for it that can cut through 0.3 mm hardwood veneer?\n\nThank you for your time in answering this for me. A lot, creatively speaking, is riding on any answer you can give. So no pressure, then! 😜",
    "likes": 3,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Hello I’m having trouble linking my same laser to light burn can you explain your settings? Please!",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I haven't been able to find a video of it rastering, outlining, and cutting. Can you demonstrate more how that works?",
    "likes": 2,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Great video!! Helped make my final decision. The 1 thing I did not see covered is on the Chinese 50 watt, some of those models come with a pass through slot. No one seems to know how tall the pass through is. It's frustrating. Will a baseball bat fit through it? Also, Where can I find info on these sprays and powders I keep seeing?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Do you have any knowledge of this being able to engrave denim ?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I would like a review to tell me the differences between the DREMEL DIGILAB, GLOWFORGE & MUSE",
    "likes": 2,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Very new to Lazer printing/engraving. Would you be able to take handwriting and print it into a wood plaque? not really interested in font printing as much as I am transferring my grandmother's actual handwriting to a wooden plaque. She passed away last month and I have a idea of what I want to do for Christmas gifts but the more I watch the more I want to do it myself. I originally found the glowforge but can't justify the price tag at this point. 😬",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Great video I’m just starting out with fusion 360 seems a little overwhelming and complicated I’m going to check out your free course",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "It’s all about the time you spend sanding the hardwood...and sanding it correctly, and you my friend did NOT sand that wood correctly. You have to start the sanding process at about a 60 grit and work your way all the way to at least 320 or even finer. 60, 80, 120, 180, 220, 320...in that order. It’s a pain in the ass but if you want a hard wood like maple to look the way it’s should then that’s the way you gotta do it...otherwise leave it raw or lime wax it.",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "Hello, Great video!!!  I‘M new to the engraving world and looking for suggestions on a machine that engraves glass? Picture and/or words??",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Great video man! I feel silly for still using Sketchup! It seems so clunky and annoying (web) compared to how you made Fusion look. Definitely jumping ship today!",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Can any of these be used for metal cutting and engraving?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Circle of light from the Sun. Not curvature. Earth is tilted toward the Sun... HOW??? Hahhahahaha!!",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Hey, if you have a tutorial for light burn or laser garble could you link them to check out, thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Great video, thanks.  I just want a basic laser which will engrave fonts onto aluminium (doesnt need to cut) I’m in the UK.  Can anyone in the know advise please.  I know a couple of people have asked the same sort of question.  Many thanks.👍🏼",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "What are the dimensions, or a building plan? It look great.",
    "likes": 0,
    "video": "How to Make a Kids Play Kitchen: The Frame/Doors/Drawers!",
    "video_id": "XQVvOOVOt8g"
  },
  {
    "text": "Maybe you can guide me a little. I am looking for something that can do designs on polymer pistols (think heavy duty plastic). I would be looking at cutting in maybe 2 to 3 mm in depth max with an average of 1 to 2mm. It would be to adding custom design texture for enhanced grip. Any advice would be appriciated.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Great video, didn't quite see which one I should look into though. What would you (or anyone) recommend for burning onto chocolate or pies? Home use, something to spice up parties around here.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Anyone tried to engrave acrylic or glass ? Does it work i should I look for more powerful laser for that?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Nice design... I am thinking of building my own storage bed too...",
    "likes": 1,
    "video": "This is Why I Use Fusion 360 to Make a Bed.",
    "video_id": "ZB2fe-o41_c"
  },
  {
    "text": "Hi, great video - really useful and informative, thanks so much! I'm interested in creating steel cliches for pad printing (for Lego minifigures). Presumably I'd only need a small desktop machine? Also, would I need a FIBER laser for engraving on steel plates or would CO2 / Diode suffice if only engraving???",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Great video! LightBurn is seriously the best! I love how they are constantly improving the software to make like easier for users. <3",
    "likes": 5,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Excellent! I've watched probably 15 videos about this machine (I'm considering buying it) and yours is the first one that confirms I can actually cut 1/4\" plywood with it. Thanks.",
    "likes": 4,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "Would the Oturo diode laser cut cotton fabric?   Or even other fabrics?  We have a quilt store and would like to use it to cut out the shapes of fabric needed for kits.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I really like your vid. Please make a vid oon how u make that Catan game tiles. Thanks",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Would this be a good machine to laser flag unions? I obviously don't want to spend a fortune asa beginner to laser work haha",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Can i make same detail (9:18) with 5500mw laser head ? Because I love the detail, and i want to use my 5500 mw laser head",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "We have the weirdly similar internet brands. That is all.",
    "likes": 2,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser",
    "video_id": "12qsUg0XpTo"
  },
  {
    "text": "Small note: The laser is still only about 4-5 watts.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I was considering purchase of one of these a while back. I see prices have come down considerably,as they should have!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Hey, awesome video!\n\nAre there any 'how to put this thing together/set it up' videos for this specific machine?",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "What is the best laser cutter  to vector cut aluminum foils?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Does is fit good to engrave (not cut) leather ? I really want to buy one but if it is good for, I don't know what laser power will be the best to make fine engraving on leather. If you can help me you'll be the best ^^ (sorry for my english) Regards",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Says in teh video everyone asks about laser cutting metal, addresses this question in reasonable depth in video.\nComments section: \"What laser would you recommend for metal?\"\n\nSeriously guys? xD",
    "likes": 29,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Great primer on the basics of laser engraving and the machines available. Thanks!",
    "likes": 7,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "If you like woodworking plans, you'll love woodprix. Get inspired by the endless possibilities of furniture plans and other buildable wood projects, both for indoor and outdoor.",
    "likes": 0,
    "video": "Carving a Baby Groot Planter out of Wood",
    "video_id": "Xu52e5qek1M"
  },
  {
    "text": "What kind of laser for cutting and engraving steel and aluminum?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Do any diode laser like the Ortur have a camera option for placement? What do you recommend? I am a beginner.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Where you aware how you said, “looks like Jesus” then said, “Hulk Smash” referring to his discontent of Jesus?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "they don't make 15 watt blue laser diodes , it has a 5 watt , they list the in put power  ( current ) of the laser NOT the optical output .",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Wow this was legendary. I’ve watched a lot of Fusion 360 training material, and this clears up a ton of things that had been confusing before. Well done! This is going to make a huge difference in how productive I am with this tool. Thank you!",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Thank you so much for this, it's a great to see a project from start to finish. It might help to pre-plan these \"tutorials\", you jump around so much, it's difficult to follow along. This would be for someone that has some experience with Fusion 360. Constraints are great, but not really beginner friendly, it would be useful to set dimensions at design time.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Curious why the bottom and drainage holes alignment matters at all - not sure you need a full bottom.  Couldn't you just have a few crossbars that support the internal plants rather than a solid bottom?  Especially if the planter box can't be seen from below.  Just a thought.",
    "likes": 1,
    "video": "How to Make a Cedar Window Planter Box",
    "video_id": "KYGUPqJ2bL4"
  },
  {
    "text": "Great job! I'd love to see a follow up with drawers if you ever got around to it. I love the drill press idea. I was watching Mortgage & Miter, he did a flip top for his drill press but I like the sunken one you did a little more. Easier than a flip top and you can fit more drawers/shelves under it. :-)",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Storage for the Shop",
    "video_id": "0N1_P62GMuw"
  },
  {
    "text": "I need an engraver to cut and engrave metal. Looking for stuff that would work for engraving guns. Any that u would recommend?",
    "likes": 2,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Have you tried the AP Lazer?  They make 4 different sizes, and with a life time of support.  Look they up at aplazer.com.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "tried to watch your video but got annoyed with how many ads youtube stuffed in there when I hit the 3rd ad before 8 minutes of video i gave up will just read the info on your site instead",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I truly enjoyed this video- Im still undecided on either the GF or MUSE 3D, only reason GF is because they offer the discount code and free shipping. But thanks for the videos!",
    "likes": 2,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "the site to get them shows they sell it also for 20watt laser as well right?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Thanks for the review, I am glad I found out that FSL is manufacturing for Dremmel before I make my purchase.",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "great job ! The quality of the videos is awesome. Hope it will work for u ;)",
    "likes": 0,
    "video": "This is Why I Use Fusion 360 to Make a Bed.",
    "video_id": "ZB2fe-o41_c"
  },
  {
    "text": "Does this model etch black anodized Aluminium ? I want to make small nameplates occasionally for the electric motors I build but don't wanna spend thousands for a fiber laser marking machine - eBay is confusing, the seller's of some of the 7 - 15 watt machines say that they can etch anodized aluminium whilst some of the 20 watt machines say that they can't etch anodized aluminium ? - Do you have a video or any info on which budget laser engraver would work to etch anodized aluminium without costing thousands to buy ?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I liked your review of the Ortur. You touched on all the subjects that mattered to me besides $$price",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Dude I’m loving your videos! Great stuff. Is there a laser you can recommend for use with an iPad? I’m a graphics designer and want to maybe engrave wood",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "everything is an import from china, dont matter what brand label is on it",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "TO EXPENSIVE THIS MACHINES............. THESE THINGS SHOULD NOT COST MORE THAN 1,000 DOLLARS THEY ARE ABNORMAL CRAZY .... THAT'S WHY THEY DO NOT PROGRESS ... THE APPLE SELL THEM BEFORE AT 10 THOUSAND DOLLARS THAT DOESN'T HAVE LOGIC I DON'T KNOW WHO IS CRAZY WHAT THEY DO PUT THESE PRICES.    I HOPE IN THE FUTURE THE LASER MACHINES WILL BE SOLD AT LOGICAL PRICES.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "So you set the parameters in your base project, and then they were available in all the subcomponents? That's not the case for me - what did you do to make them inherit the params? Btw the other Beginners videos I watched didn't highlight parameters like your video does - seems like a major feature, so good job with that.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Ortur can certainly cut. But it requires multiple passes. \nI got the snapmaker, and it does a great job cutting, mainly because it has a Z-axis. You do have to calibrate the Z-axis height for whatever material you use.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I wonder if I can put my router shanks and make it work with those ones. I have a small manual router (those 300 watts sold everywhere) and came with a 6mm straight, which I think could use it.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "ZAR stain is a surface stain from Ben Moore, I use that for finished pine and maple. Also, I wipe denatured alcohol with some water on the wood before staining.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "Super useful video, probably the best one i found. I've been getting into PC Modding and looking for a Laser that I can use for etching/engraving logos into Tempered Glass. Not entirely sure what the best ones would be for this kinda work? Would a Ortur get the job done?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Could I use this to add a logo on an aluminium can?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "just curiosity....how did you get that scar on your face?",
    "likes": 1,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y"
  },
  {
    "text": "It’s amazing I also had a glow Forge ad in the middle of this video. Never had one before",
    "likes": 14,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Absolutely off topic, but that water is bottled not to far from where I’m from. Lol",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Would this be able to cut vinyl stickers . Trying to avoid having a seperate vinyl cutter",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I'm building my own skateboards and hoping to engrave small pictures on the boards. will this work for that?",
    "likes": 4,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Houston we have a problem. \nThere is a ballon flying over the earth.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "I’m trying to really primitive designs, cutting through thin sheet aluminum, but at most 20x20 inch. Would those Chinese laser printers be good for that? If not which one would be?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I need something that can cut between 4mm-6mm clear acrylic sheet. Looking for something that can cut 18”x11” sheet. Any recommendations?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I just bought this laser.  I'm having trouble burning through acrylic paint down to the wood and having it look clean.  It looks distorted and doesn't burn clean down to the wood.  What other lasers does the Ortur accommodate that also accommodates lightburn?  Any ideas?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "You do go quite fast for beginners - I had to pause and rewind several times - BUT the information is very good, I was able to follow along (with a little extra effort), and I appreciate you putting this together :-) I especially appreciate you including parameters from the start; that's a very handy feature I'd not seen in other beginner tutorials, probably one I will use in every single project.",
    "likes": 7,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Hi.. which laser machine do you suggest to cut sterling silver sheets for jewelry making??  I read that 50 watts is enough, but i'm torn on which laser machine is best for it.  Please advise!",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Do you think this would work on leather for monograms and small logos?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "This here a real big, injun checkup. Yale have the devil's workshop instead o some needy van home scorner of the west.",
    "likes": 0,
    "video": "Build a Rubber Stamp with a Removable Handle // DIY",
    "video_id": "8CALEo7obec"
  },
  {
    "text": "So I have a question?  how does this laser gets delivered ?  is it UPS, FEDEX? and does driver call you before arriving with your laser?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Will this work on leather? The website also looks like it's an extension of alibaba or aliexpress. Is it made good, not cheap made? How long do you think it would last?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Branden, will you last engrave or etch brass key blanks?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I can't tell you how useful this has been for me right now.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Nice , I need A4 size Cutter & Engraver , it's it available in India",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "great video!!  quick question, i want to do some light cutting up to 1/4 of an inch and need some very find detail engraving on anodized surfaces.  I make yoyo's so the engraving would be in the bottom of a yoyo cup.   I was thinking about the machine you talked about at 3:32 mark of your video.   Thanks.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Hi how are you,, thanks for share..with you recommend for graving Stone ...Gracias",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Question....\nCan i engrave metal with this? \nSteel \nStainless steel \nPolymer \n\nI dont need deep cutting, just on the top engraving.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Beautiful work. My favourite herb is basil. About 3 minutes 28 seconds you have your head so close to the blade. Please be careful!",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box",
    "video_id": "KYGUPqJ2bL4"
  },
  {
    "text": "Hello! Asked this in your review video for different lasers, but I wanted to comment on your most recent video so you can see it! Love your content, I want to laser rubber stamps. Most stamps require about 1 to 1.5mm of depth in cutting to differentiate the printable area from the not printable. I saw your review of the Ortur, and I can get one with a little more powerful laser. (20W instead of the 15W, which as you pointed out is really like 6 watts vs. 4 watts) Do you think that will do the job? Thank so much!",
    "likes": 1,
    "video": "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser",
    "video_id": "12qsUg0XpTo"
  },
  {
    "text": "Great vid! I was hoping to make rubber stamps, usually the lasered ones go tops 2mm deep, probably 1 to 1.5 max on average. Will a Diode laser do it? Or do you think I need something bigger? Thanks!",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Great video and explanation.  Curious to hear your thoughts on a Thunder Laser Nova 24 60 watt?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Do you know a good CNC machine, bit or laser engraver that would be good to engrave smaller pieces of acrylic?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Funny story... the ad that popped up at the end of this was for the glowforge laser engraver LOL",
    "likes": 9,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Totally impressive with the 360 view.  Very steady photography. Thanks for sharing.",
    "likes": 9,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Have you tried cutting vinyl stencils or masks or removing anodized aluminium?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Hi good day. Thank you for your reviews. After watching all the lasers covered in this video, I'm not certain which laser is best to get. \n\nI want to make greeting cards and other paper related products. Which laser would you recommend?\nI would prefer if the software is not mainly on the net, already assembled and I wish to buy via Amazon. Thanks in advance for responding.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "What do you recommend for simply engraving names and time on finishers marathon medals??? Im thinking about getting a 20/30w laser.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Have you heard if the 45w is not a true 45w tube but a 40w pushed by an inadequate power unit?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Who would have thought a free 7k machine would be good.",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "What do you recommend to engrave polymer firearm grips and metal magazines?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "i wanna get the glowforge but hydroflask doesnt really fit in it... for engraving which one would u recommend?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "what’s the best and cheapest laser to use for clothing such as jeans and jackets?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Want to get into laser stippling polymer gun frames and engraving and etching gun parts. I'm too old to understand all this tech. Most confusing thing I've ever looked into.",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "That laser is actually a 4.5 watt, the input is 15 watt, little deceptive but nevertheless it's still awesome.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "You should Review Gcc, Epilog and Trotec as these machines you have reviewed are basic ones",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "What bit did you use to carve the rubber stamp? The size and name would be great! And what was the speed, depth you used? Thank you",
    "likes": 0,
    "video": "Build a Rubber Stamp with a Removable Handle // DIY",
    "video_id": "8CALEo7obec"
  },
  {
    "text": "I need to engrave a bunch of plastic key fobs with sequential numbering. I would like to line the bed alright a bunch and fobs and have it jump from one to another engraving the  numbers. I am thinking this might be a good time to get a laser. Can you recommend software and a laser that would be good to consider?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "$325 is not very close to $200 - the 7W is under $200",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Awesome project! I do not have those tools so if you were to sell one, what would it go for?",
    "likes": 2,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "Looks great!  BTW.. Lightburn also works on Linux, which is where I use it...",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  }
]