[
  {
    "text": "Good breakdown. I watched this a while back on my tv and forgot to comment.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I love fusion 360 way more then sketch up. I use it for woodworking 👍🏽😊",
    "likes": 17,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "you can do some decent stuff on these things,  I use it to cut out my kids pinewood derby cars.   I have to use a jig to hold the block on and the limited z causes me to have to run the derby car block thru the table saw first to bring the height down and do it in 2 parts if its a taller car. \n\nalso with the laser, I've laser engraved a flour tortilla. LOL",
    "likes": 1,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Where did you buy your butcher block? Did you make it?",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "A plane with a larger shoe will make flattening top easier",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "That rounding with the CNC is NICE! Great build (and love the final result)! We found you on Instructables, by the way. ;)",
    "likes": 0,
    "video": "Building a Bluetooth Speaker into a Side Table",
    "video_id": "xskyxhxku3Y"
  },
  {
    "text": "Depends on what you want to do.\n\nTo mess around and learn a bit while possibly making useful trinkets... these little machines are a good start.\n\nLow cost and see if you are actually going to do anything at all with it.\n\nWhen you find that the stuff you want to CNC carve is not going to be able to be done on the little machine, change it to a laser engraver and get a better CNC machine.\n\nThese little things will make some nice looking coasters and key chains and carve the color layered plastics for small signs.\n\nNot good for engraving brass really.\n\nIf you want to make a small number of thin aluminum sheet metal parts for RC models, the 3018 series CNC can do the trick.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "I do polished axes and blast the design on the head using vinyl as a mask. Would this etch the surface like sand blasting would?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "the engraving could be \"raster\" (the one you are using) or \"vector\", raster \"shoot\" on multiple spots and Vector follows the path, the firs is ideal to shades and the other one for silhouettes, you could change it on the software. gib it a try!",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Fusion rocks!  I tried Sketchup when it first came out and I hated it. Parametric modeling is the way to go. I’ve used Pro/ENGINEER and Solidworks at my various jobs. Fusion is free and does what I need and more.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Like your style. Well done addressing your errors and thanks for sharing. What was the tune when you were explaining about using glue and dowels (at 2 minutes) please? Thanks. 😊",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Thank you for all the information do you know if Fusion can do a PP as I have a DSP A18 controller",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Great video bro, that was awesome. What camera did you use that was about to record that long? Was there any temperature issue for the camera?",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Hi! What 's the color-effect of laser on black-finished metal?  Is it still black? Thanks!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I have a 6012 2.2kw machine. Yet to get my garage set up for it. Interested in a small machine like this, maybe a lil larger. What would be a dream machine with all the features you would want ?? Please link. This way i could keep my bigger machine for bigger projects.. ( now i wish i would have gotten a big machine ) \nWhat best engraver/laser for $500.\nWhat best in $1K price point.\nThanks!",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Laser input is 15 watts\nThe actual output is only 3.7 watts",
    "likes": 20,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "i do leathercrafting, can i use this on lasering text and simple designs?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I enjoyed this as well, and your candor at explaining mistakes (and not getting defensive in notes below) is super refreshing.  I signed up!",
    "likes": 5,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "I wonder if it would cut out wood veneer.  That's usually really thin.",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "buy some better safety goggles, you can still get light in around the sides",
    "likes": 3,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I've only made the 1 table and I made almost exactly the same mistakes. 😂",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "I hate YouTubers that make videos just to make money from. This laser is junk. unstable and too powerful for engraving. No seller or other co-seller don't tell you don't need big power for engraving. For nice engrave on cardboard or wood or leather 1 Watt is enough. over 2 watts burn and laser diode with big power have issues to focus. With 5.5 W u need minim 5 passes to cut 3 mm plywood, and edgy look ugly. This is just a commercial video. NO-VALUE for us!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "been using 360 for a couple years and still learned a trick or two, thank you!",
    "likes": 5,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Thank you so much for this!!!! I’ve used sketchup for years for all my projects but I wanted to learn fusion to take my projects to another level!!",
    "likes": 3,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Nice video. This seems needlessly complicated though when comparing to https://mapstyle.withgoogle.com where you can achieve the same effects, easier (at least when it comes to making laser maps)",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "what program do you use to create the grey scale images that you etch?",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "AWESOME! Thank you for your hard work and sharing this unique experience with us!",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Very cool!  Found your channel via Instructables and just subscribed.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "The air assist on C02 lasers is to keep the final lens clear from smoke residue and other contaminates.  It's to protect that lens for longer use.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Nice content across your channel! Thanks for making clear, easy to watch videos!",
    "likes": 1,
    "video": "Is a Budget $250 3D Printer worth it? Alfawise U30 Pro Review",
    "video_id": "-15hT4HioZo"
  },
  {
    "text": "Just wanted to thank you for sending me looking for \"Pulsar\" by Jakob Ahlbom. He needs the credit for the music. It was an awesome choice, really added to your great video. I had a lot of fun watching and replaying. Good work!",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Very nicely done. I realy liked it. Looks like a good project for school. But, as every flat earther can tell you, it's all fake. :-)",
    "likes": 7,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "OMG, you are soooooo talented, do you need a colleague? I want to make these things with you man. just wanted to say great job and pleaseee continue 😊😊✌",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Very close to ending up in the lake!  Cool video, actually saw 4 fighter jets fly by one after the other unless it was the same one looping around.",
    "likes": 9,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "I'm surprised the aviation authorities did not come knocking on your door. Do you realize how irresponsible that was to launch in a populated area? There are things in the sky called jets and airplanes that this could have collided with - or got sucked into the jet's turbine causing engine damage or failure. So irresponsible.",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Is that a flat earth I see..?\nGreat video tho. Thanks.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "I would really like to know what those F-16 pilots had seen on the their radar scopes!!\nPretty sure there were scrambled to check out that object that was not declared! :D",
    "likes": 25,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "I think the jet going by under the balloon while on it's way down was really cool. Great that it captured the sound as well.",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Get more lift with hydrogen and you can make your own just have to be a little careful.",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Ha, I only realized 20 mins into the video that you can pan and see all around...even after the video was over. That's pretty cool!",
    "likes": 117,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "I think the military plane was not accidentally. Maybe it was scrambled to check who is flying. In such case your project cost rises significally (tax payers money.. ).. haha :)",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Wow, it could have been a lot harder to find if it went into the trees.  Into the sub station I bet you'd never get it back.",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "I wonder how high it did went up before balloon pop",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Nice views with the camera glad you were able to recover it.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Wow that's cool. How much did it cost to send yoda in to space. I wouldn't try that here in greece because it would end up in the sea or top of a tall mountain 😆",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Do you do all these cuts freehand? Or how do you program the laser to cut?",
    "likes": 1,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "That is so cool. I didn’t realize you could move your phone and look around. That was really cool. I especially liked the launch and the balloon popping. \nIt’s great to see you finally made this happen. I have been listening to your tribulations on the podcast. That was a ton of work!\nThanks for everything you share!\nStan",
    "likes": 9,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "nice timing the piano note to the balloon popping. nice touch! @ 0:54-0:55",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Im at a total loss for words. I got a rylo for a few 360 vids and some better b-roll on my channel and this video completely kicks my a**. Kudos man, this is phenomenal!",
    "likes": 3,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Excellent work!  You can pause the video and still pan around the full 360 image which is one of the best bits of 360 video for me 😊",
    "likes": 2,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Can it cut stainless steel sheet metal? About 1mm thickness?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "That is so fantastic, Brandon! I was hoping to see a jet fly by...",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "The 360° view at the end is really cool—great job!  I’ve been hearing about this project and your setbacks for a few months now. Glad you were finally able to pull it off.",
    "likes": 11,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Your video is good and the final product turned out nice. But for what demographic is this? I don't know very many people that own their own jointer or planer. Unless that's your job or something you do quite often. I have a whole Workshop of tools and don't own a jointer. Maybe simplify it a bit for your everyday average guy. Other than that it was a great video.",
    "likes": 1,
    "video": "Build a Baby Gate (for cheap) // DIY Woodworking",
    "video_id": "zDffk0gFmVQ"
  },
  {
    "text": "This is all sort of awesome and the view is absolutely breath taking WOW!!!! Thanks for sharing your ups and downs on this one.",
    "likes": 2,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "If you are watching this on a mobile devise you can spin around and see everything. Mind blown.  Well done.",
    "likes": 5,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "That was epic. Loved seeing baby Yoda spin around.  Amazing how small we really are compared to the earth.  Thank you for sharing.",
    "likes": 5,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Brandon, this was incredible!!  I mean ever launched a balloon like that, but I want to watch all your other videos on the subject LOL. This is way too cool!",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Pretty sick - and you picked a great day for it!  How'd you track it down when it landed?",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Almost landed in the water.   Guessing you weren't planning on swimming for it.",
    "likes": 1,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "That is really cool wish the GoPro would have worked but still cool.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "I liked the 360 and being able to pan around. cool!  I've been wanting to do one of these for a while. Living near DC and its no fly zone make it a difficult process to make sure the launch and landing occur far enough away from DC.",
    "likes": 2,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Why didn't you upload all the footage from when you released the balloon?",
    "likes": 3,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Civilian GPS trackers are typically restricted to working under 18km, 59000'. That's to stop people like Joe Barnard from making operational ballistic missiles in their back yard :P \n\nhttps://en.wikipedia.org/wiki/Coordinating_Committee_for_Multilateral_Export_Controls",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "So great man Id love to give this a shot I almost cried seeing the footage from that it’s so beautiful the perspective you get",
    "likes": 3,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Well done.  I've been following your updates on your podcast.   I'm surprised there aren't more regulations on doing something like this.",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Hahah that was awesome! Your neighbors are probably like wtf! Haha",
    "likes": 1,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "What did you do to split the grayscale image into each individual layer?",
    "likes": 1,
    "video": "Laser Cutting Eleven's Head From Stranger Things (DIY Lightbox)",
    "video_id": "8EBuk62P1VU"
  },
  {
    "text": "I would be very careful in buying from them.\nThe first time I used one the 3D printed part broke down, after some hasles they sent a replacement part which arrive broken, on sending them an image of the part, I have since had no replies to emails. I must say that it was the worst 3D printing I have seen, holes everywhere.\nThe Machine they sent me was nothing like the one being shown here.",
    "likes": 1,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Maybe it's been answered... Breadboards obvious purpose is to help maintain the flatness of the top. The term comes from the style of the old bakery's cutting style boards that used similar construction.  The long table top looks like a giant breadboard.\n\n😃",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Will you upload the lightsaber model somewhere, i'd love to print my own.",
    "likes": 2,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Thanks for sharing! Your CPM is in line with what my well performing videos get",
    "likes": 0,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "Love your channel ❤️ working on building a diy  laser cutter! Fanatic information!! 👌",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "I'm about to say something that will make the wood movement police go crazy. But whatever. Lol. My experience supports it. \n\nWood movement... It's a \"common tale\" that as external humidity changes, so will your projects... Well... That's honestly not the case if you have your home well insulated and at a consistent humidity. Which most houses are. Most antique furniture doesn't break from wood movement when sitting in a house.... They break from wood movement when people put them in garages and barns where there is no climate control. Then the wood movement starts setting in and everything gets all crazy. And also .. wood movement can be overpowered and controlled. Just look at high quality sheets of veneer ply. \n\nIf you are building something for an interior job, honestly it will likely shrink a little over the next 1-6 months when bringing it in from your shop (especially if your shop isn't well controlled with it's humidity and temperature .)\n\nI've sold very expensive veneered signs, laminated chess boards with highly figured cross grain, and even tables with cross grain on them. As long as you expect a little shrinkage and it's gonna be climate controlled.... You honestly don't need much for wood movement. \n\nYou don't believe me? Go to the Las Vegas airport and go to the Jamba Juice inside the terminal. There is a hickory table there with no proper breadboards, held all together with glue and dominos. Breaks all the rules and it's perfectly flat and strong with perfect joints. \n\nAlso, the Samurai Carpenter and many of my fellow pro woodworker friends agree with me. Yes wood moves. But not as much as people think on indoor furniture. And a little known fact about wood glue.... It's actually not a true solid once cured. It can allow for a surprising amount of wood movement and shifting and still keep it's bond. Honestly man you could have just glued and mortise and tenoned that baby on for the breadboard. The bigger issue isn't the breadboard... It's the fact that you are using construction lumber. The 2x6s are gonna get way more contraction than just going down to the hardwood store and buying poplar. And it actually will be surprisingly similar in cost. But the moisture in that framing lumber may be enough that it blows that a perpendicular wood joint out. But if you are using dry high quality woods... My statement stands.",
    "likes": 3,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "What topic did you registrr your youtube-channel under? Or do you know from where Youtube picks up what kind of channel you have to get the right kind of ads?",
    "likes": 1,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "Good breakdown, Brandon! Thanks for sharing your numbers and some good things to look at.",
    "likes": 1,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "Very interesting.... ! I hurried a look at subs per the top 20 you had listed, looks like maybe over 50% from the top 20 videos... that seems pretty good to me.",
    "likes": 2,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "$12 CPM? What the how? I'm lucky if I get anything above $2. When my ninjago videos took off, I got over 1.1 million views one month and the total for those was $114 in revenue. You're doing a lot better than I am. Congrats.",
    "likes": 2,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "Very interesting and thank you for breaking it down so anyone can understand.  I too have affiliate links with Amazon and my channel has just been monetized.  Looking forward to 2020 to see where it will take me.",
    "likes": 1,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "When the laser bulb wears out ...how much are replacement bulbs?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "Great tips. I made some of those mistakes on my first as well :)",
    "likes": 1,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "How much was the overall cost of this project (assuming you picked the right stain the first time)? My wife wants to buy and I want to build. Trying to figure the cost benefit.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "I've used Fusion for some time now and I wondered if I should make the change to SketchUp since it is so popular. You've just convinced me to stay with Fusion, I can't imagine working without parametric design, I thought it was the standar.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "what does that gear at 8:53 do? sorry for the late comment :)",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Check out Law Tactical AR-15 folding stock adapter. That has quick latch and de-latch mechanism and it’s extremely sturdy",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Great video. Thank you for sharing!\nAre you planning on making a video of how to design and cut a topographical map?",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "i know it can engrave aluminium but can it engrave harder metals like steal? i'm looking to engrave knifes, will this engrave a knife blade? what type of metals can it engrave if so?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Fantastic information.  I'll probably try something like this with my cnc router.\n\nI couldn't help but think that is one massive freeway right next to campus.",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "Enjoyed it, Brandon! That was a great walkthrough of how to do this type of thing. I think I'll try to come up with one...maybe where my wife and I got married. One thing I'll have to get over as a hurdle is that the Glowforge doesn't recognize clipping masks. Not sure how to get around that in the software.",
    "likes": 2,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "sketchup is more used for architectural building ; fusion for manufacturing",
    "likes": 12,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Hello, do these work on titanium? For example a titanium dog tag?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Looks like a cool machine. It cost half as much as the CNC machine I built myself. My machine is a bit bigger and more robust. Was a whole lot more work than assembling a kit. So this is far cheaper and easier to do. Which makes it a lot more accessible.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "What is the laser power of this machine? Thank you, It looks very cool",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Would this work on unbaked polymer clay or baked polymer clay? It’s basically plastic",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "VERY inspiring!!! I am actively gathering ideas for my own tool wall and like how you added the light above, sticker section, and the contrasting colors with your logo centered. I appreciate your work and this video! Also enjoyed your presentation style so I subbed and look forward to checking out your other content. Thanks!",
    "likes": 0,
    "video": "How to Make a Simple Tool Wall for a Garage Workshop",
    "video_id": "CZ2E2sZ3mB4"
  },
  {
    "text": "Hi, do you have any advice on choosing between the 7kw and the 15kw version of the engraver? Thanks",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Please forgive my ignorance, I am a little confused as to what the jig does as opposed to the standard sliding adjustable guide that came with my table saw, other than holding the board down.",
    "likes": 0,
    "video": "Cut Straight Edges without a Jointer on the Table Saw",
    "video_id": "QMuoxpXTnCs"
  },
  {
    "text": "It always looks easier than it is. 10 years in my business making what you made, Great Job!!",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "I was hoping it would have a sub-woofer channel snaking around inside and coming out where the tweeter ended up.  Oh well.  Great build!  Thanks for the video!",
    "likes": 0,
    "video": "Building a Bluetooth Speaker into a Side Table",
    "video_id": "xskyxhxku3Y"
  },
  {
    "text": "Hello do you know the life span of laser unit ? I would use it for small buissness so can you guess how much it will last ?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I picked one up over the holidays based on your video here and I've gotta say I dig it. I'd love to see an update with some recommended settings for various materials and your testing process. I created a gradient to test grayscale conversions and engraving but never got a good photo image from it. Vector images are no problem though.  Thanks for what you do, I love the podcast, once I get a few videos up I'll message you again.",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Yo! Those \"vcarve\" bits are NOT \"vcarve\" bits....lol....Those are ENGRAVING bits. Not meant to go very deep at all.....",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "There is only TWO reasons you moved over:  1) You've got loads of money -- (Like $400/year!); 2) You don't know about Blender!",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "i made something like this and used it to duel with my friends. I made mine so it can switch from closed to open really fast and it works well",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "If and when the laser, touchscreen, etc. go, does the whole unit have to be mailed back like with the Glowforge, or is it something that the owner can do?  I heard you said that yours had an upgraded laser; did you swap it out or did you buy it that way?  What is the maintenance involve; how hard is it to clean and maintain?  I am not tech savvy and worry about things breaking down...",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Can you or anyone else let us know what the lifetime is on the diode lasers. I know it differs but on average what would the life time be for the ones you reviewed. Would make a big difference for making a decision on a purchase. Thanks",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Ouch my eyes! Never point a laser at someone's eyes. Have you learned nothing?😜",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Time for air assist, you'll cut those cuts probably in half",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Informative video. One thing I want to add is that you should always be wearing laser goggles when The machine is on. This is true even if the laser is in low power mode. Even in low power mode I'm sure it could blind you instantly if you got a reflection just right. Given the price level of these things are built to it's also entirely possible for the laser to just go into high power mode on its own to do some sort of circuitry or programmatical failure.\nA good quality set of laser goggles is probably the most important thing you can buy when dealing with anything laser. Also make sure it is the right goggles for the wavelength of laser you are using.",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Check the description I believe you have the number of the laser module wrong or the link is wrong  it goes to the A40640 not the A40650 that you have it listed as",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "How about compared to the Sculpfun S9?\n6W laser power but effect is 90W CO2 laser.\nLike to hear your review regarding this.",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Is there a way to get the test file you show at 06:12 ? The one that show the results for multiple passes?",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Is there a link for the lite burn site? I had problems with the grbl site u mentioned",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I’d be curious how this would compare with a k40. Obviously the enclosure and being about to use lightburn are big differences, but I’m trying to decide if I get a k40 or upgrade the module on my Ortur LM2",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "If I get an MPCNC going I want to put a laser on it and this seems like the one to get",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Which laser will engrave on food. Good example cakes.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "Blugh on the NEJE minus the dual laser beams. :) But, as always, your review videos are top-notch and I aspire to make mine as cool as yours! Esp. the lighting... you've got that down pat dude! This content creator would love to know your studio setups.",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Are you doing anything to exhaust fumes… Nevermind, you just said.  😂",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "I noticed you didn't do your normal tests with this review, how does it compare to the Atomstack X7 pro?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "Wasn’t the xTool D1 achieving a 0.08mm x 0.08mm cut line?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Hi. I'm unable to download your test burn files. I've attempted a few times and am not getting the email for them. I verified that it is not hitting my spam folder. Is this download not working?",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "on the short 2s pls, u can use the included leg holders that keep it from wobbling!!",
    "likes": 0,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "I was really interested I this laser because with the optical power and the tiny spot size it should be able to deliver 6000W/mm^2. \n\nBut now I’m not so sure. Do you think smaller spot size could achieved by refocusing it? Or is that as good as it gets?! \n\nThanks for a great video.",
    "likes": 3,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Awesome.  Do you have a flat-bed scanner?  That would be a great way to share the results of your test cuts.",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "I love the dual Diode Laser idea...next year we'll have 3, and so on... Wondering if Ortur makes a 2 Laser replacement for their Master 2 system...",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  }
]