[
  {
    "text": "Conclusion: which is the best for cutting materials up to 5mm or 6mm, such as wood, plywood, acrylic? (I don't understand English correctly)  Thanks",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Do you have experience using a Bystronic CO2 laser cutting machine?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Curious if this would work on metal, specifically things like small spice tins.",
    "likes": 2,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "can you make electrical tags for outlets with this could you make a video",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Lets see some engravings you did? I wonder how good the dpi is on this when ur engraving engravable stock? Lets see your vent setup? How cold does it get inside ur garage how do you keep the water from freezing?",
    "likes": 2,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Hey man, I was wondering what would be the best engraver to print anything small from 10mm to 30mm",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "this ones big enough to work and small enough to be cost effective https://amzn.to/34WipGh",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I bought the Ortur Master 2 Laser engraver and still cant figure out how to make it work. I am not a computer programmer so is there any videos that help a beginner like me to make it work. I reached out to Light burn to extend the trial but they didnt understand I just wanted a little more time to figure out how to make it work. If anyone is able to help me to get this thing to work it would be great.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Hey there. Great video. Considering getting into laser engraving (mostly wood for now) and considering getting this laser. My main question is I the only available space I have for this is the second bedroom of my condo. There is some space next to the window. Would an open window be enough ventilation or do I need to get some sort of fan or ventilation system? Is there one you would recommend? Thank you.",
    "likes": 6,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Does it smell when it engraved??and can you engrave on a laptop/phone or switch?",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "What are the brands of the lasers of your top pick?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "6:20 No not making money and not big and crazy. I built it in my shed from random off the shelf stuff. It is just 4 axis. Sad, now I gotta go find something else.",
    "likes": 2,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "150W CO2 can cut thin sheet metal with oxygen assist. If that's your only use case you should be able to save buying a fiber unit.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hi! I’m looking for a beginner laser cutting machine. I’m a card maker, and I have experience with die cutting machines,  but they were not so great for detail cutting. So what would you recommend? Maybe Ortur Laser Master Engraver V2? I’m mostly cutting card stock and vinyl, and maybe starting engraving on my crafts. I don’t have a big budget either. \nThank you so much. Mary Wooten",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I work with very large industrial Bystronic lasers. I've kinda wanted to get into it it as a hobby. I wish I could just use the ones at work for some personal projects. We use the CO2/LN2 lasers to cut through 1/2\" mild steel. The new Fiber laser is used for the same parts, but is 10x faster.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I'm confused about the price tag on the dremel laser cutter. It's more expensive than the glowforge plus and I'm not sure why. O know the glowforge plus at least has a pass through slot. Is there something I'm missing, are the specs better than the glowforge?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I just got one of these for Christmas and as a paper/mixed media crafter I’d be very interested in you testing if it could cut stencils or engrave onto rubber (for making custom stamps)!\nThis is the best review and description I’ve seen.  I guess it’s new so not that many people have one to play with yet!",
    "likes": 6,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Can you use the ortur engraving 15w machine for brass and stainless steel metals?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Why not use hydrogen (hydrochloride acid and aluminium).",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)"
  },
  {
    "text": "We bought a k40 and can't figure out how to zero the laser in so we can get started.",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Wow, u really spent your own money on your lazer??? Call me un-impressed. That,s how i have to buy stuff.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I am looking into engraving brass dies for a wax seal stamp.  I understand that I need a fiber laser. Is that true, and what would be an entry level for a hobbyist?\nThanks",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Thanks! Interesting and very way to follow for a newbie. Have you hear of the Bussie? Apparently it’s $25 and looks like the one you test on this video. Seems to good to be true.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Shoulda kept the dino background to the white box surface hehe",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "If you focus on the ground instead of the horizon, you will see an obvious distortion in several places on the lens, particularly at 2x speed. The fluctuation in the horizon is slight, but also apparent. The horizon does appear to have a curve later in the video, but the math is wrong on the curve based on the distance and current globe calculations, so we can assume that any fluctuating horizon is due to how the lens focuses the picture. The horizon is more steadily horizontal on the flight up, though again with slight fluctuating along the line. Another detail is that the horizon always stays at eye/lens level and never falls/curves away, indicating an ongoing plane (flat area) of Earth and not a rounded shape of Earth. Interesting to note is that there are no stars and there is no moon at this height.  To burn any assumptions, I'm neither a flat earther nor a round earther (nor any other shape earther). These items were interesting, so I thought to mention to them.",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Why would I want to engrave paper? I have a printer",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Never heard of anyone calling a laser with a focusing head a \"3D laser\".  Sounds like marketing BS.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D "
  },
  {
    "text": "Probably a dumb question lol. I don’t know anything about laser engraving though😅 can you do different mediums? Like metals and wood? I really wanna do some custom zippo lighter designs 🤔",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I wish that you would have shown the software that comes with the unit.  This isn't a true review because of that.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Get version with ruda controller and ofcourse air assist",
    "likes": 5,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Would you recommend this product for engraving harder woods like walnut or maple?  Wondering how deep it would go, does it just depend on the amount of passes?  Would you be able to feel the engravement or is it more at a surface level?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Does anyone have any recommendations for something a little bit more powerful maybe the next level up under $500?",
    "likes": 4,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "https://www.letsmarking.com/     anyone trued this EM-Smart model?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Can you send me a review of the moray laser by next wave??",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Thanks for your helpful review. Just ordered this machine from Gearbest as my entree into CNC technology.",
    "likes": 1,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Out of stock! Hopefully they’ll be available again soon.",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "I’m looking to get this but I want to etch clear glass. Does this laser etch glass? Thanks!",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I pre-cut wooden name tags then take them with laserpecker to flea market and custom print them while customer waits. Quick way to make $3.00.",
    "likes": 11,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Finally someone explained g-code. When I use it the picture is stored to my photos on my Mac. Then I can use my Glowforge with the image that has already been converted...COOL!",
    "likes": 3,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "This one needs tossing int he bin, its digital and a right Pain in the proverbial, best always to buy the analog, drop in a 3d printer board for 35 euros and your have lightburn running, little bit of electrical but any k40 group will explain, you dont need to spebd 250 on a cohesion or mini gerbil they are not worth the money for what the do, the only board worth real money is the VMS and only if you are upgrading the gantry, then you can install the VMS and you can go seriously fast with it, at the same time upgrade the electrics to run a 50 watt tube when you tube dies.",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "better get the K40, way cheaper, i can install a camera :D and other toys and still cheaper.",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "This video shows many fantastic features of fusion 360 as if they were not available in Sketchup, even so, Sketchup 2017 is free to use indefinitely while fusion 360 is not, it comes with a 1 year free trial and is very difficult to reinstall and has limitations on printing models and has a learning curve that may take years.  For most uses  Sketchup fits my needs without all the complicated features.  If you are a professional modeler Fusion 360 may be the way to go for you.  . Also you really need to view this link concerning Fusion 360 https://youtu.be/5EOiuTu14tI",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "It's like the balloon said 'sorry guys I'm outa here.' What follows is screams of panic.",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Is it's rate of climb constant of become steadily faster or slower?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Great videos, I’ve been learning a lot from them, I myself am getting the ortur laser master 2 , I was wondering do you need a high performance laptop to get the most out the laser?",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "Hello, I want to laser cut fabrics. Nothing to large or thick but I have no idea where to start. Any suggestions?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "OK, dumb question, where is the camera attached? I can see a line on the right side of the box that fades out. That's all. It's bugging me.",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "I have the same laser engraver Easy to put togetherLove the way it workedBurned about 8 projects smalleNow the laser engraver goes through the motion but does not burnEmail the gentleman who makes it Feedback Not warrantied So if anybody has any idea what the problem isFeel free to email meHonda Dan 15 @yahoo. comI really would like to get this thing gone again",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "regards  your brackets...\nIt is always best practice to have the bracket take the load vice the bolt. Stated another way, try not to put the threads in shear. \nIf your bracket was rotated to the BOTTOM of the setup (instead of on the side), you could utilize the full strength of the metal bracket.",
    "likes": 2,
    "video": "Welded DIY Metal Bed, This is What I MESSED Up"
  },
  {
    "text": "I have a business and want to put my logo on my bottles would this be a good option or is there a better laser pls help.",
    "likes": 2,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Great interview with Lars. You asked the most important questions and he answered in a way you would expect, but the confirmation is important.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "I was looking at this before i went with omtech. But the website was super irritating and also the fact that you cant find like anything recently on it made me really concerned.",
    "likes": 3,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "I actually have a CO2 laser that cuts metal. I imported a full size 4x8 table from China. It has two heads. I only paid $8500\n\nThe key to being able to cut metal is POWER. You need your laser tube to be rated at 180w (peak) with 150w nominal. So don't only get a 150w tube and think you've got enough power. (Maybe for super thin sheet metal) The way you can find out if the laser you are looking at can even begin to cut metal, is the head. They are significantly more chunky, look industrial. But they are known in the biz as \"Metal/Non-Metal\" heads. That's the phrase you are looking for. My table came with a water chiller, up/down front half table, 2 blower motor fume extractors, extra honeycomb top, rotary attachment and small aquarium pump. But I'm using a silent air compressor, it barely needs any real PSI above 40 anyway. And believe it or not, all of it runs on a 120v. (Even though I just converted the actual table to 220v, so I'm not tripping breakers running the water chiller, blower fans and an air compressor all at once. I had to do the extension cord thing across the shop for awhile to catch different outlets not on the same circuit)\n\nMore about the head I use to cut steel with... It can cut up to 4mm mild steel and 3mm stainless. Which is crazy to think about, considering the price point. The other thing you will absolutely need is a bottle of oxygen from a welding supply store. You only need to use that when cutting steel. So it's a minor cost factor even if you are just messing around. The other benefit of that particular head is that it can also cut 1\" thick acrylic, with glassy smooth polished edges. The secondary head I mentioned, I only use really for cutting thin stuff, most mostly engraving. I believe that one is rated at 80w peak.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "I watch all of your videos and because of you I purchased a muse 3d laser yesterday :) \nI am wondering if you ever might be doing a laser cutter giveaway. I have a dear friend in Serbia who is a designer and has been so supportive of me the past several months as I've worked to afford the Muse, but sadly, despite him wanting and needing a lasercutter even more so than me, his financial situation in Serbia has been too disastrous for him to get started. If you ever do any kind of design competition ,or anything that involves winning a laser cutter, no matter how cheap, please let me know!! (I know this message may seem kind of crazy, but I'm just trying to leave no stone unturned. He's given me so much encouragement to get started in this field and it kills me to sense him feeling left behind)",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "Previous reviews of this type product compared to cheaper Chinese products.  How does this compare to Muse that you previously reviewed and to Digilab which I do not think you reviewed.",
    "likes": 0,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "whats best for me is an cheap laser that does what the expensive lasers do.  lol",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "I have a question?  What would be the best option to start creating a home business, to create and sell products?",
    "likes": 1,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "What's the cost of a new lens? And a new tube? How easy to change the tube is it? And that chick-fil-a logo was really smokey.\nIs the water actually chilled? As if not its just going get warm soon. Nice to see its not locked to the web.\n\n4000 dollars (which I translate to about £2988)\n\nFor that I got an 80w laser with a 700 x 500mm bed, a real chiller, a powerful compressor for the air assist and had enough left over for lightburn (although I already had that)",
    "likes": 2,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "Ok, I was worried, cause I just purchased the desktop muse with a rotary. But this doesn’t look like you can add a rotary to it.",
    "likes": 2,
    "video": "The Makeblock Laserbox - Is this the Laser Cutter "
  },
  {
    "text": "What laser do you recommend for someone trying to start a small side business, like to sell custom laser designs on products online or on etsy.  Preferably something under $800, that can do detailed photos possibly.",
    "likes": 2,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I would like to know how fine of a line it can make and how detailed of an image it can do.",
    "likes": 1,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I got two benches from my work with a butcher block top i m making a bar in my cellar out of them .so I sanded them down so now should I use wood conditioner then stain then high gloss polyurethane?",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?"
  },
  {
    "text": "it sucks because glowforge is not available on Philippines :3",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "As a long time user of Autodesk software, the company is famous for leaving its customer hanging, changing rules, taking software of the market without notice and so much more, due to its dominance status within the CAD market, they have left dry a couple of times in the past. Using 360 for free is very helpful to a group of us, just don't take anything away from us, specially the axis/milling issue, just a couple of export taken away and just one sheet for drawings, I'll be looking for another option soon, thank you for the video!",
    "likes": 6,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Super Helpful tutorial!.. most drawers I've known have a Full tail and a halfpin",
    "likes": 0,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "Okay, I find your video both informative and misleading. you mention the TOP laser engravers, However, you do not mention that they are all \"Hobby Lasers\" and not professional engravers. Nor are any of them ever mentioned in the major trade publications like Engravers Journal.  There you will see article and advertisements for the true top laser engravers. that said I have a big problem with Full Spectrum Laser.  Having done business with both Trotec and Epilog  and having been involved with a number of different types of laser, I find FSL to be the worst company in the business that I know of.  I had a Muse engraver back in 2016. Having had better machines and knowing that the Muse was only a Hobby Laser, I still found it to be a big problem. Files would not load, the Claim that corel draw files were fully compatible a joke. Having a BS in Computer Information Systems (programming major) It was clear the first day that the software had serious flaws. The design part of the software would not even display properly. Some of the tools were partly hidden and there was no way to make them display or usable. The few things that I was able to draw would not save and be available in the main window. The machine itself was flimsy and the cheaply built. Mirrors were not aligned and not easy to align. The claim FSL advertised back in 2016 that the Muse does not need to be connected with the internet to work was a marketing ploy to try to get sales that might have gone to Glowforge. Bottom line here is the claim that the Muse did nt need to be connected to the internet is both true and misleading.  The true part is that the muse can be operated while not connected to the internet. What thye don;t say much about is the fact that you do have to have an internet connection and have the Muse connected to the internet and turned on. FSL sends updates to the Muse all the time. If your machine is not connected it does not receive the updates. History since 2016 has shown that many muse owners that had machines that worked one day found that their Muse would not work at all the next day (After FSL had sent an update).  FSL lies about capabilities of their machines. They advertised that a materials database would be into the Muse. It said that on their web site and I verified it with my salesman before buying. No Muse has ever had the materials database. After I made a fuss on several Facebook forums Full spectrum Laser removed any mention that the Muse was to come with the database.  My first Muse bluescreened the second morning I had it. I let FSL talk me into a replacement machine. Thy lied about that too. First they said that if I would let them send me a replacement machine they would ship it out that same day. And they claimed it would be fully tested and working as advertised. However, that is not what happened at all. FSL waited until my first machine got back to them. Second, the second machine had the exact same problems as the first one. There 30 day 100% refund policy is something they run from. If you call tech support they will try to help you. that is as long as you go along whit what they offer. As soon as you tell them that you want to return your machine for a refund, they stop responding to you completely. Lucky for me I was persistent. I called multiple times a day and send emails several times a day. No response for 8 days. When I did get someone to talk to me he informed me that they would not pay the return shipping. Had I bought a machine and then just decided that I did not want it, that would have been reasonable. However, when you get a machine that clearly has major problems and will not work as advertised they should pay for the return shipping. So I sent the Muse back at a cost to me of $271.73. Then when FSL received the Muse they took more than 30 days before refunding part of my money. Yes, that is correct. They have a restocking fee they take out of your purchase price. Again if i was returning a work machine simply because I did not want it, a restocking fee would be reasonable.  Before I shipped the Muse back I told the at Full Spectrum Laser that I did not think it was right to make the owner of a non working machine be responsible for return shipping and then to add insult to injury charge a restocking fee.  My comments to them were that if they gave me all my money back, I would go away. However, if they did not refund all my money I would make it a point to tell as many people as possible how they do business.  Long story short I lost well over $500 to FLS. The return shipping was $271.73. Then the restocking fee took another $250 of my refund.    The only concession here is I have for my trouble is I did make a fuss on a number of forums. After more than 2 years, I contacted the head guy. we had a phone conversation. At the end of that call FSL did refund my $250 Restocking fee. However, they refused to refund the $271.73 I paid to ship their Muse back to them.  Not to long after returning the Muse I started a fb group called Muse Buyers. There I now have well over 400 members. Some have Muse engravers. Several tried to return their machine for refund. FSL stalled and would not respond to them. once the 30 day refund period ends they will respond but will not take back your machine. To be fair, of the members of my group that own a Muse, a few  have only goo things to say about it. However there are more members that have a Muse that does not work.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Lol people these days... Complaining about something they benefited from and never had to pay a cent for. You could just pay for it? It's about the cost of a cable bill..",
    "likes": 3,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Do you think it could “cut through” a piece of denim or cordura like backpack material? \nCheck Google images for laser cut tactical vest. They laser cut out little slits for pouches etc to be attached to.",
    "likes": 2,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "Does anyone have any advice on how to judge what size specific to use for specific parts? When I try to design any woodworking projects I always get stuck on how big certain parts should be without looking weird in IRL.",
    "likes": 1,
    "video": "Designing Furniture with Fusion 360 for Absolute B"
  },
  {
    "text": "if i want to do more then just flat objects would this or a laserpecker be better. Or object that are bigger then your standard cutting board height wise and how hard is focusing this laser on different sized projects?  maybe a dumb       example would be things from 2x4s then going to a gun barrel something like that",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "Just FYI, The 10% off coupon link above only is giving 5%.",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Oh my goodness, all that sawdust, on the tray, in the lens, a literal house fire waiting to not be covered by insurance due to these videos. “I don’t know what this part is, haven’t used it”, “it says be careful with the grounding but I just plugged it in and it works” for gods sake man. Water cooled by a Tupperware container with the worlds least effective lid, set directly underneath saws and other woodworking materials, this video reminds me of the building a pc video where that dude just utterly failed, but no one seems to think the same lol",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Me and my wife are thinking to start a business with a laser printer. The idea is to start doing anything that comes to mind that we might think people would love now. On that note, which laser printer would you go for and what else would say we should have in mind such as opening an etsy account? Or is there another website you'd recommend we open an account with? Truly appreciate your feedback in this new journey of ours and I hope to keep you posted along the way. Thank you for such great content.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "can you attach different shaped cutting tips? and does it connect to a computer so you can make it engrave your custom designs? thanks",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "Would love to know what materials and thickness it will cut and engrave .",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "In my research, on paper the muse 3d seemed better than glowforge, especially with the rotary height extender. But the fine print only offers 30 day warranty vs glowforge 1 year. I contacted sales to confirm this. They didn't respond back. Big red flag that lead me to other complaints about service and power supplies blow often. 30 day warranty on new gear for that cash is awful.",
    "likes": 7,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "The single flute V bits are directional! There is gradual clearance on one side, turns clockwise like anything else. Good channel!",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Интересно, что когда шар лопнул купол сразу надулся и начал выполнять свою задачу. А если бы не было воздуха то он бы падал вместе с грузом на одной скорости не раскрываясь. Переводить текстбыло не обязательно.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Pl"
  },
  {
    "text": "Buongiorno,sarebbe così gentile da indicarmi i parametri \"$$\" della macchina 3018 utilizzata con lightburn?Mi farebbe una grande gentilezza.\nGrazie in anticipo",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Thank you for this short and comprehensive intro to laser cutters. Exactly what I was hoping to find on the web",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Hello do you think I can use it to engrave my 8oz glass candle jars ? (Glass)",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Sounds like you should turn off sleep mode on your computer. LOL. Thanks for the video !",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "I've been looking at these.\nAnd a larger cutter, like a 150w co2 machine to cut shapes with and then use one of these little ones for engraving on the thicker cutout shapes.\n\nHow deep are the markings?\n\nAnd does it mark on Acrylic?  Or does it make a mess of it?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Το μέγεθος του σχεδίου που μπορεί να δημιουργήσει πόσο είναι??",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro"
  },
  {
    "text": "I'm trying to engrave gun slides / pistols. What machine would you recommend? Any Link to purchase one?",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "So no co2 lasers can cut metal? I’ve read that some can cut 1.2mm thick stainless steel and carbonized steel?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Can this engrave abs plastic and other hard plastics",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Im looking at a k40 to dip my toe into the laser world and hopefully get a bigger one later on. I would like to see what upgrades you do. I hear that upgrading the mirrors helps.",
    "likes": 7,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Is it an optical illusion or does that spindle have that much run out?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & La"
  },
  {
    "text": "Of course they are killing it for hobbyist. They send a message to community - they own the product and can do what ever they want. Today is one set of restrictions, tomorrow they just remove hobbyist at all. Why should I do there anything, if one day can lost all access. Only disposable designs.",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "Would Fusion be a good program in designing such things as audio racks, platforms and stands. Primary materials would be made from steel, with some wood incorporated for accents and such.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?"
  },
  {
    "text": "We gonna ignore how he spells Jimi Hendrix’s name wrong?",
    "likes": 3,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can you advise on a beginner, craft laser mainly to engrave tumblers?  Not for resale items, just for customized gifts.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Ive been looking fos a laser engraver /cnc. I found your review of the Ortur Laser and this video.  Outstanding.  Thank you for being detailed.",
    "likes": 2,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engrave"
  },
  {
    "text": "hi. I want to engrave cutting boards, would the 7w work?",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop"
  },
  {
    "text": "what power would you recommend for engraving on wood ( mostly cutting boards logo) ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can't you control the lighting inside? I've also been wanting to do stuff like this. Do you promote your videos? You should",
    "likes": 0,
    "video": "Turn Real Things into 3D Models with Photogrammetr"
  },
  {
    "text": "So what machine would you suggest  for do cutting board projects?",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "How does this video not have 50K plus views yet!? The quality here is on par with the best. Great video mate",
    "likes": 21,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Man I have been sitting on laser build for a year ... All the parts I have just no motivation to build it hehhe",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "why won't k40 whisper reaed svg files from inkscape. what are the settings",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "whats the difference between the k40 and the k50? do i have to do as much to get it working, and as many problems?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "How much would you charge to make one for my grandchildren",
    "likes": 0,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Pl"
  },
  {
    "text": "https://youtu.be/7YKY2W2-1RI  \nPhoto marking on aluminum",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "This video is super informative and helpful! Thanks!",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Great video, but the title misleads... They are cheap to make, after you spend hundreds of  dollars on fancy wood working equipment!",
    "likes": 1,
    "video": "Build a Baby Gate (for cheap) // DIY Woodworking"
  },
  {
    "text": "did it print right out the box or did you have to adjust mirrors and such??",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "with the full spectrum muse, you have to buy all the accessories, like the water cooling, air exaust,  and air compressor, right???",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "What an amazing tutorial. Sharp, clear, well-explained and very informative. Thank you!\r - Keep up with great tutorials such as this.",
    "likes": 1,
    "video": "How to make Dovetail Joints in Fusion 360 - Woodwo"
  },
  {
    "text": "I bought a “upgraded” K40 about a year ago along with the cohesion 3D board and light burn. \nI was in the process of changing out the board then had an accident and never got back to it. \nI would appreciate seeing you do some of the upgrades. Especially doing the board conversion.",
    "likes": 12,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Can u do a dubai custom map with led to make it like a citylight?",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?"
  },
  {
    "text": "Ordered one a couple hours using your link. Finally made me do it. Should be here in 5 to 7 days",
    "likes": 7,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "You should have used the wood from the crate to test the laser.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Wonder if you could somehow get a thunder laser machine sponsored. Seems like there's a bunch of improvements over the typical chinese laser, things that you won't see on a spec sheet and might not even appreciate until actually using it (or in my case, using an inferior laser with much to be desired).\n\nI have a now discontinued bodor machine and it's just to subpar. There's a few videos on it but surprisingly, there aren't a lot of in depth reviews on laser cutters of any brand. For example, i can't find any videos going super in depth on trotec machines aside from the content that trotec puts out. Which to be fair, is very good quality.\n\nAnyway some aspects that you don't hear much about:\n\n- bed/table system (positioning, locking or other features)\n- quality of honeycombs (size, shape, material, framing)\n- depth under table and debris collection system if any\n- airflow design\n- air assist system and features\n\nI think the reason is there's a very small crossover between buyers of the more expensive CO2 lasers and content creators. Everyone's busy making stuff.",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Great video. Useful information. Mahalo for sharing:) 🐒",
    "likes": 3,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Super helpful! Did you need to align the laser, or was it ready to go out of the box?",
    "likes": 7,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "OK...I HAVE the orion 50 watt laser machine. Been sitting for almost a year now. I'M so confused on how to operate it. I have a 3d printer but its way different than a laser machine. I have INKSCAPE program for this machine but...setting everything up...and learning HOW to use the machine...well...IT'S confusing. I don't know if it works on 1 program or 2 programs or if the vector and raster imaging is within the machine or in inkscape or another program and WHERE to design the stuff i want to design.. or what program to use. SO for a year now...I've been trying to find out information on HOW...to set this thing up and get it going. i'm about ready to kick the damned thing..lmao...like i said...it's frustrating...i can rebuild a 3d printer but can't seem to figure out... what I do..... first on this thing. HELP...if you can...i would appreciate it..or maybe even do a quick video on it...on HOW to set it up and run the software...it would be helpful to a lot of people. thanks bud. theres a british guy on youtube..but that shit is LONG and drawn out. PLEASE PLEASE PLEASE Im Begging you...HELP!...do a video....a slower version..maybe..drink less coffee...lmao..you did fine on this one.",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "Can any of the products cut out  1/8 inch aluminum for small parts",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Excellent overview. An issue that I see with mine is that the controller seems to sometimes restricts the head to stay within a virtual 8x12 inch boundary when using K40 Whisperer, but sometimes allows the head to move outside of that boundary (I've modified my bed setup to allow 9 x 12.75 inch boards). Reinitializing the laser seems to reset things and then I can go outside of that boundary.",
    "likes": 7,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Revi"
  },
  {
    "text": "Ground the laser. Don't trust the machine has a chassis ground. Your dealing with high voltage",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China"
  },
  {
    "text": "I was on the live stream a few days ago.....do you have the link to where you buy your beech wood sheets? I use birch and I have tried everything to laser cut through them with NO luck. Thanks in advance.",
    "likes": 0,
    "video": "Testing the OM Tech K40 Laser"
  },
  {
    "text": "I'm completely new to this and couldn't get the laser grber software driver to load. I have done trial with the lightburn is this my best choice. Still don't understand the use of images on light burn some direction would be nice.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Lase"
  },
  {
    "text": "Can you cover galvo lasers?  For actual production/speed they are king for marking and thin material cutting (exponentially faster than other systems).",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You"
  },
  {
    "text": "Solvespace is very similar on the cad end in terms of parametric way of working with constraints. Bit trikier to get used to but free and a nicer experience than freecad. The CAM end is difficult to get anywhere near for even serious money. Not sure if they've limited that aspect. Warning, autocrat have a long history of dropping software completely, which is why I haven't invested much time in learning it. I doubt that will happen here, but be warned they are may drop it for free use completely or limit it more in future. They've done it before with other softwares",
    "likes": 0,
    "video": "Fusion 360 - Did Autodesk just kill the FREE Versi"
  },
  {
    "text": "00:30 *Bruce Wedgy* - the man with the wooden claws. Ha, ha..\n01:59 Just wondering - is this scar across the face from a chain saw duel?",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)"
  }
]