[
  {
    "text": "I need a Lazer for back glass removal on iphones, they appear to be fiber trype lazers but could any others work? needs to melt glue through a glass back on a phone.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "if this could melt glue under iphone back glass is buy on for sure!!",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Do you have the file for the engraving and cutting test available?",
    "likes": 1,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "The Comgrow Z1 is even worse. 4 thumbscrews and 2 U channels. I'm working on a better method.\n\nI took the red shield off of my Z1. It was getting crudded up w/ debris. For cutting thicker materials it also gets in the way because there's only a 2mm gap at optimal surface focus.\n\nI made a temporary enclosure out of cardboard and piped in a 170cfm (advertised flow) exhaust blower. It's not ideal or the safest enclosure material, but I never leave the laser unattended when in operation and have a small ABC extinguisher nearby. The blower is marginal for extracting the smoke, but that's likely due to the \"enclosure\" having an open front.\n\n\nMine is good to etch at faster than 9000, but at those speeds I haven't tested the accuracy. For slate coasters, it will even produce a textured surface at medium speeds.",
    "likes": 2,
    "video": "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser",
    "video_id": "dpw4Qrq8Uo0"
  },
  {
    "text": "Brilliant episode, many thanks for this invaluable information.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "How about use laserweb? Have you used it on a raspberry pi to run your laser cutter like octoprint for 3d printers?\nI haven't tried it yet myself but I have it installed and ready to connect when my laser comes in.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I've worked with wood since the early 80's and now I have pulmonary fibrosis which will in time kill me. SO now I am looking for something different to satisfy my creative nature. I am thinking about acrylic and this low cost cnc might just be what I need. With acrylic there is shavings but no dust to hurt my lungs,",
    "likes": 4,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY"
  },
  {
    "text": "Your link to the laser gets to a 404 page. OOPS... THE PAGE YOU LOOKING FOR CLOCKED OUT!",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8"
  },
  {
    "text": "The issue with glowforge, as great as their machines are, is the software. \nIts cloud based and if the service ever has issues or goes byebye completely... well... you cant use the glowforge anymore.",
    "likes": 0,
    "video": "Should you upgrade a budget laser cutter?",
    "video_id": "HUnskFyscNs"
  },
  {
    "text": "Can you use lasergbrl? I have not really gotten into gbrl settings yet. Can you do different burn strengths also?",
    "likes": 1,
    "video": "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!",
    "video_id": "1DZG8YJ0ep8"
  },
  {
    "text": "just one thing that id like to point out! Your version \"Reviewer Version\" Brings the 3 laser modules but when a regular costumer buys it we have to choose wich one of the three we want and each separate module is arround 200€",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q"
  },
  {
    "text": "can you use it to engrave your name in power tools?",
    "likes": 0,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q"
  },
  {
    "text": "Wish I could say I'm a fan of Full Spectrum.  Bought a Muse Titan clearly no QA process at Full Spectrum prior to shipping....gantry was even missing several screws and customer service after the sale....good luck!  Such a shame for the price they charge right now it's a very expensive and very large paper weight.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Wish I could say I'm a fan.  Bought a Muse Titan clearly no QA process at Full Spectrum prior to shipping....gantry was even missing several screws and customer service after the sale....good luck!  Such a shame for the price they charge right now it's a very expensive and very large paper weight.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Complete newbie to laser cutters- is it possible to upload images and have the laser cut around the outlines of the images on felt? If this cutter isn’t able to do that, what would be a better option? Any tips would be much appreciated. Thanks so much!",
    "likes": 1,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU"
  },
  {
    "text": "I would like to know how long the diodes last.  At $600 it's seems like a good intro deal.\n\nI know that the co2 laser cartages have a limited life span (whether used or not). I think they have a 2 - 4 year life and have big costs for recharging. But do cut faster and thicker material.",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc"
  },
  {
    "text": "I got in on three Kickstarter projects . All three took over two years, one was d.o.a. I was sent instructions for soldering a battery connection. I will never participate in any mass funding project ever again. Socialists have no time frame or required to provide good quality. Free money right?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I'm interested in using one for back glass removal on iphones. Lazer- pecker is another one I'd like to try:) thx for the video 👍",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Wow, they jacked the price up $200. Maybe the review you gave it, was too good, lol.",
    "likes": 0,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY"
  },
  {
    "text": "I am primarily looking for a laser engraver to cut paper (intricate designs that would be difficult and time-consuming with a knife/scissors). Would you recommend a diode laser? Have you tried the Two Trees brand?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "What software do you have to use with this type of laser?",
    "likes": 0,
    "video": "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review",
    "video_id": "paDgKFKD6yE"
  },
  {
    "text": "Would you have any recommendations for 100-130w CO2 lasers? Did you like the omtech? I had been looking at king rabbit, but doesn't seem very popular. I don't know if it's because hl yeah and the r\ned and black are much cheaper. I'd love to see a video with lasers this size. There are so many producers.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "@Make or Break Shop - Did you sand or plane the inside edges?  I saw you planed the outside edges.",
    "likes": 0,
    "video": "Building a Picture Frame Ron Swanson Would be Proud Of // DIY Half Lap Joints and Dowels",
    "video_id": "PIShYHoIWH8"
  },
  {
    "text": "Hi do you know when the ortur double diode version is coming out?",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc"
  },
  {
    "text": "Hi … Iv been watching ur videos… Thanku… I would really like to etch acrylic… is this machine suitable?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU"
  },
  {
    "text": "I am lost but have about $1,500 to invest in a laser to engrave and cut. Please give me some direction, what would you recommend?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "can i have the model number of the machine that appears at 15:46",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Great informative video & some good viewer comments to learn from. I am also a rookie when it comes to finishing butcher blocks but this helped a lot.",
    "likes": 0,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "great review. could you suggest to me a machine which would be good for making logos on chopping boards or hardwood? we usually make wooden utensils and need to do company logos on them, which we get outsourced. thanks",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "What's the point of toys like this, if you can't cut 12mm steel with it then it is just a toy... :D :D",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "On the website, the 2nd version is able to cut, and I watched another YouTube video demonsrating cutting wood. This is the statement from the website: \n\n\"Thanks to the 5W semiconductor laser with the upgraded version of compressed spot technology\nYou can have a higher standard and more powerful laser cutting with LaserPecker 2. Wood, paper, acrylic, leather goods with a thickness under 5mm.\"\n\nThe website also provided images as well,",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Dude your content is awesome! I bought the xtool d1 and your info has helped me leaps and bounds keep it up man!!!",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Can you recommend a Non chinese, affordable laser cutter? I am a hobbist, dont want to spend too much money. Thank you.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Can you recommend a reliable and cheap NON chinese laser engraver for a hobbist. I dont want to spent too much money on a LE, because I just want to discover how it works, but also not a chinese bargain. Thank you.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "I’m looking for an affordable laser. That I could use to cut acrylic sheets. I would like make acrylic jewelry. For example name plates. Could you point me in the right direction?",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Will a model be available in the near future capable of engraving bare metal surfaces? The cost would increase considerably for such a device, but would be worth it.",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Bro you look like the guy in the \"like a Bosch\" commercials !\n...Shawn is his name...\nYou have to try the mustache 🤣🤣🤣",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "hardware woodworking project for teen woodworking .",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "Nice device. How does the beam remain focused when scanned from the vertical? The focal distance will change from the center (vertical) to the outer limits of the scan, so is this corrected for inside the scan head?",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Scalpers suck. Can't find one under $500 with dozens of copies going around the same price",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Would you say the Muse 3d or the glowforge pro is better?",
    "likes": 2,
    "video": "Should You Buy a Glowforge?",
    "video_id": "4c4kxlYg-E8"
  },
  {
    "text": "Does anyone know a link for any uk sellers of the Laser Muse 3D? I cannot seem to find any!",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "I would like to use it on polymer pistol frames. Do you think it will work on them?",
    "likes": 1,
    "video": "SparkMaker LaserPro: The new King 👑 of budget laser engravers?",
    "video_id": "CGU72hEqHI8"
  },
  {
    "text": "I know basswood is pretty soft, do you know how well this would engrave hardwoods like maple or walnut?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "So which one do you recommend for a beginner. The Atomstack A7 or the Ortur LMP?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "I want to engrave yetis, would this work? Would u get a 10w or 5w or would it necessarily matter ?",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "Ive owned the aeon lasers and they are just Chinese lasers with features.  Still junk really.. I finally stepped up to the epilog fusion pros and while I dont recommend people spend 50k on lasers, they are really in another league when it comes to lasers.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Great video. This is very helpful. I am looking to purchase my first laser unit so this is part of my research. Have you looking at or tested the SCULPFUN S9 Laser? I would like to know your thoughts on that unit if you get a chance.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "What would you suggest for a laser if I only wanted to cut acrylic sheets? I'm leaning C02, but there's not a lot of videos that specifically state \"if you want to cut acrylic, this is the laser for you\".",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Which is better between diode lasers and CO2 lasers to engrave on acryclic to make edge lit LED signs?",
    "likes": 1,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Yet again China using Kickstarter as a sales strategy and you guys blindly support and encourage. Pride is underrated when you can save a few dollars right,  I'm not saying it's a bad product I'm just saying ill never buy it because of the unethical sales strategy.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Will I be able to mark silver? so I have lines to trace it with my hand graver?",
    "likes": 1,
    "video": "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review",
    "video_id": "xhqKwrSTc_Q"
  },
  {
    "text": "uh oh so many personalization options  in this modern age ...  you need everything to be personalized and have your name engraved on  all your objects  only then you will find true happiness ...",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Thank You! Way cool informative video' and your really cool also!🖖😶👍",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Great video. Thanks for posting it. This might be a silly question, but why is that diode laser don’t have enclosures like the other kinds? Do they not need ventilation too? Thanks again.",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "We have a 2k ££ limit what machine would you recommend?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU"
  },
  {
    "text": "It's looks partially photo shopped.   Look at the end of the black cord, it just fades, and the logo on the container. The edge of the container doesn't line up.",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "any reason for that container to hang in front of the camera all the time?",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Afternoon Brandon can you do a sample how it will do on a yeti 32oz Please I want to know how it will perform.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Great review.  But \"Potato\" is not spelled \"Potatoe.\"",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Comprehensive. Great video. Answered a lot of questions.",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "I have same machine 10w I notice you more images on your pulldown menu than mine and I did upgrade firmware, still same group of images. Any ideas?\nAlso is there a site to download free images 😃 I did buy this after watching your reviews",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "Very helpful video\nI appreciate all your efforts\nThank you very much",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "DAM VOICE-TO-TEXT I TRIED TO SAY EXCESSIVELY EXPENSIVE",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "I SEE GRIZZLY TOOLS HAS ADDED A NUMBER OF GREAT-LOOKING BUT EXCESSIVELY LASER CUTTING MACHINES THAT YOU MIGHT ENJOY CHECKING OUT , I KNOW I WOULD ENJOY THEM BUT I AM NOT GOING TO SPEND THAT KIND OF MONEY AND OF COURSE I'D WANT THEM MOST POWERFUL NOT KNOWING WHAT I WOULD COME UP AGAINST IN FUTURE AS I AM INTO CUTTING METAL. NOT WOOD OR PAPER OR PUMPKINS\nD . A . G . BOULDER COLORADO USA .",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "So can you ACTUALLY use this machine I mean ACTUALLY. lol",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "if you change the way the unit engraves you could use just the small size",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I’m looking for an engraving machine that would engrave stainless steel. What would you recommend?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU"
  },
  {
    "text": "This is the first laser you could use for graffiti. Just hold the thing. Also, with a camera you could weaponize it. Nifty. How horrible.\n\nBut seriously about the graffiti thing it's potentially awesome.",
    "likes": 4,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Do you recommend it for cutting polyester twill fabric ?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU"
  },
  {
    "text": "Your videos are the best. Thanks for all your time and effort on them.\n\nQuestion: what parts of a laser (let’s say a diode tier) will need to be replaced on an ongoing basis?",
    "likes": 2,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Do you know that only a few years ago it was not legal to sell lasers such as this without a heavy duty enclosure? Do you know why? Because of the high radiation levels they emit. Your leaders raised all of the radiation exposer limits so high that companies can now sell these death machines. Enjoy.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I'm between this and the D1 from XTool. Now that the D1 can use lightburn, which would you say is better for the money? I will mainly be using it to engrave metal, wood and leather.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Like I'm not trying to be mean or anything but if your someone who makes stuff out of wood for a living shouldn't you be at least able to make a good looking wand cus they look like mushrooms along it, Im hand carving mine and it's turning out really good and I only do woodwork in school like these people on YouTube should at least try and make it look more natural and stuff",
    "likes": 0,
    "video": "Making the Elder Wand from Harry Potter out of Walnut | DIY",
    "video_id": "Vj87a9iNA7k"
  },
  {
    "text": "hi just wondered if you had heard of the gweike cloud. it is very similar to the glowforge and makerbox but much cheaper, would you think you might take a look at one for a review cheers Tim",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Did it land in the same place where it started??if not how did he find it",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Great vedio!  Thanks!  Question, looking for a good quailty laser, a little on the higher end but trying to stay under $5k. What would you rocommend?",
    "likes": 0,
    "video": "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review",
    "video_id": "aBj0mJezcFU"
  },
  {
    "text": "Sure i'm not the first to comment on this, but all of you outer tongue pin holes should be elongated along the width axis of the table, otherwise they will fight the expansion of the wood and you could end up with some weird movement.\n\nAlso, offset the breadboard holes 1/16\" out compared to the tongue holes so the pins actually draw the joint closed when they go in (called draw boring).\n\nObviously this is more of a \"tips\" video than a full on how to, so you probably already knew/did these things. Just thought i'd share in case you didnt :)",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "A bunch of reviews said the software updates change the lasers parameters and skews the designs and script. Was that corrected?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "You are joking right? a 5W for 1200? granted i see a big use for the portability but 1200? Was looking at a 3 axis CNC for that price range a few more $$ and you can get a 7 watt laser output attachment way over priced.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Would this be better if you could get air supply in??",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Hi, what laser engraver do you recommend for engraving coasters like wood, glass, slate and materials like that ?\nI will only be working with coasters. For home gifts. Thank you. Go Army.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Hey quick question. what file should I use for me to write quotes save and engrave ? I can’t figure it out if I write something or costume make something and save it is telling me not fund on file need help please",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "just a head up it is not a good thing they only run on ther own softwear why are you trying to sound like its a good thing ????????????",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Thanks for the great tutorial! I recently bought an SVG file from a shop on Etsy that custom creates these sorts of maps, but I'll have to try this out myself next time.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "Use this to rapidly make permanent business cards on or next to the cork boards that let people hang up their business cards.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I’m very interested in the size of your shop. I also have a small space that I’m barely turning into a shop. It’s a 12x12. Sometimes I question if it’s going to really work out. Can you show give us tour thru you shop? I’d like to see the layout. TIA",
    "likes": 0,
    "video": "How to Make a Cedar Window Planter Box",
    "video_id": "KYGUPqJ2bL4"
  },
  {
    "text": "I would love to see some more practical engraving examples ... YETI mug, glass, black granite tiles",
    "likes": 41,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Sounds like he's more of an 'unboxing guy' than a tech guy.",
    "likes": 4,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "But will it cut 1mm Ti sheet? Asking for a friend...",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Hi. I am looking for a Lazer engraver that can work on plastic, stainless steel, aluminum, iron, surgical steel. How hygienic is an item after it has been engraved and sterilized?",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "is that bad for your eyes seeing the raw blue lazer like that??!?!?!",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "would you happen to know how the laser can last if a person buy this product how long to you think a person can keep creating projects before the laser goes bad or need replaced",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8"
  },
  {
    "text": "Love your videos! Can you tell me what laser brand and size to start a business solely engraving large wine bottles? Size range from 3” to 8” in diameter and 12” to 24” tall. I’m assuming a rotary attachment is necessary..\nMuch appreciated \n\nJP",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I’d rather be hardwire to the unit that is compatible with Lightburn than having wireless capabilities using their proprietary software that can’t do much for $700.00. Sorry, let me know when that happens otherwise it’s not worth it.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "do the lasers ever run out like buying a machine like this or any other ones how long does machines likes these last",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "You really need to pay attention to what you say, particularly with numbers.  Is it .16mm or 1.6mm?  You said both, and multiple times each.  And is the coverage 100mm or 1000mm, because you also said both.  Numbers matter.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I have been waiting for this to unlock the potential I needed an engraver for",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I asked my wife to get me a Laserpecker for christmas. Her response was \"Hell no, you aren't sticking a laser pecker in me!\"",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I LOVE YOUR VIDEOS! I’m about to buy a laser. Should i get the xTool (10w) or the Foxalien Rizen 20w?? I haven’t seen your vid on the foxalien so I’m jw!",
    "likes": 0,
    "video": "The Best Laser Cutter for any Budget?",
    "video_id": "d8NuMq7nH7s"
  },
  {
    "text": "Great review. I didn't hear anything about cost? That would be nice in a review.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Great review. I've been waiting for galvos to become affordable. Great trend right now.\nAt 13:17 you started saying the width was 1,000 mm. Is it really 100mm?\nI finished the video and you did say 100mm. Nicely done. I'm hoping we see a lot more galvo laser offerings and reviews from you. thanks!",
    "likes": 3,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Wow expensive. Seems like this also cries out for a vacuum table to suck down the card stock. I take it the base can be removed and it screwed to your own base that might be a vacuum table.",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "So if you slide something through that slot, it won't be in focus.   Because the focus point is below the cover.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Can you please share the ironman helmet template's link?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "I think your  speed units are wrong. 11,000 mm/sec should be 11,000 mm/min.",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Hey Brandon, great video and content, I didn't know about this til now. I have a question for you, I recently bought the Atomstack a5 pro and I noticed the x axis where the laser module mounts there is play in it where it rolls on the rail, not sure if I'm describing this right but simply put is the suppose to be play in that? It can rock back and forth but the few tests that I've done it doesn't seem to be rocking, just smoothly rolling on the rail.  You're my go to laser guru. Thanks for the help and God bless you and your family and our entire YouTube family.",
    "likes": 2,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "So does it have a F-Theta lens to be able to focus flat over the whole work area??",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "ORDERED THIS AND PAYED  FOR IN FULL OVER A YEAR A GO  , IT STILL AS NEVER  ARRIVED!!!!!\nPLEASE PLEASE DO NOT ORDER OR SEND ANY MONEY TO THIS COMPANY.",
    "likes": 0,
    "video": "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review",
    "video_id": "hzgw_3oQsQ8"
  },
  {
    "text": "ORDERED THIS AND PAID FOR IN FULL OVER A YEAR A GO  , IT STILL AS NEVER  ARRIVED!!!!!\nPLEASE PLEASE DO NOT ORDER OR SEND ANY MONEY TO THIS COMPANY.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Have you read the comments on Kickstarter?  Very very negative.  Makes me concerned that your review makes people trust the company and they get disappointed by the actual purchase security.",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "what about safety? remains a laser, stronger than 0.5mW, so it is a class 4 type? Is there a warning on the device? Not sure if you can even sell this officially in USA since safety with lasers is a must and most of these chinese lasers look great, but if you loose an eye, then nobody home in China.",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "When cutting plywood with a 10W machine like this, what is better - setting it to a higher power and doing fewer passes, or going for a lower power with more passes?",
    "likes": 1,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "Thx for your preview appreciate it. What about engraving realistic picture in nearly photo quality?",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Very informative review, thank you.  Will this cut 0.75 Baltic birch?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Hey i have been using a xenetech 912 (it has finally died 😩) I make plaques and i don’t want to spend 10k. Any suggestions of a machine ?",
    "likes": 0,
    "video": "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review",
    "video_id": "NQoeYksA_ao"
  },
  {
    "text": "Would it be easy to do tiling with the D1? I would like to use it to cut patterns in fabric but the cutting area is a little small for my use.",
    "likes": 0,
    "video": "The Nicest Laser Engraver This Year? The xTool D1 Review",
    "video_id": "85pafRzaf0s"
  },
  {
    "text": "Thanks for your review.\nThe correct term for the \"bit\" is a cutter.\nThe big negative I saw was that the lead screws are not protected from dust and swarf, especially the Y screw (under the table).\nThat would be my FIRST thing to do is cover it.\nI would imagine the accel/deceleration can be changed.  You just do not want to make it too short of the steppers will miss steps.",
    "likes": 1,
    "video": "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review",
    "video_id": "DLOViqe9zRY"
  },
  {
    "text": "Tks for the review. How will a Newby like myself know of the upgrades ie short coming to do something about them. Seems like  a pig 🐖 in the bag buy.  \nPlease advise of a functional buy as I would like to print large items.",
    "likes": 0,
    "video": "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?",
    "video_id": "TAE1QBmVYSI"
  },
  {
    "text": "If you ever want to give away a laser set I would not mind being a recipient!",
    "likes": 0,
    "video": "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!",
    "video_id": "vRLJz2QB-Gc"
  },
  {
    "text": "How does it perform on hardwood materials just purchased one and the end result is very patchy on some reclaimed oak flooring",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Wow! So I can actually take this laser etcher into a bar, have a drink , proceed to the toilets and laser etch a penis onto the wall?? What about air assist?",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "Nice video on a cool little laser! Looks like it’s performing well for you, too!",
    "likes": 2,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "I like the machine, hate using phone apps for creative work. Can you use it with Lightburn or other desktop software?",
    "likes": 1,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  },
  {
    "text": "That laser looks really cool, however, would you recommend it to someone who has never used a laser and is looking for a small one to learn with? Thank you for your time, Gentle Hugs",
    "likes": 0,
    "video": "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review",
    "video_id": "S3TneioSp9I"
  }
]