[
  {
    "text": "I'm trying to compare this to Google maps,  I cannot find the location where this was filmed anywhere? Unless I'm blind?  Great video, love the 360°!",
    "likes": 10,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Hi thank you for the video. I'm new to laser cutter and I'm looking for a small on budget laser cutter to cut and engrave acrylic sheets what do you recommend?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Whose idea was it to put the box level with the view finder on the cam? Next time, raise it higher so it doesn't obstruct any of the view...other than that, pretty damn good view! Oh, flat as a pancake.",
    "likes": 7,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "It’s neat but huge and it would defiantly be cut from the hilt",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Hello.. I have similar Laser engraving machine. I have problem last few days with cutting acryl glass and with plywood... It didn't cut files that it cut a day before. His puls dot is ok, It pass through material, but in files doesn't. Can you help me what to do? I have allignment mirrors and changed a water and clean lens. And I have no ideas anymore what to do.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "What would be really cool for a hinge mechanism would be a gear shaped piece that held it together and allow it to fold both ways with a lock, and a release hinge that would turn it into two lightsabers.",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "This isn't a tutorial, it's a demonstration that you can do things on your computer too fast to actually see.",
    "likes": 8,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Hi, nice tutorial, greetings from colombia...enjoying your videos (do you have a render tutorial video?)",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Do you think this can engrave text .003 inches deep on anodized aluminum? Maybe text that’s approximately 1/16 inches large?...",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I don’t like that one of the hilts is the size of an average double saber. It’s a cool design but whoever in Disney designer it should’ve thought a bit more about practicality",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Excellent to see that woodprix has new plans what helped me save some money and energy to build it.",
    "likes": 2,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y"
  },
  {
    "text": "Thanks, very interesting. Can this laser engrave on metal with thermal grease?",
    "likes": 7,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "What is it with people thinking that the ground in their plug is grounding this machine!!! You're not the only one I've seen. You said, \"I haven't grounded this machine but we'll see\"!!! What is it you want to see? How the live wire of the laser can arc to the chassis & what a few thousand volts feels like? The Chinese don't normally ground anything, in fact they just cut it off, even on outdoor lighting so imagine how important they must think it is to include it with this machine!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Dude, I watch your videos and go by your recommendations but man this gearbest.com is terrible. You need to look into this. They have an F- grade on Better Business Bureau. Hundreds of people have not received their paid for machines or have had their debit/credit cards charged multiple times for one transaction. I want this machine...but I'm not budging until I can find a trusted source to buy it from.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "That foam brush makes me cringe.  ALL I ever use when staining wood is a very wide staining brush with bristles meant for stains.  It works beautifully!",
    "likes": 4,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "For what it's worth, fiber galvo lasers are starting at around $2500, if metal engraving is your primary focus. It's a lot quicker as well.",
    "likes": 3,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Gr8 video. Can U put a stronger laser on? And 2nd would it be to make it bigger? Looking for 100x80cms Cheers Graham",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Is a pen attachment  possible for this machine, like a pen plotter?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "do you see fusion 360 as something that can develop through time and not get obsolete like how sketchup?  would it stand the test of time?  thanks a lot.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "What was you doing to the board at time stamp 1:20?",
    "likes": 2,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "This is for Intermediates; not for Absolute Beginners. Saying \"you could create it this way (and then draw it), but I'm going to show you another way\", tells us that Fusion is very flexible. But it confuses many people. Just show one way and stay committed to that way; don't change in the middle and say \"or we can do it this way\".  This is a very helpful video, but it will be one I have to watch about 4-5 times in order to get certain points down.",
    "likes": 10,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Hi may I ask what CNC software did you use? Am looking into getting one. Thanks!",
    "likes": 0,
    "video": "Build a Rubber Stamp with a Removable Handle // DIY",
    "video_id": "8CALEo7obec"
  },
  {
    "text": "Do you use the free version of Fusion 360 or the Professional version?",
    "likes": 2,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Is this strong enough to engrave into cups like yetis?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Maybe you should include Trotec laser in your next comparatives.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Used to use SketchUp. Now Fusion 360. I don't think I could go back now.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "I wonder where is the ISS is... they said it took roughly 93 minutes to make an orbit to earth, .... So it should be seen on the sky,\n\nanyway this is a beuatiful video... earth is so cool",
    "likes": 2,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Hi sir, can you suggest me which program i can use to convert bitmap or pictures to G code format ?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Thanks for the video - What engraver machine would you recommend for Cookware \"Pot and Pans\"??",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "hi i am new to laser engraving / cutting. that's why I'm grateful for any help. I find the small machine presented quite exciting. I am looking for a CNC laser to engrave and cut silver and gold jewelry.\r\nHow many watts are sufficient for this? Could I possibly upgrade this small machine with a 100W CO2 laser head? Thanks in advance.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I'm typically not one to comment on Youtube, but thought I might add here - I watched this because I like your videos and you tend to recommend Fusion 360 (and I've seen others do it too!) but I wanted to add - I'm pretty sharp and used to CAD programs, but I feel like you zipped through some things so fast I had to go look them up outside of your video to figure out how you did what you showed. For example, your bit on mirroring the table legs, I was following along and found mine wouldn't work - I got \"Compute failed\" and \"One or more patterns could not be intersected...\" etc. I googled it and found it's because you've got to change Pattern Type from \"Faces\" to \"Components\" in the mirror window. You have it selected (likely by default) but didn't mention it to us absolute beginners :P.",
    "likes": 16,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "At the base level there's any difference between an Ortur, Alfawise, KKmoon ? Because Gearbest actually wont send me to Italy (for Ortur)but i've found KKmoon on Amazon that looks the same as the Ortur but with a different name (and specs?) on it.",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Can you cut vinyl stencils with something like this?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Do you have a phone contact for gearbest.com? Per your recommendation i ordered this laser from them. Order came in without timing belts. It's been a week and no response to the two emails to support@gearbest.com....or what ever there email is.. i don't have it on me at the moment.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I've been going back and forth between a diode laser and a CO2 laser like the K40. I am nervous about the lack of safety on the K40 but don't want to spend the money on a more expensive type until I determine how much I will use it. I love my 3D printer and this just makes since to me to get a laser that can cut as well as engrave.... so frustrated",
    "likes": 0,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Make more videos about the cnc co2 laser 50w chinense please, your videos are awsome!!",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Would I be able to place a larger peice of wood under it in engraved like the 1st model just certain areas on a large project?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Hi ,50w machines can cut how many mm wood, I need a lot to answer this question",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I was looking at the Beamo Flux.  I would have gotten it, but I want to work with a larger area.  I went with the Full Spectrum Muse Core.  It doesn’t have a camera, but I’m used to not having one anyways.",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "I've got a 20w fiber laser that I'm willing to play with samples or stuff. I've got a k40 and also a glowforge too. msg me if you want to talk about it.",
    "likes": 2,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Would you be able to review the rotary/riser upgrade on the Muse?",
    "likes": 1,
    "video": "What is the Best Laser Cutter and Engraver for You?",
    "video_id": "Cj4Bp_BIK7s"
  },
  {
    "text": "Put a tiny shield around the beam and reflected light... but also wear glasses!",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "OMG!  This is such a helpful video before I build my first table! Thank you! : )",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Thanks for the informative video. I'm hoping to engrave white acrylic, through a layer of paint. Which would be best for this - the cnc router with an engraving bit, or the laser? The paint is water-based and I'm not sure if the laser would burn it too much, or discolour either the paint or the acrylic?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Awesome video thanks. I was about to buy this and realized it will not work. Can you recommend a laser that we can use to engrave Bamboo and Acacia wood boards? We need to be able to insert a board up to 20x16 in into it but the print area is much smaller. Any and all info would be greatly appreciated.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Great tutorial! I haven't engraved yet, but I'm still playing with the program(s) to get the file looking the way I want. I was having a hard time with Illustrator, but, I think the problem was I wasn't getting the fill right in the map program, as well as not \"expanding\" the layer I wanted before uniting the layer.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "I have been a painter for over 30 yrs , the best stain to use for a butcher block is FOOD COLORING ! I have done many kitchen islands and have used this method for many years .",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "Can it cut object longer than 20\"? Is there any passing through? Using this for business is OK? Like Etsy wood name sign.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Hi, I really need an offline mode for this.  Does this have an offline mode where you can download the file to it and unplug your computer to take the unit to another location like outside??  I tried a no name one from china and had nothing but problems with it, but the offline mode Was a critical feature.  Thanks in advance.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Is it possible to get a file for Ravens M&T Bank Stadium",
    "likes": 0,
    "video": "Carved Wooden Football Stadium Signs on the CNC // DIY",
    "video_id": "4EmIo-LUY8s"
  },
  {
    "text": "Glasses over safety glasses. 😅 I feel you bruh! So detailed here. Thank you 😊",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Going to try the jig idea, but with a router table, I have no table saw. I think dowels can help in that approach, as well as the miter saw. Don't put metal near the blade, if you have options. You miss using a dowel to hold things in place, no harm, no foul. Thanks for the jig idea.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y"
  },
  {
    "text": "How thick EVA foam can it cut? Can it cut 10 mm EVA foam?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "I love the video great job bud if u dont mind what setting did you use for Jimmy Hendricks poster I'm a huge sports fan having a hard time with some of my images",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "How do you know it won't land in the middle of a road, on a powerline, on somebody's roof, or somewhere inaccessible?",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "oh great, an even more distorted version of whatever the fuck is being recorded...\nespecially if it's the flat ass horizon at eye level from 120,000 feet (edge of space) \nand nothing but silky blackness above it; not a single fucking star in sight.",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Hello, have you tried engraving any cylindrical items? I see that you can buy a rotary attachment but how does it work?...The machine isn't deep enough. Also, do you know if it will engrave \"Yeti\" type material cups?",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Honestly rise of Skywalker was meh would of been better if Rey actually turned to the dark side",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Would this work for a glowforge? It comes with one of those hoses that suck out the smoke outside but I live in an apartment and don’t want the neighbors to think i’m starting a fire. I’m wondering if I just don’t use the filter that comes built in it at all since it’s so loud and using a air cleaner like this.",
    "likes": 0,
    "video": "Air Filter vs. Fire, Who wins in the shop?",
    "video_id": "8Gup4P6qJhI"
  },
  {
    "text": "Hello , may I suggest a solution for perfectly lined up drainage holes that you could add as an update to your video.                                      Take a drill and from underneath your window box drill up trough the drain hole into your planter for easy perfectly lined up drain holes. When building new planter boxes place the empty planters in the box and drill through the pre drilled holes in the planter into the wooden planter boxes for perfectly lined up drain holes. Happy planting, Bob Mahaney",
    "likes": 1,
    "video": "How to Make a Cedar Window Planter Box",
    "video_id": "KYGUPqJ2bL4"
  },
  {
    "text": "Hi. I just would like to ask if i can use your profile for the Longer LK2 what is the alfawise U30 but with new name. I read it about them and don't looks any difference in bed size, nozzle size, filament size. Should be good but i would like to know your idea as well. I keep playing with the settings in cura but no success at the moment. Thanks mate.",
    "likes": 0,
    "video": "Is a Budget $250 3D Printer worth it? Alfawise U30 Pro Review",
    "video_id": "-15hT4HioZo"
  },
  {
    "text": "have you tried engraving or carving stone with this?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "With this machine and this software ...\nCan you engrave any person picture in leather wallet???",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "While I like the use of the mirror command, if you use a drawing to say produce a parts list you will have each component separate. So parts that are the same won't get combined in the parts list table. Because of this I am stuck with using the move command and making copies. Only problem with this is if I change parameters for sizing, the parts don't get moved to the correct location. Is there a way around this?",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "I really enjoyed this video!  I recently bought a Muse 3D and am still very much a laser newbie.  Keep 'em coming, please!",
    "likes": 4,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Looks like a great solution!  What type of plywood did you use for the top?  Is it 3/4\" birch?",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Storage for the Shop",
    "video_id": "0N1_P62GMuw"
  },
  {
    "text": "Excellent video!  ...But I agree with the others that you move a little too fast for an absolute beginner, I'd recommend anyone getting started to check out DN Handcrafted Pencil Box series, BUT then come back and rewatch this video after because this video is packed with loads of great tips.  Highly recommend.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "I use fusion 360 as I learned in the industrial world and engineering school with SolidWorks and CATIA, and Fusion 360's design philosophy seems a lot closer to those platforms",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Does the laser leave an ash residue when using on wood? I've seen a video of another laser and the presenter said that it was very easy to smudge",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I just received mine and trying to get it all set up. Test the laser. But I realized. On the right side. In the machine itself. There is a bracket. With screws and if my laser head is on the side it won't budge. I am trying to figure out if that is normal or not. It's right near and under the screen.",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "I don't understand why people want to burn an image on wood or paper, what's the cheapest I can do metal engravings for?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I have a K40 laser and after watching your video I decided to get one like yours on this video.  I'm getting familiarized with it now but I'm wondering how to you check the temperature of the laser tube.  The K40 has a gauge I can monitor to see when the water is getting hot, but I don't see way of monitoring the tube temperature in this one.  Based on your recommendation, I bought the one with the Ruida control and I just downloaded a trial version of Lightburn.  Thanks for the video.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "would this cut foam board? And do you recon if you where to extend the gantrey it would work, to fit an A1size piece of foam board for example?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "You can use these on leather too, but make sure you’re vented or outdoors if you do so because it STINKS! These work well on wood, even with larger images.",
    "likes": 6,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "well I have 9 days \"off\", I installed 360 last week, wife wants a cabinet type thing for her big arse printer and cameo... guess I will have to take your free course then. I have already used some of autodesk's stuff and fairly competent in Autocad but a guided tour from someone, who I know makes good quality content is a welcome thing  THANK YOU!",
    "likes": 1,
    "video": "This is Why I Use Fusion 360 to Make a Bed.",
    "video_id": "ZB2fe-o41_c"
  },
  {
    "text": "Thanks for the video!..Any idea how this would fare with 0.5mm steel?",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I really need to know if I can take this an engrave logos on 12 sided dice.  Best option for purely engraving 12 sided dice?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Quick answer: YES, you could have made a BIGGER one for the same price!",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "God yeah its from China your be lucky it lasts a month 😂",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Please suggest a laser attachment for my cnc machine. Thanks",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I started with Sketchup many years ago, then I transitioned to Blender, but I never REALLY got the hang of it for the types of things I do. Then I got a 3D printer and discovered Fusion, and it very quickly became my go-to 3D software, for everything. Learning curve is steeper than SketchUp, for sure, but it's still way easier than more \"professional\" software like Blender or 3ds Max.",
    "likes": 10,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Wouldnt it technically be \"TL:DW?\"  Too long, didnt watch.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Do NOT buy from this company! The reviews are fake and chosen by the company! Your order will never ship and questions will only be answered by bots with pre canned answers! If you don’t believe me DM me and I’ll send you the screenshots. I believed the individuals on YouTube reviewing their products! They are pushing a company that does not ship items. Very very disappointed. Should have known better",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Don't Macs run Linux? There are lots of GRBL interfaces for Linux. I use bCNC but lots of people like Linux CNC.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Yeaaa… I wouldn't trust those even being in the 2W range... The X-Carve CNC Milling Machine in my basement ( https://imgur.com/a/04LhFJN ) has had an *Opt Lasers PLH3D-6W-XF* Laser Head attached to it which trust a LOT more being what it is marketed as than anything else coming from the Asian regions of the world ( Unless it had _Made in Japan_ stamped on it ). I also think what most people miss out on is that those Lasers don't just pose a threat to your sight when looking into the Laser with line of sight but they also pose an issue with reflections ( light bouncing off a mirror ) and refractions ( shining a strong flashlight _through_ your hand ). Besides THAT there's also the issue with cutting certain materials - Laser cutting ABS, as an example, will emit Cyanide!",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "I have a small business but would like to extend into doing my own custom engravement and invest in some equipment. I have zero idea what to get for what, is there a way to contact you and you walk me through the items that would be best. Thank you",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "OMG that is cool I like this video can you do a another video plz🥺💜🤍💗",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Thanks for this great and amazing video, this is really cool feature. Would be nice if you show how to get data from underwater levels in QGSI would be very thankful :D I it tried many times but no results for now :(",
    "likes": 1,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "I'm looking for a laser engraver to do custom work on my projects. Wonder how good it is on hardwoods",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Hey! I'm looking for an affordable and pretty easy to use laser engraver to do some DIYs for my wedding 😁 I was wondering if this can engrave a wooden hanger? I was thinking of engraving our names on the hangers. Thanks",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "incredible work, what is the name of the system with which you make star maps?",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY",
    "video_id": "d3paxgFMtYk"
  },
  {
    "text": "hey, great videeo, thank you, can you suggest settings to engarve cork with this? i bought one of these 20w and i mostly want to engrave on cork, its not here yet but you may can give me a good starting point? thanks again",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Cool. I was thinking about this ingraver. The price is right about the acceptable amount to give engraving a try. Already have too many hobbies but; one more couldn’t hurt. Can this engraver cut out parts in plastic? In open air of course.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Love the info on your videos.  I’m looking to expand my side business.  Obviously this would work for my wood projects.  But would this work with rotary and engrave steel cups covered in either powder coating or paint??",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Yeah,  well I ordered one of these and it stopped working after the first use - the laser would only run at very low levels, engraving nothing. Tried everything and apparently the laser itself has failed so I attempted to contact support at GearBest. This is where it has gone terribly wrong - they simply do not respond to requests of any kind. Is that because of Covid19? Don't think so as I could live chat with them, they are sending out advertising emails, and there is nothing on their site about the Coronavirus. So, the live chats end with \"you will be contacted in this regard in 24 hours or less\" which I have been told on three separate occasions and received nothing. Opened tickets on their support site are closed without any followup within a day or two and sent emails that go unanswered. \n\n\nNice.\n\n\nSo I would stay away from this product and GearBest.com at all costs and just spend the extra money on a real laser engraver rather than this junk from China. You get what you pay for.\n\n\nBTY, I submitted a dispute to my credit card company and they have refunded my money - even they couldn't make contact with this outfit.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "21.18 - he says he presses parallel but he actually clicks colinear",
    "likes": 2,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "These pre-made butcher blocks are already pretty smooth. Hand sand with the grain and only use a fine or ultra fine sand paper or sanding block. Treat it with pre-stain and then stain. Make sure the prestain and the stain are either both water-based or both oil-based. If you decide to sand in between finishes, make sure to also use something that's ultra fine like 400 grit. Also do it within 24 hours of taking the wrapping off.",
    "likes": 3,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "Have you ever seen this, I'm wondering if its worth it, https://m.facebook.com/story.php?story_fbid=10158394680867329&id=767217328?sfnsn=mo&d=n&vh=e",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Did you try to laser on a metal? We want to engrave on dog/pet tags. Typically aluminum or Stainless steel.",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "You can also use dry erase markers to engrave clear plastics.",
    "likes": 1,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Can I engrave and cut at the same time without Ruida controller?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "How would you install a kitchen island with an overhang? Thought about support brackets on corners but everywhere I look stares to make the holes large to allow for movement so how useful would they really be then. Want to avoid cracking/cupping of the large island. TIA!",
    "likes": 1,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "Just order the one with the 20w will solve all the problems",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Great video... thanks for posting. I ordered mine from gearbest on April 4th and still waiting for it to be delivered... how long did you have to wait for yours to be delivered? I am hoping it doesn't take more then a mount to get here.",
    "likes": 4,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "You went all that way ... and, didn't show it running.  The sped up video didn't show much.  A bit disappointing.",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Good project but..man.. you talk so fast as if there is no tomorrow.  I find it very hard to take in what you are saying. you need to slow down, please.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Hey bro love the videos . So I want to start getting into this laser Engraving.  What would you recommend something not too overpriced and something that will be good for engraving glass cups wallets\" leather\"  Cutting bords and so on .I'm a  Beginner so I want to start off small before I look into buying big machines machines. Do u have any recommendations? I like the one u have in this video price is good . At least a start off with small projects but could it engraved in glass?  And with this machine will be able to do it? Thank you",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "New Subscriber, Great Video.\nI have been debating on ordering this.\nWhat is GearBest.com is it more a less like\nWish? Chinese manufactured products?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Is 50W enough for engraving on metal or do I need more power, like 100W?\nAnd after 1 year of using are you satisfied or would buy something different year ago?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Can you please send pictures of the stepper motor cable and how's it hooked up, need to make my own, thanks",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Love your videos!\nI had purchased and was playing around with my ortur engraver, but I just can't seem to find a way to get the track laser on. I am using Lightburn and I was wondering if anyone knows how to turn on my laser manually in low power so I can focus the laser.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I'm pretty deep into Sketchup and just a baby at Fusion 360.\n\nSketchup crashes a lot (for me). And it can't import-export unless you want to cough up a good chunk of changed.  I can get quite a bit done. Sketch-u-cam helps a lot. It's a bit limited and buggy too.\n\nIt's a bit early in the game but F360 looks quite promising. I'm already doing things in it that would be completely hairy in sketchup.\n\nI'm going to argue that Sketchup is great at the beginning since you can get going pretty fast with it and there's a reasonable gamut of stuff you can do with it using a 2.5D methodology. Great for the dating stage with your cnc machine. \n\n\nBut if you are going to marry your cnc machine a person should add F360 to the mix. You'll be able to delve deeper.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Hi- great video, can you engrave wood  cutting board using this?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "thanks for the vid, is it more like a burned stain or does the engraving have some depth in the wood?",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "going back and forth between this and a glowforge plus. any advice?",
    "likes": 3,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "that has to be the most peaceful landing i have seen in any of these videoes!",
    "likes": 0,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Some nice information! However, I'm still not convinced... Lots of the stuff you showed like resizing the countertop and drawer can be done very quickly in Sketchup as well. I see all these tables and screens full of dimensions and numbers, but I think with some experience you will be faster in Sketchup in the end, since it's so easy to use.\n\n\nFor the organic sculpting there are very good and simple to use plugins for Sketchup. And as for printing, Sketchup can export directly to STL as well, I use it for 80% of my printer modeling (and some blender sometimes). The built-in slicer in Fusion is cool, but if you're used to a normal slicer like Cura or Slic3r already, this doesn't have much more value over using Sketchup.\n\n\nAbout rendering...  I actually use Sketchup for this professionally,  with a plugin called Twilight Render. It may not be as powerful as for example Vray ( which also costs an insane amount of money), but it can make REALLY realistic renders, better than anything i've seen coming out of Fusion.\n\n\nNow... I'm not saying that Fusion is bad; If you want to do some complex and organic modeling and product design, though it can be done, it's not very easy in Sketchup. For extremely parametric stuff, like the lego bricks you showed us, this will be better as well. But I still think people really write off Sketchup too quickly, and often overlook what that piece of software can do with some additional plugins, ESPECIALLY for interior design and non-organic stuff like that. The workflow and interface sure are infinitely more intuitive and simple than any other modeling software out there...\n\n\nYou're free to use what you want of course, both are valid options, but don't underestimate Sketchup if you like a really hands-on and intuitive workflow.",
    "likes": 2,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "I bought this unit and so far it’s been quite impressive to use , thanks for the demo .One question I used Lasergrbl with drivers under windows ten no problem. I tried using lightburn with and without drivers and no matter what it just says cannot connect to controller ? Have installed firmware 1.34 as per Ortur instructions but no go, any ideas or suggestions appreciated 😊",
    "likes": 3,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Do you need to use a special baby friendly paint for the crib? Because I'm thinking of using a off white lacquer for my baby's crib.",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodworking",
    "video_id": "3JsR6qb-Dmg"
  },
  {
    "text": "I wanna se the cutting capability. Mainly for craft paper and cardboard, if it could be used for building architect models.",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "How do you determine where to place the item you want to engrave so it lines up properly? Help please",
    "likes": 2,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "jesus take that chainsaw away from him before he kills himself. watching him with that saw made me grit my teeth thinking i was about to see carnage. cool planter though.",
    "likes": 0,
    "video": "Carving a Baby Groot Planter out of Wood",
    "video_id": "Xu52e5qek1M"
  },
  {
    "text": "So I got this laser but I'm missing a part can you please tell me what size is the motor control cable?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "How long did it take to do the Jimmy Hendrix lager engrave?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Wow, I'm subbing.  Ive been wondering how people make these because for some reason images of topographic maps seem to be so copyrighted.   This software looks awesome.  I really love the map and lake stuff.  I have the same or similar blue 50W laser as well.  I've made a bunch of cool stuff and feel the possibilities are endless.",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  }
]