[
  {
    "text": "hello, a question, but do you use lightburn software because it is the only way to communicate with the laser machine? are there other software that can communicate with the laser? nice video compliments",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "I don't have illustrator so I'm trying this in inkscape. I'm having difficulty getting the different widths to my roads when exporting to lightburn. The roads are coming in looking like dxf files. I think I'm supposed to change the roads to shapes in inkscape but I just can't figure out. Would you know the process you do in illustrator but for inkscape?",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "The same company sells a 20w laser for this system. It's about $100. Do you think the additional power would be worth the purchase?",
    "likes": 3,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "So I notice that they sell a 20w laser separate for about $100. Do you think it would be worth the money to purchase that additional laser?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Please let us know if you build a enclosed housing for it. ty",
    "likes": 1,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Another close fly-by of an F-16 (or whatever) at 2:48:50 from the direction of the sun nearly same altitude  but just slightly higher.",
    "likes": 5,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Please slow down I'm trying to learn, when you jump around it's not possible to keep up.",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "WOW nice video! please guys share this video for him! and like my comment!",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "I was all for fusion until it wanted all my personal info... that's a deal breaker for me.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "A router with a shank bit would’ve helped for the 84 mortises. Great video though bud!",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodworking",
    "video_id": "3JsR6qb-Dmg"
  },
  {
    "text": "What version of the software do you buy? Theres 3 choices listed on that manufacturer's website.\n\nThanks in advance",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "HI. Nice clean build. Just finshed my cnc. Have a Look on my vid.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Thumbs up, but you spelled Jimi Hendrix wrong.  Does that thing have eraser mode?",
    "likes": 0,
    "video": "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review",
    "video_id": "bCUsQjJNG-4"
  },
  {
    "text": "Hi mate, how do you make the roads to be fills not lines? Everytime i export roads / highways they export like lines...not shapes :(",
    "likes": 0,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "Great video! I just bought this laser cutter 2 weeks ago and love it.  Tech support is great and in USA!",
    "likes": 1,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Hi great video!!! Can you go a little bit slowly in your next project. Thanks",
    "likes": 5,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Would it be possible to cut out on like plain card or paper successfully on this laser cutter. E.g making laser cut cards?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "The actual laser beam is aroung 4.5 watts, not 15 watts as a lot of people think. The power supply is 15 watts.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Hi, great vid. Question, how does the laser know where on the material to start Engraving, let's say I have a 50mmx50mm sheet of card and I want the entire thing shaded black, how do I know where to put the card under the laser",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "It should be noted that the free version of Sketchup has limited functionality.  For $119/year you can get a less limited version of Sketchup.  The fully functioning version of Sketchup is $299/year.  Some other free alternatives are Blender, BRL-CAD and Tinkercad.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "Can you fix the Amazon link for your T Track Knobs?  Great video!",
    "likes": 0,
    "video": "Building a Simple (and Cheap!) Miter Station + Storage for the Shop",
    "video_id": "0N1_P62GMuw"
  },
  {
    "text": "You overshot \"Absolute Beginners\". I'm looking to make the move from Sketchup to Fusion and learned Sketchup watching videos like Jay Bates, etc. I was trying to watch your video and work along but you move too quick through the small things. How do I get to the parameters window? I had to rewind and go through, watch again, and then do it. If you're going to focus on beginners, slow down and explain the small stuff. Your default units were inches, mine were mm. How do I change that? Point being, this isn't a video being for \"absolute\" beginners.",
    "likes": 28,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "Does this also cut?? Looking for one that cuts wood to make miniature furniture",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Wow men, it’s beautifull, could you send me your template PNG file? 🥺❤️",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY",
    "video_id": "d3paxgFMtYk"
  },
  {
    "text": "Hello, I love you, you could send me the measurements of the girls shelves. a hug 5:38",
    "likes": 0,
    "video": "Build a Built-In Closet Organizer (Woodworking DIY)",
    "video_id": "_CnF5mvUXYQ"
  },
  {
    "text": "Giuro ê stato emozionante ...sembra di stare in prima persona e poi ha una stabilizzazione il video che ti fa godere fino all'ultimo 👍🏻👏🏻❤",
    "likes": 0,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Spoiler alert\n\n\n\n\n\n\n\nSadly it doesnt happen in the movie",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Thank you so much for very informative video! I have in mind a project out of card board, paper. I'm wondering if there's an option to design with that kind of material using Fusion 360?",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "\"Potato\" is spelled wrong. You only put the \"e\" in when its plural (Potatoes).",
    "likes": 5,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "hi, what should be the right CNC machine   in order to create ball from wood ?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Why use a lens that curves everything? Why not a regular one so we can see what it really looks like? FLAT!!!!",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "alot of cool functions in fusion 360 wich makes the process alot faster... BUT there are so many functions its hard for a beginner... sketchup is very basic and simple i used sketchup often , i tried to use fusion and blender and these programms are a total different leve.",
    "likes": 1,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "You answered all my questions before I dived into Fusion 360, I think it will work for me.",
    "likes": 0,
    "video": "Is Fusion 360 worth learning over Sketchup?",
    "video_id": "3cFe6kGzS88"
  },
  {
    "text": "There are so-o many companies out there offering laser machines.  The same type/size/performance and teere is almost $3-$8k  difference in price. How do you know what to buy .. price .. laser wattage .. and most importantly,  customer SUPPORT for equipment & learning?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Get rid of the orbital sander when doing finish work it's only good for removing material,stain,paint and such.....get urself a nice 1/4 sheet sander and go all the way to at least 320 grit and it will look perfect and always always go with the grain otherwise it looked pretty good",
    "likes": 2,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "I don't think you can call this 3d. A CNC router would be 2.5d and this has much less control over the z axis",
    "likes": 0,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "Great video and in depth review! The Muse looks pretty darn awesome!",
    "likes": 5,
    "video": "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review",
    "video_id": "8FzsBontXMU"
  },
  {
    "text": "just wanted to let you know there were some issues with your latest giveaway. One of the youbtube links is down ( or linked incorrectly ) and your instagram is also missing. thanks.",
    "likes": 0,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg"
  },
  {
    "text": "This is not a DIY (Do it Yourself) video, you have some professional gears there. Nice video though.",
    "likes": 20,
    "video": "Build a Rubber Stamp with a Removable Handle // DIY",
    "video_id": "8CALEo7obec"
  },
  {
    "text": "Great video! What is the thickest metal you can cut?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Hey would this work to make small stencils on silver pendants?",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "I highly doubt that it's actually 15 watts. Maybe 1.5 watts",
    "likes": 3,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "He did awesome an his wife is very lucky to have him",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodworking",
    "video_id": "3JsR6qb-Dmg"
  },
  {
    "text": "Cool. I have one a bit bigger. I was not able to understand what kind of color you used to get that used finished. I like to paint mine in the same style: \n                https://youtu.be/pELS-m8jjOQ",
    "likes": 0,
    "video": "DIY X-Wing Swing from Star Wars!",
    "video_id": "cPxrSRssk1w"
  },
  {
    "text": "Hi! Great video! Just started learning Illustrator but I could not create a Clipping Mask - not shure what that does but I will google that later. Anyway when I import that file into Lightburn all my roads are just thin lines even if there were a lot thicker in Illustrator and QGIS. Any idea why? Thanks!",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "Love it! That rocking chair is WAY too cute. Thanks for sharing your process 🌸😀",
    "likes": 2,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dollhouse)",
    "video_id": "bjurXFYYUj0"
  },
  {
    "text": "No nerd, you used the laser because YOU HAVE ONE! Lets be honest...;)",
    "likes": 1,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dollhouse)",
    "video_id": "bjurXFYYUj0"
  },
  {
    "text": "HI sir I really appreciate what sharing with us ur experience details and I just wanna know how much heluim I need for a 600g balloon plaese",
    "likes": 0,
    "video": "I Sent Baby Yoda to Space (sort of....)",
    "video_id": "TvxVzK4VFfU"
  },
  {
    "text": "Hey flat earthers! 360 lens are not fish eye.\nNow go get your shinebox!",
    "likes": 6,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "It’s only right that I subscribe this is exactly what I needed to do on the exact same piece. What are the odds great video and way to keep my attention because that hard 😖",
    "likes": 2,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "Are the dimensions built around a standard crib mattress size? 27 1/4 x 52?",
    "likes": 0,
    "video": "How to Build a Crib for the Nursery! | DIY Woodworking",
    "video_id": "3JsR6qb-Dmg"
  },
  {
    "text": "yes waste lot money, today 40-50W laser cutter all cost less than 450$",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "I don’t own a laser yet. But I would like to get one. This one seems like a good starting platform. Would this engrave on metal tools ? Like wrenches and metals like that ?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Great project. My son is into Warhammer.  I am still setting up my K40. Maybe this will be a good first project. \nI look forward to seeing what you do with the Warhammer stuff, you have talked about on the podcast.",
    "likes": 2,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg"
  },
  {
    "text": "This is awesome, what kind of wood material did you use? and what's the size?",
    "likes": 0,
    "video": "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY",
    "video_id": "d3paxgFMtYk"
  },
  {
    "text": "Nice jorb.  Where do you like to get your plywood?  What thicknii were you using?",
    "likes": 1,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg"
  },
  {
    "text": "Really cool! I like how you based them all on one measurement and then just did multiple of that one unit.",
    "likes": 1,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg"
  },
  {
    "text": "Not trolling just curious, but why using metric instead of imperial (you're in the US if I'm not mistaken ?) ? Great work !",
    "likes": 1,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg"
  },
  {
    "text": "Uggghhh... you're making me really want a laser cutter. That came out so cool! I'd definitely add magnets, not because they seem necessary.. I just have an almost unhealthy fondness for magnets.",
    "likes": 4,
    "video": "Building a Modular Paint Organization System",
    "video_id": "JD_AlmF1YUg"
  },
  {
    "text": "When is the video coming out about the mistakes you made the second time",
    "likes": 8,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Great footage! Watching this in vr 4k I'm scared as hell!",
    "likes": 11,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Lol, was able to locate the location of the starting point.\nDidn't you worry for it getting tangled up into the tree branches all around you ? \nIt's like stones in a certain period of the year. ;-)",
    "likes": 0,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Great vid as usual! \nWhat's the maximum thickness of steel that it can cut? Thanks 😄",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Good video , but sorry this is not for me  , I have a regular tools",
    "likes": 1,
    "video": "Build a Built-In Closet Organizer (Woodworking DIY)",
    "video_id": "_CnF5mvUXYQ"
  },
  {
    "text": "Can you build me one a certain size and how much ?  Thanks",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "I don't know what some of these people are going on about with the antifreeze BS, but don't do that. Run pure distilled water only and put a couple drops of dish detergent and a cap full of bleach in it.  If you don't want to use bleach, then at least add fish tank bio killer in the water to prevent it from going stagnant over time.  Using antifreeze or \"water wetter\" products and the like is bad, because it cooks into the glass and actually will eventually build heat on the tube, as will minerals in the water if it's not pure distilled.  Don't listen to these dopes.  I've been running home built units for years now and have done the research for 10 men.\nAlso invest in a CW-5000 chiller and be done with it.  Doing anything less is asking for future issues in all reality.",
    "likes": 5,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Great video Brandon, did you have to use a cold temperature battery for the insta 360x to deal with cold temperatures at that height. In addition do you remember what resolution and FPS you used to get dish good quality with that long on video. I did not see this info in the other specs. Thanks, great job!!",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "This has got to be the biggest waste of money! You'd be a fool for spending money on plastic and thin metal and think you could really achieve much of anything for milling! Look how slow and how little material he is cutting during soft wood engraving! My 3d printer is more robust than this laughable thing! It only cost $100 to build. Build a MPCNC if you want cheap, cheap cnc for wood and light aluminum work.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "WOW,  Great video,  Please make more Fusion 360 videos.",
    "likes": 0,
    "video": "Designing Furniture with Fusion 360 for Absolute Beginners!",
    "video_id": "5uKLnDZTBV4"
  },
  {
    "text": "What are the dimensions...L x W x H for both sides of the workbench and the miter station?",
    "likes": 2,
    "video": "Building a Simple (and Cheap!) Miter Station + Storage for the Shop",
    "video_id": "0N1_P62GMuw"
  },
  {
    "text": "This is awesome! I would love to build this for my 2 year old niece but I can't find the plans. The link doesn't work.",
    "likes": 1,
    "video": "Custom Farmhouse Sink, Dials and Oven Top for a Play Kitchen // DIY",
    "video_id": "AZ1hdtcwyi4"
  },
  {
    "text": "Long plan to flatten the top, but I really love my belt sander and a long straight edge to mark H/L.  On pine using 60 grit, it gets flat super fast.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Any cheap freshly dimensioned wood, it is also good to run a dove board along the edges. Easy to cut out with a router, then the dove board with table saw. pound it in and let the glue naturally make the fitting super tight.  That will keep the board on the ends from moving.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Love the footage, but at the second F16 flyby, slowing it down when it starts to appear it looks like it jerks a little. Seemed weird.",
    "likes": 1,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Use a longer plane. A jointer plane #7 works well for flattening. This is advice is coming from someone who has no woodworking skills and only owns a $10 plane. jk. The issue with the small planes they follow the contour of the hills and valley. You did run the planks through the surface planer?  So you could glue two at a time do a quick pass and then glue three sections together using clamping fails to hold the panel together?",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "I am blown away. planning an edge of space affair with my kids as I think it will be so inspiring. was looking through videos and then this happened. just wow. do you have details anywhere about the setup?",
    "likes": 0,
    "video": "Sending a 360 Camera to the Edge of Space - Insta360 One X",
    "video_id": "emC8Ojz8LK8"
  },
  {
    "text": "Not sure if you answer questions, is this good for a hobby lady, for doing fun projects, like cutting boards, coasters, etc, and where can I buy it? I do have garage or can I use it in basement?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "What did you do to prevent it from moving/swinging 3:39",
    "likes": 0,
    "video": "Build a Built-In Closet Organizer (Woodworking DIY)",
    "video_id": "_CnF5mvUXYQ"
  },
  {
    "text": "Beautiful ride. So nice with the image stabilization. Commercial jet planes heard and seen at 1:08:00 and again at 1:15:45",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "This is great information! Thank you for posting! I was recently made aware of QGIS and have been leaning a ton and this helped immensely! \n\nWould love to see a video on the oceans/lakes. I would like to incorporate that into a topo map. Thanks!",
    "likes": 3,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "Very cool! I like how you can do any of this process for full-sized furniture also.",
    "likes": 2,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dollhouse)",
    "video_id": "bjurXFYYUj0"
  },
  {
    "text": "If those f-16's were checking out this baloon, I'm impressed how much our security has changed since 9/11/01",
    "likes": 49,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "How cool is this.  How do you get the 360 view that we can control.",
    "likes": 3,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "This guy talks too fast. Just decreased the playback speed to 0.5",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I made a number of mistakes on my first farmhouse table, too.   I put ash edge bands on each side and bread boards on each end, but the bulk of the table top was red fir.  Marrying hard woods and soft woods is not a great idea— the softwoods expand and contract volumetrically waaaaay more than the hardwoods, and suffice it to say that it causes problems.  My next will be one or the other.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Wow this is very cool! Never thought of it being possible to be so small and functional. Awesome. I just got started on woodworking",
    "likes": 2,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dollhouse)",
    "video_id": "bjurXFYYUj0"
  },
  {
    "text": "I couldn't find the files on your website? Did you host them? (My daughter wants to make them with me, great video!)",
    "likes": 0,
    "video": "Making Super Tiny Furniture! (Miniatures for a Dollhouse)",
    "video_id": "bjurXFYYUj0"
  },
  {
    "text": "Just wondering how much did that much maple wood cost? I'm looking at doing a countertop just like that",
    "likes": 1,
    "video": "Can I Stain a Maple Butcher Block Countertop?",
    "video_id": "q7MOp2MIe9E"
  },
  {
    "text": "Well... it looks like I got scammed. Ordered through Gearbest, never received it. It's been 4 weeks. Gearbest has not been able to resolve my issue. Buyer beware. I was really wanting this...",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "THIS IS AWESOME!!! So many people make ALL of these mistakes using crappy Internet plans. I really hope a lot of people find this video before starting their projects. This is an extremely good concise way to teach everyone the mistakes not to make\n\nGood video!",
    "likes": 2,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Are you the long lost brother to John and Hank Green??? The passion and knowledge are 100% on point!!",
    "likes": 0,
    "video": "How to Make a Butcher Block Countertop // DIY Woodworking",
    "video_id": "8qQgcL-MQkU"
  },
  {
    "text": "Sorry actually on my wife's account, but a quick question.  I have been looking at a clinker press to cut out leather pieces.  They run about $1500 for the one I'm looking at, but then there is the cost of the clinker dies, which, adds more expense.  Do you think this could cut through 8 oz leather and how well do you think it would hold up cutting out leather patterns for wallets, bags, key chains, and the like?",
    "likes": 0,
    "video": "What can a $1500 50W Chinese laser actually cut?",
    "video_id": "6kCkrofspZU"
  },
  {
    "text": "Magnets on the bottom of both hilts and on the sides where they touch.",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Do you think bisquits can be fine instead of dowels? I need an excuse to use my damn useless bisquit joiner.. So please tell me yes",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Very cool video! I've been woodworking for just about 7-8 years now. When I see the first projects I did I see how wrong they are and how much I've improved.",
    "likes": 3,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "What made you use the CNC instead of the Laser engraver? Would it work with the laser engraver?",
    "likes": 1,
    "video": "Build a Rubber Stamp with a Removable Handle // DIY",
    "video_id": "8CALEo7obec"
  },
  {
    "text": "The interaction that you have with this product and explanations you do are awesome. This is the kind of videos I love to watch. Way to go bro. Great video. Answered a lot of questions for me. Subscribed 👍",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Great info, ultimately got me to purchase this unit, hopefully I can get it to do what you show in your vid. Buyer beware not going to ship quickly, going on 3 weeks and still processing order. Gives a process faster button which seems to do nothing and have to have Facebook if you want to chat with them. Nothing you can control, keep up the great content and thanks for the info.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "just got it ! THanks for the coupon COde Save $10, this is perfect for my engraving project will move to the Co2 50W laser or the glowforge later",
    "likes": 2,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "What would happen if you started out with a second or third balloon attached which was inflated with less helium?  Would they pop later, allowing the contraption to fly still higher ??",
    "likes": 21,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Also a router sled is a really good way to flatten a table top, you can make one fairly cheap.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Dowling is a good method for joining boards together, however I prefer biscuit joints myself much easier. You also do not have to be as precise with the holes aligning properly.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Great video! Just wish you had gone a little slower in your clicking around. Hard for us new kids to follow.  Thanks for the info though!",
    "likes": 4,
    "video": "Why are custom laser cut maps so hard to make?",
    "video_id": "khJhT46MQ5o"
  },
  {
    "text": "hi i'm would like to cut 1/8 to 1/4 inch kaizen type foam or any foam for some projects i have planned can this cut it ?\nnice video",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Mount it on a 2 inch high \"spacer\" then space the material up....",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Appreciate the breakdown...but how does it translate into dollars&cents?",
    "likes": 0,
    "video": "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review",
    "video_id": "lJWXR1Dd49c"
  },
  {
    "text": "Try the backside of a mirror it works very well when back lit you may have to  invert the image",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "1:05 balloon launch!\nAaaaaaand 2:16:23 is when the balloon pops",
    "likes": 14,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "Hey Make or Break Shop,  Thanks for this video!  Can this machine engrave on jewelry metals...such as: Sterling Silver, Brass, Bronze, Copper and/or Gold Plated?",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "You should make all videos a minimum of 10 minutes long.  You could have easily provided more detail here to get up to 10 minutes.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Interesting machine, Brandon. Thanks for putting it through its paces. I could see it being quite useful.",
    "likes": 1,
    "video": "Air Filter vs. Fire, Who wins in the shop?",
    "video_id": "8Gup4P6qJhI"
  },
  {
    "text": "So you need someone to hold your hand for safety 😂😂😂",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "Also, worth noting, those included glasses aren't rated for the laser on the machine. The tint vs color of the laser is a dead giveaway. If you look at any laser engraver and many high powered laser pointers of similar wavelength, the protective shielding or goggles are orange. It's basically a principle of opposing colors. It helps if you think of the color of the goggles cancelling out the color of the laser. In this case, the blue laser light is extremely close to the green goggles on the color wheel. The goggles let light in and around the green wavelength through. For the goggles to be effective in blocking the blue laser light, they should be red, or preferably orange, the opposing color to blue. \n\nSince they aren't clear or blue goggles, they are probably blocking some of the harmful light, but I definitely wouldn't trust my vision to them, especially if they were included free with a cheap and cheerful, safety measure delete laser engraver.\n\nEdit: It might be worse than I thought...I was just basing this off of a combination of my knowledge of optics, confirmed by the high end laser related products I've seen. I just looked it up and found this video. It looks like he has a pair of the included glasses, and they fail to even block an LED, so if you're staring at the laser light, you're probably roasting your retinas.\nhttps://youtu.be/upCsVrKrW7M\n\nHe also has an epic accent.\n\nEdit 2: Here's a video that goes more into depth on what you should look for in goggles to protect yourself. I am pretty confident that the ones included above are just green plastic, with no laser rating whatsoever. If one is listed, I'd be willing to bet that it's utter BS.\n\nLong and short of it, if you're gonna save a buck on your laser engraver, don't skimp on the PPE to go along with it. Or you'll be giving yourself anti-lasik.\n\nFinal Edit: I'm also only considering the harmful potential of the unshielded laser module. This is ignoring the carcinogen laden fumes it's outputting. There is a reason laser cutters are enclosed both behind laser shielded material AND have their own filtration and extraction systems. This could also very easily start a fire if you're not watching it like a hawk, and even if you are, I can see a mosquito fart knocking it over, or it overshooting the material it's engraving and scorching the surface beneath it. \n\nAs much as I want a laser cutter, this seems like a bad idea. 3d printers and CNC routers are one thing to downsize and lose all the safety gear. The damage they can do is pretty limited to localized burns and possibly losing a digit to a router bit. Laser cutters are next level dangerous.",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "I love this video i love rays dark side light saber",
    "likes": 0,
    "video": "Building a Hinged Lightsaber for Dark Rey // Star Wars",
    "video_id": "_0b7rFzYlSQ"
  },
  {
    "text": "Breadboard style edge is probably a more accurate description. Its the old way to stabilize the warping of, you guessed it, a breadboard.\nTip - when you peg the breadboard, elongate the peg holes in the main body of the table aside from the center peg.\nThis allows the table top to expand and contract without splitting the boards or your glue joints.",
    "likes": 2,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "Dowels are totally unnecessary on long grain glue ups. The only thing gained is alignment if your boards are not truly flat. Never have used this method in 40 years of making furniture. The bread board end helps to keep the table top flat along with alternating growth rings.",
    "likes": 0,
    "video": "6 Mistakes Not to Make When Building a Farmhouse Table",
    "video_id": "1h43STNsrpg"
  },
  {
    "text": "wonder if you could give yourself a tattoo with something like this...",
    "likes": 1,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "buys a laser that can easily cut acrylic. Minutes later says the acrylic window on the machine is good enough to block a stray C02 laser beam... BRUH. :/",
    "likes": 0,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "Nice review! Would it be possible, to run it with Linux Mint 19.3?",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "very cool video! Great way to show the flat-Earth believers there there is, in fact, curvature to the Earth! I found this on Instructables and subscribed. Nice job!",
    "likes": 4,
    "video": "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)",
    "video_id": "XPweRTljgG4"
  },
  {
    "text": "4:48 this movement you're seeing is from the rods bending. NOT from the 3D printed parts.",
    "likes": 0,
    "video": "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review",
    "video_id": "JtoYgZEl8Mw"
  },
  {
    "text": "Would this be a good machine for man-scaping?  \nSeriously, enjoyed the video.",
    "likes": 1,
    "video": "Did I Waste $1500 on a 50W Laser Cutter from China?",
    "video_id": "Zo9UNg99wtw"
  },
  {
    "text": "I guess u are able to adjust the focus point by turning lenses  black ring 🤔😅",
    "likes": 0,
    "video": "Does a $200 Laser Engraver Make Sense in Your Shop?",
    "video_id": "y00ypF2sqyg"
  },
  {
    "text": "You should do a giveaway of the star wars things you made",
    "likes": 2,
    "video": "What Makes a Better Lightsaber?  Wood or 3D Printed?",
    "video_id": "6Y4UOGuAyqE"
  },
  {
    "text": "Enjoy woodprix instructions woodworking Instructions.",
    "likes": 0,
    "video": "3 Ways to Make Wooden Shims (DIY Wedges)",
    "video_id": "T5sel2Q3a-Y"
  }
]