{
  "batchNumber": 3,
  "totalComments": 250,
  "videoDistribution": {
    "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)": 19,
    "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review": 44,
    "Building a Hinged Lightsaber for Dark Rey // Star Wars": 7,
    "Did I Waste $1500 on a 50W Laser Cutter from China?": 18,
    "Designing Furniture with Fusion 360 for Absolute Beginners!": 10,
    "3 Ways to Make Wooden Shims (DIY Wedges)": 3,
    "Can I Stain a Maple Butcher Block Countertop?": 6,
    "What is the Best Laser Cutter and Engraver for You?": 9,
    "Is Fusion 360 worth learning over Sketchup?": 12,
    "How to Make a Butcher Block Countertop // DIY Woodworking": 4,
    "Build a Rubber Stamp with a Removable Handle // DIY": 3,
    "Does a $200 Laser Engraver Make Sense in Your Shop?": 32,
    "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review": 10,
    "6 Mistakes Not to Make When Building a Farmhouse Table": 14,
    "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review": 8,
    "Why are custom laser cut maps so hard to make?": 9,
    "Carved Wooden Football Stadium Signs on the CNC // DIY": 1,
    "What can a $1500 50W Chinese laser actually cut?": 2,
    "I Sent Baby Yoda to Space (sort of....)": 2,
    "Air Filter vs. Fire, Who wins in the shop?": 2,
    "How to Make a Cedar Window Planter Box": 1,
    "Is a Budget $250 3D Printer worth it? Alfawise U30 Pro Review": 1,
    "Building a Simple (and Cheap!) Miter Station + Storage for the Shop": 3,
    "This is Why I Use Fusion 360 to Make a Bed.": 1,
    "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY": 3,
    "Sending a 360 Camera to the Edge of Space - Insta360 One X": 3,
    "How to Build a Crib for the Nursery! | DIY Woodworking": 4,
    "Carving a Baby Groot Planter out of Wood": 1,
    "Build a Built-In Closet Organizer (Woodworking DIY)": 3,
    "Building a Modular Paint Organization System": 6,
    "DIY X-Wing Swing from Star Wars!": 1,
    "Making Super Tiny Furniture! (Miniatures for a Dollhouse)": 5,
    "Custom Farmhouse Sink, Dials and Oven Top for a Play Kitchen // DIY": 1,
    "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review": 1,
    "What Makes a Better Lightsaber?  Wood or 3D Printed?": 1
  },
  "processedAt": "2025-08-18T19:42:43.652Z"
}