{
  "batchNumber": 4,
  "totalComments": 250,
  "videoDistribution": {
    "Does a $200 Laser Engraver Make Sense in Your Shop?": 17,
    "Is Fusion 360 worth learning over Sketchup?": 6,
    "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review": 9,
    "Can I Stain a Maple Butcher Block Countertop?": 3,
    "6 Mistakes Not to Make When Building a Farmhouse Table": 8,
    "Building a Bluetooth Speaker into a Side Table": 2,
    "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)": 11,
    "Designing Furniture with Fusion 360 for Absolute Beginners!": 2,
    "Why are custom laser cut maps so hard to make?": 6,
    "I Sent Baby Yoda to Space (sort of....)": 16,
    "Is a Budget $250 3D Printer worth it? Alfawise U30 Pro Review": 1,
    "Sending a 360 Camera to the Edge of Space - Insta360 One X": 13,
    "What can a $1500 50W Chinese laser actually cut?": 3,
    "Did I Waste $1500 on a 50W Laser Cutter from China?": 1,
    "Build a Baby Gate (for cheap) // DIY Woodworking": 1,
    "Laser Cutting Eleven's Head From Stranger Things (DIY Lightbox)": 1,
    "Building a Hinged Lightsaber for Dark Rey // Star Wars": 3,
    "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review": 6,
    "How to Make a Simple Tool Wall for a Garage Workshop": 1,
    "Cut Straight Edges without a Jointer on the Table Saw": 1,
    "How to Make a Butcher Block Countertop // DIY Woodworking": 2,
    "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review": 4,
    "Cheaper and Better?  Atomstack X7 Pro Laser Engraver Review": 15,
    "The Most Powerful Laser Diode? NEJE Master 2S Plus A40640 Laser": 18,
    "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review": 4,
    "The Nicest Laser Engraver This Year? The xTool D1 Review": 9,
    "The Best Laser Cutter for any Budget?": 18,
    "What can a $300 CNC do? - Ortur Aufero CNC Engraver Review": 3,
    "How to Make Money with Laser Engraved Ceramic Tiles + Ortur Pro GIVEAWAY!": 2,
    "Should you upgrade a budget laser cutter?": 1,
    "The Best Budget Laser Engraver: Ortur Aufero Laser 1 Review": 3,
    "Is a 40W CO2 Laser Cutter Worth?  OM Tech K40 Review": 6,
    "NEW favorite diode laser engraver? Ortur Laser Master Engraver 2 Pro!": 3,
    "I've Never Seen A Laser Do THIS Before! - Laserpecker 2 Review": 39,
    "This Laser Can Engrave METAL!  -  OMTech 20W Fiber Laser Review": 1,
    "Building a Picture Frame Ron Swanson Would be Proud Of // DIY Half Lap Joints and Dowels": 1,
    "What is the Best Laser Cutter and Engraver for You?": 3,
    "Should You Buy a Glowforge?": 1,
    "SparkMaker LaserPro: The new King 👑 of budget laser engravers?": 1,
    "Making the Elder Wand from Harry Potter out of Walnut | DIY": 1,
    "How to Make a Cedar Window Planter Box": 1,
    "The Worlds FASTEST Laser Engraver? Laserpecker Pro Review": 2,
    "The Longer LK5 Pro is Big and Cheap. But is this 3d Printer worth it?": 1
  },
  "processedAt": "2025-08-18T19:49:03.094Z"
}