{
  "batchNumber": 2,
  "totalComments": 250,
  "videoDistribution": {
    "What is the Best Laser Cutter and Engraver for You?": 80,
    "Why are custom laser cut maps so hard to make?": 6,
    "Welded DIY Metal Bed, This is What I MESSED Up": 1,
    "Laser Engraved Cups! Using a Rotary Attachment on the Muse Full Spectrum Laser": 8,
    "Is this the BEST budget Laser Engraver? Ortur Laser Master Engrave 2 Review": 54,
    "Full Flight of Insta360 Weather Balloon Flight (Plus Fighter Jet Fly By!)": 9,
    "Did I Waste $1500 on a 50W Laser Cutter from China?": 12,
    "Building a Simple (and Cheap!) Miter Station + Storage for the Shop": 4,
    "Does a $200 Laser Engraver Make Sense in Your Shop?": 11,
    "Night Sky Star Map Wall Sign (THAT LIGHTS UP!!)  // DIY": 1,
    "What is a 3D Laser Cutter?  Full Spectrum Muse 3D Review": 14,
    "Is Fusion 360 worth learning over Sketchup?": 5,
    "Can I Stain a Maple Butcher Block Countertop?": 5,
    "How to Make a Kids Play Kitchen: The Frame/Doors/Drawers!": 1,
    "This is Why I Use Fusion 360 to Make a Bed.": 2,
    "What can a $1500 50W Chinese laser actually cut?": 3,
    "Is a Sub $250 CNC worth it?  Alfawise C10 CNC & Laser Review": 4,
    "Carving a Baby Groot Planter out of Wood": 1,
    "Designing Furniture with Fusion 360 for Absolute Beginners!": 9,
    "How to Make a Cedar Window Planter Box": 2,
    "3 Ways to Make Wooden Shims (DIY Wedges)": 1,
    "Build a Rubber Stamp with a Removable Handle // DIY": 2,
    "How to Make a Butcher Block Countertop // DIY Woodworking": 3,
    "Building a Hinged Lightsaber for Dark Rey // Star Wars": 2,
    "Sending a 360 Camera to the Edge of Space - Insta360 One X": 2,
    "Building a Picture Frame Ron Swanson Would be Proud Of // DIY Half Lap Joints and Dowels": 1,
    "How to make Dovetail Joints in Fusion 360 - Woodworking Joints": 2,
    "6 Mistakes Not to Make When Building a Farmhouse Table": 2,
    "How to Build a Crib for the Nursery! | DIY Woodworking": 1,
    "This is How Much YouTube Paid me for My 300,000 View Chinese Laser Review": 1,
    "Simple Wooden Book Shelves (for a nursery!)": 1
  },
  "processedAt": "2025-08-18T19:33:26.211Z"
}