{
  "samples": [
    {
      "title": "EXTREME CLEAN & DECLUTTER 2022 / COMPLETE DISASTER CLEAN WITH ME / MAJOR DECLUTTERING MOTIVATION",
      "summary": "The video showcases an extreme cleaning and decluttering session in a home, highlighting the challenges of managing a household with a newborn while demonstrating practical cleaning and organizing techniques.",
      "firstWords": "the video showcases"
    },
    {
      "title": "40 Year Old Camper Renovation - Bad Idea?",
      "summary": "In this video, Laura Kampf takes on the renovation of a very old camper that appears to have been neglected and damaged, exploring the challenges and decisions involved in restoring it. She reflects on whether taking on this project was a mistake.",
      "firstWords": "in this video,"
    },
    {
      "title": "Woodworking Ideas For Kids // How To Make A Super Cool Wooden Balance Bike",
      "summary": "The video teaches viewers how to create a wooden balance bike for kids, showcasing woodworking techniques and ideas suitable for children's projects.",
      "firstWords": "the video teaches"
    },
    {
      "title": "Creative Design Ideas From Cheap Wood // Creative Night Light Personality Carved Space Rocket Light",
      "summary": "The video showcases creative design ideas for making a night light by carving a space rocket from inexpensive wood, demonstrating the woodworking techniques involved in the project.",
      "firstWords": "the video showcases"
    },
    {
      "title": "Bullet Headphones - Fall 2016 giveaway Winner",
      "summary": "The video announces the winner of the Bullet Headphones giveaway, congratulating Jake Weaver from GB.",
      "firstWords": "the video announces"
    },
    {
      "title": "Unique Wood Processing Project: Building A Jacket Lock-Inspired Table",
      "summary": "The video demonstrates the process of building a table inspired by the zipper pull of a jacket, showcasing unique wood processing techniques.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "\"Bike Slide Pro Installation – Fast & Easy Setup Tutorial!",
      "summary": "This video provides a step-by-step tutorial on how to install the Bike Slide Pro rack, guiding viewers through the entire process from unboxing to mounting for secure bike storage. It is designed for both experienced DIYers and beginners, ensuring an easy installation experience.",
      "firstWords": "this video provides"
    },
    {
      "title": "The INCREDIBLE Harmony Of Studio Ghibli Themes",
      "summary": "The video explores the musical themes of Studio Ghibli films, highlighting their harmony and emotional depth through piano performance.",
      "firstWords": "the video explores"
    },
    {
      "title": "What has Hans Niemann done?",
      "summary": "The video discusses the controversies surrounding chess player Hans Niemann, including allegations of cheating and the implications for the chess community. It analyzes the evidence and opinions regarding his conduct and the broader impact on the game.",
      "firstWords": "the video discusses"
    },
    {
      "title": "995,961,947,392,035,691 ELO CHESS!!!",
      "summary": "The video discusses an exaggerated scenario of achieving an astronomical ELO rating in chess, likely using humor and satire to highlight the absurdity of such a high ranking in the game. It may also touch on chess strategies or concepts in a lighthearted manner.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Masterful Woodworking Techniques // Crafting A Special Dining Table for 6",
      "summary": "The video demonstrates advanced woodworking techniques used by experienced carpenters to craft a functional and aesthetically pleasing dining table for six, highlighting the selection of materials and the detailed construction process.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "Weekend Woodworking For DIY Enthusiasts // How To Make A Easy Wooden Pallet Peddler",
      "summary": "The video teaches viewers how to create an easy wooden pallet peddler, providing step-by-step instructions for DIY woodworking enthusiasts.",
      "firstWords": "the video teaches"
    },
    {
      "title": "Pokemon Red: The OPPOSITE of a Speed Run  |  Skeeball Build part 2",
      "summary": "The video showcases a unique gameplay experience of Pokémon Red, focusing on a Skeeball build that contrasts with traditional speedrunning techniques, emphasizing a more leisurely and exploratory approach to the game.",
      "firstWords": "the video showcases"
    },
    {
      "title": "How To Win At Chess... A LOT",
      "summary": "The video teaches strategies and tips to improve your chess game, focusing on techniques to win more frequently and enhance overall gameplay.",
      "firstWords": "the video teaches"
    },
    {
      "title": "Woodworking Has Never Been So Easy // Beautiful Handmade Wooden Lamps That You Can Make Right Away",
      "summary": "The video demonstrates how to create beautiful handmade wooden lamps, providing step-by-step instructions that make woodworking accessible and easy for beginners.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "Honest YoungLA 2024 Black Friday Sale Try on Haul (Every Item)",
      "summary": "In this video, Casey Kelly tries on and styles every item from the YoungLA 2024 Black Friday sale, providing honest opinions on various clothing categories including sweats, gym wear, streetwear, and winter outerwear.",
      "firstWords": "in this video,"
    },
    {
      "title": "EXTREME WHOLE HOUSE CLEAN WITH ME 2023 / SMALL HOME RESET CLEANING MOTIVATION / CATHERINE ELAINE",
      "summary": "The video showcases a thorough cleaning and organizing process in a small home, including tasks in the kitchen, dining room, and living room, as well as cleaning under furniture for a complete home reset. It aims to provide viewers with cleaning motivation.",
      "firstWords": "the video showcases"
    },
    {
      "title": "99% of Chess Players Make This Mistake.",
      "summary": "The video discusses a common mistake that 99% of chess players make, likely focusing on strategic errors or misconceptions that hinder their performance in the game.",
      "firstWords": "the video discusses"
    },
    {
      "title": "EVERYONE is Cheating at Chess??????",
      "summary": "The video discusses the prevalence of cheating in chess, exploring the implications and consequences of this issue within the chess community. It examines various methods of cheating and the impact it has on the integrity of the game.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Chess Bot Sacrifices EVERYTHING",
      "summary": "The video discusses a chess bot that employs aggressive strategies, showcasing how it sacrifices pieces to gain a tactical advantage and ultimately win games.",
      "firstWords": "the video discusses"
    },
    {
      "title": "It took me 3 seconds to realize how STRONG this kid is at chess",
      "summary": "The video showcases a young chess player demonstrating impressive skills and strategies, highlighting their strength and talent in the game of chess.",
      "firstWords": "the video showcases"
    },
    {
      "title": "Mikhail Tal Sacrifices EVERYTHING",
      "summary": "The video discusses the legendary chess player Mikhail Tal and his bold, sacrificial playing style, showcasing key games and strategies that exemplify his approach to chess.",
      "firstWords": "the video discusses"
    },
    {
      "title": "How I made this amazing PROJECTING HOLLOW CLOCK!  - DIY Project Guide",
      "summary": "This video teaches viewers how to 3D print and assemble a Hollow Shadow Clock that projects an analogue clock face onto surfaces, with features like color and brightness control, as well as programmable schedules via a web-server and WiFi connection.",
      "firstWords": "this video teaches"
    },
    {
      "title": "HILARIOUS Chess Cheater Gets Exposed",
      "summary": "The video discusses a chess player who was caught cheating during a tournament, highlighting the methods used to expose the cheating and the reactions from the chess community.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Can't Miss These Great Ideas // Wooden Watches Inspired By Wristwatches",
      "summary": "The video provides detailed instructions on how to create wall clocks that are inspired by wristwatches.",
      "firstWords": "the video provides"
    },
    {
      "title": "Amazing Jack From Sprocket Build Handymans Won’t Tell You About",
      "summary": "The video demonstrates the process of building a jack from a sprocket, showcasing techniques and tips that handymen may not commonly share. It focuses on practical skills and creative problem-solving in DIY projects.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "Woodworking Idea Reimagining 1869 Rickshaw // Steps To Complete A Antique Rickshaw",
      "summary": "The video demonstrates the process of reimagining and constructing an antique rickshaw from 1869, showcasing creative woodworking techniques and steps involved in the project.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "How to ALWAYS Win at Chess",
      "summary": "The video discusses strategies and techniques to improve your chess game, focusing on tactics that can help players consistently win. It emphasizes key concepts and approaches that can be applied in various chess scenarios.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Mastering the Curve! 70 Year Old Woodworking Wizard! Woodworking That'll Blow Your Mind!",
      "summary": "The video showcases the impressive woodworking skills of a 70-year-old craftsman, demonstrating techniques for creating beautifully curved wooden furniture and art pieces. It highlights the craftsmanship involved in woodworking and the artistry behind designing functional yet stunning wooden items.",
      "firstWords": "the video showcases"
    },
    {
      "title": "The Man Who Invented Chess",
      "summary": "The video discusses the history and origins of chess, exploring the story of its invention and the cultural significance it has held throughout time.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Internet Comment Etiquette: 2015 Syllabus",
      "summary": "The video introduces the concept of Internet Comment Etiquette and provides an overview of what viewers can expect from the channel, including discussions on various topics related to online interactions and humor.",
      "firstWords": "the video introduces"
    },
    {
      "title": "HotMakes Live Stream Episode 51 - Featuring the 3D Printing Nerd - Joel Telling",
      "summary": "The video features a live stream where Joel Telling, the 3D Printing Nerd, judges entries in the Torture Toasters contest, selecting winners for categories such as Largest, Smallest, and Best Looking.",
      "firstWords": "the video features"
    },
    {
      "title": "HOW TO WIN AT CHESS!!!!!!!",
      "summary": "The video teaches strategies and techniques to improve at chess, focusing on key concepts that can help players win more games.",
      "firstWords": "the video teaches"
    },
    {
      "title": "BEST CHESS GAME OF THE 21st CENTURY!",
      "summary": "The video analyzes what is considered the best chess game of the 21st century, highlighting key moves, strategies, and the overall significance of the match in the context of modern chess.",
      "firstWords": "the video analyzes"
    },
    {
      "title": "WOW that was a mess!!! EXTREME WHOLE HOUSE CLEANING & ORGANIZING!",
      "summary": "The video showcases an extreme whole house cleaning and organizing process, demonstrating effective cleaning techniques and organizational tips to transform a messy home into a tidy space.",
      "firstWords": "the video showcases"
    },
    {
      "title": "School Science Projects | Elevator Working Model",
      "summary": "The video teaches viewers how to create a working model of an elevator using simple materials like cardboard, color paper, bamboo sticks, and thread, while also explaining the basic concepts behind how elevators function.",
      "firstWords": "the video teaches"
    },
    {
      "title": "This Chess Opening WINS 100% of the Time",
      "summary": "The video discusses a specific chess opening that is claimed to win 100% of the time, providing insights into its strategies and tactics.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Warning If You Don't See The Impossible: Turns Worthless Round Wood Pieces To 5,000 USD Coffee Table",
      "summary": "The video demonstrates how to transform seemingly worthless round wood pieces into a high-value coffee table worth $5,000, showcasing woodworking techniques and creative design processes.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "Elegoo Neptune 3 MAX VS Creality CR-M4!  Can $470 beat $1100??",
      "summary": "The video compares the performance and quality of the Elegoo Neptune 3 MAX, a budget-friendly 3D printer, against the more expensive Creality CR-M4, exploring whether the lower-cost option can compete with the higher-end model in terms of build volume and reliability for cosplay enthusiasts.",
      "firstWords": "the video compares"
    },
    {
      "title": "Odin Makes: Odin’s Head (full head cast)",
      "summary": "In this video, Odin Abbott demonstrates the process of creating a full head cast, showcasing the techniques and materials used in the casting process.",
      "firstWords": "in this video,"
    },
    {
      "title": "WINNING THE TITLE!!!!!!!!!",
      "summary": "The video discusses the journey and strategies involved in winning a chess title, showcasing key moments and insights from competitive play. It emphasizes the importance of preparation, mindset, and tactical execution in achieving success in chess tournaments.",
      "firstWords": "the video discusses"
    },
    {
      "title": "HOW?????????????????",
      "summary": "The video discusses various aspects of chess, focusing on strategies, tactics, and insights that can help players improve their game.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Top-secret 5 Woodworking Projects Break All Human Limits - Revive Stumps Create Woodworking Products",
      "summary": "The video showcases five innovative woodworking projects that utilize stumps to create unique and functional woodworking products, pushing the boundaries of traditional woodworking techniques.",
      "firstWords": "the video showcases"
    },
    {
      "title": "Is Wood Movement a Myth? Analyzing 30 Years of Data",
      "summary": "The video discusses the realities of wood movement, utilizing data from the \"Wood Handbook - Wood as an Engineering Material\" to explain how to calculate wood movement accurately without specialized tools. It aims to clarify misconceptions about the extent of wood movement and emphasizes the importance of location in understanding this phenomenon.",
      "firstWords": "the video discusses"
    },
    {
      "title": "How to build a MASSIVE Raised Garden - For Wheelchair Users!",
      "summary": "The video demonstrates how to build a large raised garden specifically designed for wheelchair users, detailing the materials used, dimensions of the garden, and the construction process completed over a weekend. It also invites viewers to share planting tips for the garden.",
      "firstWords": "the video demonstrates"
    },
    {
      "title": "15 MINUTE LIGHTWEIGHT DUMBBELL SHOULDERS & TRAPS WORKOUT!",
      "summary": "This video demonstrates a 15-minute lightweight dumbbell workout focused on strengthening the shoulders and traps, featuring exercises such as side shrugs, push presses, shoulder presses, and Arnold presses. It is designed to be performed with dumbbells weighing between 5-30lbs and can be done anywhere.",
      "firstWords": "this video demonstrates"
    },
    {
      "title": "NO NO NO NO NO NO NO!!!!!!!!!!",
      "summary": "The video discusses a critical moment in a chess game where a player makes a significant mistake, highlighting the importance of careful decision-making and the potential consequences of blunders in chess.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Chess 2.0 by Magnus Carlsen",
      "summary": "The video discusses the evolution of chess strategies and techniques, particularly focusing on insights from Magnus Carlsen's approach to the game. It highlights key concepts and modern trends in chess that can enhance players' understanding and skills.",
      "firstWords": "the video discusses"
    },
    {
      "title": "Adam Savage Makes a Machining \"Cheese Plate\"!",
      "summary": "In this video, Adam Savage demonstrates the process of machining a \"cheese plate\" for a rotary table, which is essential for fabricating neck joints for a T-Rex stop-motion armature. He emphasizes the importance of the journey in building tools as part of the overall creative process.",
      "firstWords": "in this video,"
    },
    {
      "title": "Beating Magnus Carlsen With 99% Accuracy",
      "summary": "The video discusses a chess game where the player achieves a remarkable 99% accuracy while competing against Magnus Carlsen, highlighting key strategies and moves that led to this impressive performance.",
      "firstWords": "the video discusses"
    }
  ],
  "patterns": [
    [
      "the video discusses",
      16
    ],
    [
      "the video showcases",
      8
    ],
    [
      "the video demonstrates",
      7
    ],
    [
      "the video teaches",
      5
    ],
    [
      "in this video,",
      4
    ],
    [
      "the video announces",
      1
    ],
    [
      "this video provides",
      1
    ],
    [
      "the video explores",
      1
    ],
    [
      "this video teaches",
      1
    ],
    [
      "the video provides",
      1
    ],
    [
      "the video introduces",
      1
    ],
    [
      "the video features",
      1
    ],
    [
      "the video analyzes",
      1
    ],
    [
      "the video compares",
      1
    ],
    [
      "this video demonstrates",
      1
    ]
  ],
  "statistics": {
    "total": 50,
    "startsWithTheVideo": 43,
    "startsWithThisVideo": 3,
    "startsWithInThisVideo": 4
  }
}